---------------------------------------------------------------------------------
       log:  C:\Documents and Settings\jwang\Desktop\HM-Union_table9.log
  log type:  text
 opened on:  29 May 2008, 17:58:59

. set matsize 450;

Current memory allocation

                    current                                 memory usage
    settable          value     description                 (1M = 1024k)
    --------------------------------------------------------------------
    set maxvar         5000     max. variables allowed           1.909M
    set memory           10M    max. data space                 10.000M
    set matsize         450     max. RHS vars in models          1.583M
                                                            -----------
                                                                13.492M

. set mem 20m;

Current memory allocation

                    current                                 memory usage
    settable          value     description                 (1M = 1024k)
    --------------------------------------------------------------------
    set maxvar         5000     max. variables allowed           1.909M
    set memory           20M    max. data space                 20.000M
    set matsize         450     max. RHS vars in models          1.583M
                                                            -----------
                                                                23.492M

. use eow-svcs.dta;
(EOW SVCs, CPS, rulings research data set)

. * Weights;
. egen empwt=mean(annemp) if year>=79 & year<=95, by(state);
(350 missing values generated)

. if "`1'"!="wt" {;
.  replace empwt=1;
(1200 real changes made)
.  };

. * Log total employment - from BLS employment & earnings;
. gen lnemp=ln(annemp);

. * Non-business-service sector employment from CBP;
. gen nonemp= stateemp-svcemp;
(200 missing values generated)

. gen lnnon=ln(nonemp);
(200 missing values generated)

. gen svcfrac= svcemp/nonemp;
(200 missing values generated)

. * Total business services employment from CBP;
. gen bizemp= svcemp+peremp;
(200 missing values generated)

. gen lnbiz = ln(biz);
(200 missing values generated)

. * Add Hirsch-Macpherson-Vroman union data;
. sort state year;

. merge state year using hm-union-6400.dta;

. drop if state==53;
(37 observations deleted)

. assert _merge==3 if year>=79 & year<=95;

. xi: reg unmem hm_union i.state i.year;
i.state           _Istate_11-95       (naturally coded; _Istate_11 omitted)
i.year            _Iyear_0-99         (naturally coded; _Iyear_0 omitted)

      Source |       SS       df       MS              Number of obs =    1150
-------------+------------------------------           F( 72,  1077) =  270.42
       Model |  6.92869717    72  .096231905           Prob > F      =  0.0000
    Residual |  .383262818  1077  .000355861           R-squared     =  0.9476
-------------+------------------------------           Adj R-squared =  0.9441
       Total |  7.31195999  1149   .00636376           Root MSE      =  .01886

------------------------------------------------------------------------------
       unmem |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    hm_union |   .0059263   .0003174    18.67   0.000     .0053036     .006549
  _Istate_12 |  -.0189819   .0057854    -3.28   0.001    -.0303339   -.0076299
  _Istate_13 |  -.0253323   .0057508    -4.41   0.000    -.0366163   -.0140483
  _Istate_14 |   .0041162   .0055997     0.74   0.462    -.0068713    .0151036
  _Istate_15 |   .0056622   .0056923     0.99   0.320     -.005507    .0168315
  _Istate_16 |   .0077014    .005653     1.36   0.173    -.0033907    .0187935
  _Istate_21 |   .0607174   .0068734     8.83   0.000     .0472305    .0742042
  _Istate_22 |   .0126345   .0060637     2.08   0.037     .0007366    .0245325
  _Istate_23 |   .0207175   .0060211     3.44   0.001      .008903    .0325319
  _Istate_31 |   .0316291    .005945     5.32   0.000     .0199639    .0432942
  _Istate_32 |   .0211553   .0058402     3.62   0.000     .0096959    .0326147
  _Istate_33 |   .0326274   .0058594     5.57   0.000     .0211303    .0441245
  _Istate_34 |    .045536   .0066713     6.83   0.000     .0324458    .0586263
  _Istate_35 |   .0195465   .0058306     3.35   0.001     .0081059    .0309871
  _Istate_41 |   .0177309   .0057858     3.06   0.002     .0063782    .0290836
  _Istate_42 |  -.0062048   .0055628    -1.12   0.265    -.0171201    .0047104
  _Istate_43 |   .0296049    .005564     5.32   0.000     .0186873    .0405225
  _Istate_44 |  -.0139145     .00582    -2.39   0.017    -.0253343   -.0024948
  _Istate_45 |  -.0307664   .0060112    -5.12   0.000    -.0425613   -.0189715
  _Istate_46 |  -.0123376   .0057238    -2.16   0.031    -.0235687   -.0011066
  _Istate_47 |  -.0174027   .0058107    -2.99   0.003    -.0288043   -.0060012
  _Istate_51 |   .0070497   .0055687     1.27   0.206     -.003877    .0179765
  _Istate_52 |   .0047485   .0055656     0.85   0.394    -.0061721    .0156691
  _Istate_54 |  -.0207061   .0060615    -3.42   0.001    -.0325997   -.0088124
  _Istate_55 |   .0203446   .0058846     3.46   0.001      .008798    .0318911
  _Istate_56 |  -.0239343   .0066698    -3.59   0.000    -.0370216    -.010847
  _Istate_57 |   -.034588   .0068581    -5.04   0.000    -.0480447   -.0211313
  _Istate_58 |  -.0124623   .0061721    -2.02   0.044    -.0245731   -.0003516
  _Istate_59 |  -.0142429   .0061841    -2.30   0.021    -.0263772   -.0021086
  _Istate_61 |   .0003731   .0055682     0.07   0.947    -.0105526    .0112989
  _Istate_62 |  -.0070388   .0056694    -1.24   0.215    -.0181631    .0040854
  _Istate_63 |  -.0009285   .0055927    -0.17   0.868    -.0119024    .0100454
  _Istate_64 |  -.0296423   .0061402    -4.83   0.000    -.0416904   -.0175942
  _Istate_71 |  -.0099045   .0060506    -1.64   0.102    -.0217768    .0019677
  _Istate_72 |  -.0114959   .0059874    -1.92   0.055    -.0232441    .0002524
  _Istate_73 |   -.006986   .0059727    -1.17   0.242    -.0187055    .0047335
  _Istate_74 |  -.0137284    .006322    -2.17   0.030    -.0261332   -.0013237
  _Istate_81 |   .0058391   .0056208     1.04   0.299      -.00519    .0168681
  _Istate_82 |  -.0172777   .0057428    -3.01   0.003    -.0285461   -.0060094
  _Istate_83 |  -.0063109   .0056786    -1.11   0.267    -.0174532    .0048315
  _Istate_84 |   .0051044   .0058314     0.88   0.382    -.0063378    .0165467
  _Istate_85 |  -.0209589   .0059742    -3.51   0.000    -.0326813   -.0092365
  _Istate_86 |  -.0080217   .0061268    -1.31   0.191    -.0200436    .0040002
  _Istate_87 |    -.00383   .0057672    -0.66   0.507    -.0151462    .0074863
  _Istate_88 |   .0300419   .0056876     5.28   0.000     .0188818     .041202
  _Istate_91 |   .0423689   .0062786     6.75   0.000     .0300493    .0546886
  _Istate_92 |   .0241643   .0057539     4.20   0.000      .012874    .0354545
  _Istate_93 |   .0275193   .0056423     4.88   0.000     .0164482    .0385904
  _Istate_94 |   .0348698   .0060775     5.74   0.000     .0229447    .0467949
  _Istate_95 |   .0405591   .0066843     6.07   0.000     .0274433    .0536748
   _Iyear_64 |  (dropped)
   _Iyear_65 |  (dropped)
   _Iyear_66 |  (dropped)
   _Iyear_67 |  (dropped)
   _Iyear_68 |  (dropped)
   _Iyear_69 |  (dropped)
   _Iyear_70 |  (dropped)
   _Iyear_71 |  (dropped)
   _Iyear_72 |  (dropped)
   _Iyear_73 |  (dropped)
   _Iyear_74 |  (dropped)
   _Iyear_75 |   .0118355   .0037743     3.14   0.002     .0044297    .0192414
   _Iyear_76 |  (dropped)
   _Iyear_77 |  -.0055655   .0037799    -1.47   0.141    -.0129822    .0018513
   _Iyear_78 |  -.0117473    .003797    -3.09   0.002    -.0191977   -.0042969
   _Iyear_79 |  -.0263327   .0037769    -6.97   0.000    -.0337436   -.0189217
   _Iyear_80 |  -.0329056   .0037892    -8.68   0.000    -.0403407   -.0254705
   _Iyear_81 |  -.0366085   .0037939    -9.65   0.000    -.0440527   -.0291643
   _Iyear_82 |  -.0330338   .0038642    -8.55   0.000    -.0406161   -.0254516
   _Iyear_83 |  -.0769453   .0039815   -19.33   0.000    -.0847577   -.0691329
   _Iyear_84 |  -.0757417   .0041056   -18.45   0.000    -.0837976   -.0676858
   _Iyear_85 |   -.076085   .0041789   -18.21   0.000    -.0842847   -.0678853
   _Iyear_86 |  -.0765918   .0042651   -17.96   0.000    -.0849607   -.0682229
   _Iyear_87 |  -.0762374   .0043076   -17.70   0.000    -.0846896   -.0677851
   _Iyear_88 |  -.0754102   .0043354   -17.39   0.000    -.0839171   -.0669033
   _Iyear_89 |   -.076104   .0044059   -17.27   0.000    -.0847491   -.0674589
   _Iyear_90 |  -.0771999    .004444   -17.37   0.000    -.0859199     -.06848
   _Iyear_91 |  -.0783448   .0044414   -17.64   0.000    -.0870595   -.0696301
   _Iyear_92 |  -.0791495   .0044916   -17.62   0.000    -.0879628   -.0703362
   _Iyear_93 |  -.0788976   .0045302   -17.42   0.000    -.0877867   -.0700085
   _Iyear_94 |  -.0791253   .0045643   -17.34   0.000    -.0880812   -.0701695
   _Iyear_95 |  -.0791671   .0046369   -17.07   0.000    -.0882654   -.0700687
   _Iyear_96 |  -.0794732   .0047076   -16.88   0.000    -.0887104    -.070236
   _Iyear_97 |  -.0800444   .0047995   -16.68   0.000    -.0894619    -.070627
   _Iyear_98 |  (dropped)
   _Iyear_99 |  (dropped)
       _cons |   .1062819   .0086856    12.24   0.000     .0892393    .1233246
------------------------------------------------------------------------------

. keep if year>=79 & year<=95;
(1000 observations deleted)

. * State dummies, year dummies, and state*time trends;
. gen t=year-78;

. gen t2=t^2;

. drop if state==98;
(0 observations deleted)

. xi i.state i.year i.state*t i.state*t2 i.region*i.year;
i.state           _Istate_11-95       (naturally coded; _Istate_11 omitted)
i.year            _Iyear_79-95        (naturally coded; _Iyear_79 omitted)
i.state*t         _IstaXt_#           (coded as above)
i.state*t2        _IstaXt2_#          (coded as above)
i.region          _Iregion_1-9        (naturally coded; _Iregion_1 omitted)
i.reg~n*i.year    _IregXyea_#_#       (coded as above)

. * Working sample;
. gen year1 = year>=79 & year<=95;

. keep if year1;
(0 observations deleted)

. gen year2 = ((int(year/2)*2 + 1)==year);

. gen year4 = (year==79 | year==83 | year==87 | year==91 | year==95);

. * Generate more aggregate demos;
. gen clp=clg+gtc;

. gen a1624=m1619+m2024+f1619+f2024;

. gen a2554=m2554+f2554;

. gen a55up=m5564+m65up+f5564+f65up;

. gen fem=f1619+f2024+f2554+f5564+f65up;

. gen white=rs_wm+rs_wf;

. gen black=rs_bm+rs_bf;

. gen other=rs_om+rs_of;

. gen married=marfem+marmale;

. * Modify union variable so that:
>   1 - We don't use interpolated data for 1979 & 1981
>   2 - Turn from fraction into percent so that coefficient will be friendly si
> ze;
. replace unmem=. if year==79 | year==81;
(100 real changes made, 100 to missing)

. replace unmem=unmem*100;
(750 real changes made)

. ******************************************;
. ** Table 9: Other service employment
> ******************************************;
. reg lnbiz lnemp hm_union mico mppa mgfa _Iyear* _Istat* _IstaXt_* [aw=empwt]i
> f year>=79, cluster(state);
(sum of wgt is   8.5000e+02)

Linear regression                                      Number of obs =     850
                                                       F( 19,    49) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.9960
                                                       Root MSE      =   .0924

                                 (Std. Err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnbiz |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       lnemp |   1.351107   .1189541    11.36   0.000      1.11206    1.590155
    hm_union |  -.0053774   .0053697    -1.00   0.322    -.0161683    .0054134
        mico |     .01217   .0138285     0.88   0.383    -.0156194    .0399595
        mppa |  -.0060345   .0234019    -0.26   0.798    -.0530624    .0409934
        mgfa |  -.0098595   .0281745    -0.35   0.728    -.0664784    .0467593
   _Iyear_80 |   .0463852   .0090787     5.11   0.000     .0281409    .0646295
   _Iyear_81 |    .054203   .0465485     1.16   0.250    -.0393398    .1477457
   _Iyear_82 |    .185991   .0199172     9.34   0.000     .1459659    .2260161
   _Iyear_83 |   .2086614   .0221336     9.43   0.000     .1641822    .2531406
   _Iyear_84 |   .2989696   .0284805    10.50   0.000      .241736    .3562032
   _Iyear_85 |   .3985766   .0297351    13.40   0.000     .3388217    .4583314
   _Iyear_86 |   .4849258   .0299937    16.17   0.000     .4246512    .5452004
   _Iyear_87 |   .6041897   .0396085    15.25   0.000     .5245935    .6837859
   _Iyear_88 |   .6243856   .0307014    20.34   0.000     .5626887    .6860824
   _Iyear_89 |   .6987362   .0328778    21.25   0.000     .6326659    .7648065
   _Iyear_90 |   .7849931   .0353722    22.19   0.000       .71391    .8560763
   _Iyear_91 |   .8649774    .034376    25.16   0.000     .7958962    .9340586
   _Iyear_92 |   .9109745   .0388015    23.48   0.000         .833     .988949
   _Iyear_93 |   .9912124   .0379994    26.08   0.000     .9148498    1.067575
   _Iyear_94 |   1.049147   .0409702    25.61   0.000     .9668141     1.13148
   _Iyear_95 |   1.127788   .0418798    26.93   0.000     1.043627    1.211948
  _Istate_12 |   .3387591   .0464977     7.29   0.000     .2453184    .4321998
  _Istate_13 |   .4479754   .0954335     4.69   0.000     .2561947    .6397561
  _Istate_14 |   .6471885   .2428929     2.66   0.010     .1590771      1.1353
  _Istate_15 |   .9507634   .0192256    49.45   0.000     .9121281    .9893988
  _Istate_16 |   .8409931    .166297     5.06   0.000     .5068068    1.175179
  _Istate_21 |   .6955597   .3692839     1.88   0.066    -.0465442    1.437664
  _Istate_22 |   .7201422   .2587067     2.78   0.008     .2002516    1.240033
  _Istate_23 |   .2244291    .315741     0.71   0.481    -.4100761    .8589343
  _Istate_31 |   .1124246   .2951826     0.38   0.705     -.480767    .7056163
  _Istate_32 |   .0633751    .210451     0.30   0.765     -.359542    .4862921
  _Istate_33 |   .3814076   .3024459     1.26   0.213    -.2263802    .9891953
  _Istate_34 |   .2527179   .2819573     0.90   0.374    -.3138965    .8193324
  _Istate_35 |   .3129994   .1936048     1.62   0.112    -.0760639    .7020628
  _Istate_41 |    .585776   .1754548     3.34   0.002     .2331863    .9383657
  _Istate_42 |   .1940322   .1210477     1.60   0.115    -.0492223    .4372866
  _Istate_43 |   .5914757   .1883916     3.14   0.003     .2128886    .9700627
  _Istate_44 |   .3675837   .0785353     4.68   0.000     .2097611    .5254063
  _Istate_45 |   .1364176   .0915564     1.49   0.143    -.0475719     .320407
  _Istate_46 |   .6348945   .0461925    13.74   0.000     .5420671    .7277218
  _Istate_47 |   .2318139   .0957624     2.42   0.019     .0393721    .4242557
  _Istate_51 |   1.396458   .0546701    25.54   0.000     1.286595    1.506322
  _Istate_52 |   1.008212   .1752121     5.75   0.000     .6561101    1.360314
  _Istate_54 |   .4568162   .1880368     2.43   0.019      .078942    .8346903
  _Istate_55 |   .0287745   .0948097     0.30   0.763    -.1617527    .2193016
  _Istate_56 |  -.0601665   .1988325    -0.30   0.763    -.4597353    .3394023
  _Istate_57 |    .097244   .1287504     0.76   0.454    -.1614896    .3559777
  _Istate_58 |   .4333394   .1889418     2.29   0.026     .0536466    .8130323
  _Istate_59 |   .3965198   .2465987     1.61   0.114    -.0990387    .8920784
  _Istate_61 |   .1435754   .1258494     1.14   0.259    -.1093284    .3964791
  _Istate_62 |   .2833129   .1643083     1.72   0.091     -.046877    .6135029
  _Istate_63 |   .2418784   .1375976     1.76   0.085    -.0346344    .5183911
  _Istate_64 |   .0509807   .0798203     0.64   0.526    -.1094242    .2113855
  _Istate_71 |     .00579   .0753572     0.08   0.939    -.1456459    .1572259
  _Istate_72 |   .6953488   .1557705     4.46   0.000     .3823163    1.008381
  _Istate_73 |   .3602842   .1162058     3.10   0.003     .1267599    .5938084
  _Istate_74 |   .2133251    .307151     0.69   0.491    -.4039179    .8305681
  _Istate_81 |   .3551645   .0508375     6.99   0.000     .2530026    .4573263
  _Istate_82 |   .0673816   .0473424     1.42   0.161    -.0277565    .1625197
  _Istate_83 |   .5405086   .0858916     6.29   0.000      .367903    .7131141
  _Istate_84 |   .7804274    .126737     6.16   0.000     .5257399    1.035115
  _Istate_85 |   1.189357    .028438    41.82   0.000     1.132209    1.246506
  _Istate_86 |   .8058211   .1014231     7.95   0.000     .6020037    1.009639
  _Istate_87 |   .5193608   .0345251    15.04   0.000       .44998    .5887416
  _Istate_88 |   .9811333   .0271132    36.19   0.000     .9266472    1.035619
  _Istate_91 |   .6157721    .181408     3.39   0.001      .251219    .9803251
  _Istate_92 |   .5282742   .1090305     4.85   0.000     .3091692    .7473792
  _Istate_93 |   .3631226   .3869484     0.94   0.353    -.4144794    1.140725
  _Istate_94 |   1.326307    .096491    13.75   0.000     1.132401    1.520213
  _Istate_95 |   1.209443   .0568141    21.29   0.000      1.09527    1.323615
  _IstaXt_12 |   .0076453    .001184     6.46   0.000      .005266    .0100247
  _IstaXt_13 |  -.0208027   .0024027    -8.66   0.000    -.0256312   -.0159743
  _IstaXt_14 |  -.0295366   .0025835   -11.43   0.000    -.0347283   -.0243448
  _IstaXt_15 |  -.0151681   .0016069    -9.44   0.000    -.0183974   -.0119388
  _IstaXt_16 |  -.0370836   .0020339   -18.23   0.000    -.0411708   -.0329963
  _IstaXt_21 |  -.0586116   .0017543   -33.41   0.000    -.0621369   -.0550862
  _IstaXt_22 |  -.0376278   .0016522   -22.77   0.000    -.0409481   -.0343076
  _IstaXt_23 |   -.034654   .0039816    -8.70   0.000    -.0426555   -.0266526
  _IstaXt_31 |  -.0205937   .0024027    -8.57   0.000     -.025422   -.0157654
  _IstaXt_32 |  -.0196046   .0021844    -8.97   0.000    -.0239943    -.015215
  _IstaXt_33 |  -.0288409   .0016331   -17.66   0.000    -.0321228    -.025559
  _IstaXt_34 |  -.0223682   .0024542    -9.11   0.000    -.0273001   -.0174363
  _IstaXt_35 |  -.0365014   .0014497   -25.18   0.000    -.0394147    -.033588
  _IstaXt_41 |  -.0323403   .0023347   -13.85   0.000    -.0370321   -.0276485
  _IstaXt_42 |  -.0173052    .003528    -4.91   0.000     -.024395   -.0102153
  _IstaXt_43 |  -.0451617   .0027064   -16.69   0.000    -.0506004   -.0397231
  _IstaXt_44 |   -.031911   .0025737   -12.40   0.000    -.0370832   -.0267389
  _IstaXt_45 |  -.0166435   .0023803    -6.99   0.000    -.0214269     -.01186
  _IstaXt_46 |    .002917    .002523     1.16   0.253    -.0021532    .0079871
  _IstaXt_47 |  -.0166565   .0015939   -10.45   0.000    -.0198596   -.0134534
  _IstaXt_51 |  -.0344247   .0021564   -15.96   0.000    -.0387581   -.0300912
  _IstaXt_52 |  -.0431329     .00187   -23.07   0.000    -.0468908   -.0393751
  _IstaXt_54 |  -.0217686   .0022539    -9.66   0.000     -.026298   -.0172391
  _IstaXt_55 |   -.022212   .0048851    -4.55   0.000     -.032029   -.0123949
  _IstaXt_56 |  -.0145032   .0021411    -6.77   0.000    -.0188059   -.0102005
  _IstaXt_57 |  -.0004675   .0026148    -0.18   0.859    -.0057221    .0047871
  _IstaXt_58 |  -.0290814   .0012676   -22.94   0.000    -.0316286   -.0265341
  _IstaXt_59 |  -.0265921   .0020317   -13.09   0.000     -.030675   -.0225092
  _IstaXt_61 |  -.0179996   .0024088    -7.47   0.000    -.0228403   -.0131588
  _IstaXt_62 |  -.0208161   .0023363    -8.91   0.000     -.025511   -.0161212
  _IstaXt_63 |  -.0227126   .0023804    -9.54   0.000    -.0274963    -.017929
  _IstaXt_64 |  -.0278917   .0022382   -12.46   0.000    -.0323894   -.0233939
  _IstaXt_71 |   .0056898   .0016527     3.44   0.001     .0023685    .0090111
  _IstaXt_72 |  -.0443718   .0021153   -20.98   0.000    -.0486228   -.0401209
  _IstaXt_73 |  -.0233815   .0024554    -9.52   0.000    -.0283158   -.0184471
  _IstaXt_74 |  -.0272912   .0021903   -12.46   0.000    -.0316929   -.0228896
  _IstaXt_81 |   -.028336   .0018751   -15.11   0.000     -.032104   -.0245679
  _IstaXt_82 |  -.0043056   .0025214    -1.71   0.094    -.0093726    .0007614
  _IstaXt_83 |  -.0434081   .0034729   -12.50   0.000    -.0503872    -.036429
  _IstaXt_84 |  -.0314427   .0021738   -14.46   0.000     -.035811   -.0270743
  _IstaXt_85 |  -.0737124   .0018464   -39.92   0.000    -.0774229   -.0700019
  _IstaXt_86 |  -.0332043   .0036034    -9.21   0.000    -.0404456   -.0259629
  _IstaXt_87 |   .0056767   .0028986     1.96   0.056    -.0001484    .0115017
  _IstaXt_88 |  -.0426971   .0040711   -10.49   0.000    -.0508783   -.0345158
  _IstaXt_91 |  -.0516798   .0028144   -18.36   0.000    -.0573357    -.046024
  _IstaXt_92 |  -.0237372   .0005943   -39.94   0.000    -.0249314   -.0225429
  _IstaXt_93 |  -.0401198   .0006921   -57.97   0.000    -.0415106   -.0387291
  _IstaXt_94 |  -.0761859   .0027058   -28.16   0.000    -.0816234   -.0707484
  _IstaXt_95 |  -.0533391   .0018622   -28.64   0.000    -.0570813   -.0495968
       _cons |  -9.111016   1.581803    -5.76   0.000    -12.28977   -5.932264
------------------------------------------------------------------------------

. reg lnsvc lnemp hm_union mico mppa mgfa _Iyear* _Istat* _IstaXt_* [aw=empwt]i
> f year>=79, cluster(state);
(sum of wgt is   8.5000e+02)

Linear regression                                      Number of obs =     850
                                                       F( 19,    49) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.9934
                                                       Root MSE      =  .11401

                                 (Std. Err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnsvc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       lnemp |   1.185016   .1818014     6.52   0.000     .8196727     1.55036
    hm_union |  -.0102519   .0086508    -1.19   0.242    -.0276363    .0071325
        mico |  -.0145062   .0169561    -0.86   0.396    -.0485809    .0195684
        mppa |   .0001702   .0155897     0.01   0.991    -.0311584    .0314988
        mgfa |   .0070736   .0398284     0.18   0.860    -.0729645    .0871117
   _Iyear_80 |   .0535658   .0086813     6.17   0.000       .03612    .0710116
   _Iyear_81 |   .0331416   .0629228     0.53   0.601    -.0933066    .1595897
   _Iyear_82 |   .1745447   .0204706     8.53   0.000     .1334075     .215682
   _Iyear_83 |   .2019616   .0239618     8.43   0.000     .1538085    .2501147
   _Iyear_84 |   .2524752   .0309757     8.15   0.000     .1902272    .3147232
   _Iyear_85 |   .3208341   .0298737    10.74   0.000     .2608005    .3808676
   _Iyear_86 |   .3813172   .0290537    13.12   0.000     .3229317    .4397027
   _Iyear_87 |   .4673138   .0298317    15.66   0.000     .4073647    .5272629
   _Iyear_88 |    .453926    .028792    15.77   0.000     .3960663    .5117857
   _Iyear_89 |   .5029591   .0313597    16.04   0.000     .4399394    .5659789
   _Iyear_90 |   .5730732    .033555    17.08   0.000     .5056419    .6405046
   _Iyear_91 |   .6378773   .0328454    19.42   0.000      .571872    .7038827
   _Iyear_92 |   .6377239   .0356243    17.90   0.000     .5661343    .7093135
   _Iyear_93 |   .6702277   .0354529    18.90   0.000     .5989824     .741473
   _Iyear_94 |   .6789049    .037117    18.29   0.000     .6043155    .7534943
   _Iyear_95 |   .7273483   .0365465    19.90   0.000     .6539053    .8007912
  _Istate_12 |   .2122803   .0548891     3.87   0.000     .1019766    .3225841
  _Istate_13 |   .3499818   .1662756     2.10   0.040     .0158385    .6841252
  _Istate_14 |    .717631   .4024694     1.78   0.081    -.0911616    1.526424
  _Istate_15 |   .8816222   .0251056    35.12   0.000     .8311706    .9320739
  _Istate_16 |    .810686   .2777673     2.92   0.005     .2524917     1.36888
  _Istate_21 |   1.093748   .6052309     1.81   0.077    -.1225088    2.310005
  _Istate_22 |   .9200351   .4165109     2.21   0.032     .0830251    1.757045
  _Istate_23 |   .4996141    .520255     0.96   0.342    -.5458774    1.545106
  _Istate_31 |   .4404667   .4813333     0.92   0.365    -.5268088    1.407742
  _Istate_32 |   .2512956   .3442317     0.73   0.469    -.4404639    .9430552
  _Istate_33 |   .7634436    .490204     1.56   0.126    -.2216581    1.748545
  _Istate_34 |   .6227095   .4816656     1.29   0.202    -.3452337    1.590653
  _Istate_35 |   .3967181   .3139441     1.26   0.212    -.2341763    1.027612
  _Istate_41 |   .6033903   .2770161     2.18   0.034     .0467056    1.160075
  _Istate_42 |   .2835628   .1903977     1.49   0.143    -.0990557    .6661812
  _Istate_43 |   .7721678   .2958533     2.61   0.012     .1776283    1.366707
  _Istate_44 |   .2218441   .1426075     1.56   0.126    -.0647363    .5084245
  _Istate_45 |  -.0632685   .1654826    -0.38   0.704    -.3958182    .2692812
  _Istate_46 |   .5851986   .0528312    11.08   0.000     .4790304    .6913668
  _Istate_47 |   .3254629   .1109111     2.93   0.005     .1025788     .548347
  _Istate_51 |   1.080587   .0813766    13.28   0.000     .9170541    1.244119
  _Istate_52 |   1.128576   .2706073     4.17   0.000     .5847697    1.672381
  _Istate_54 |   .5693511   .2510356     2.27   0.028     .0648762    1.073826
  _Istate_55 |   .0588934   .1679128     0.35   0.727      -.27854    .3963269
  _Istate_56 |   .0938411    .244202     0.38   0.702    -.3969011    .5845834
  _Istate_57 |   .1597985   .1311654     1.22   0.229    -.1037882    .4233852
  _Istate_58 |   .5616929   .2443815     2.30   0.026     .0705899    1.052796
  _Istate_59 |   .5976338   .3304493     1.81   0.077    -.0664289    1.261696
  _Istate_61 |   .2223885   .1945707     1.14   0.259     -.168616     .613393
  _Istate_62 |   .3937372   .2430015     1.62   0.112    -.0945926    .8820669
  _Istate_63 |   .4520266   .1893244     2.39   0.021     .0715651    .8324881
  _Istate_64 |   .1597527   .0842905     1.90   0.064    -.0096354    .3291408
  _Istate_71 |   .1234713   .0703263     1.76   0.085    -.0178547    .2647973
  _Istate_72 |   .7040478   .2042123     3.45   0.001     .2936678    1.114428
  _Istate_73 |   .3285765   .1449508     2.27   0.028      .037287    .6198659
  _Istate_74 |   .4941502    .418629     1.18   0.244    -.3471162    1.335417
  _Istate_81 |   .3230831   .0563238     5.74   0.000     .2098961    .4362701
  _Istate_82 |   -.217803   .0716768    -3.04   0.004    -.3618429   -.0737632
  _Istate_83 |   .3668609   .1501847     2.44   0.018     .0650535    .6686683
  _Istate_84 |   .7623888   .1664681     4.58   0.000     .4278587    1.096919
  _Istate_85 |    .675929   .0368991    18.32   0.000     .6017774    .7500805
  _Istate_86 |   .7440785    .113194     6.57   0.000     .5166066    .9715503
  _Istate_87 |   .5278149   .0347852    15.17   0.000     .4579116    .5977183
  _Istate_88 |   .9530798   .0302535    31.50   0.000     .8922831    1.013877
  _Istate_91 |   .6942892   .3167822     2.19   0.033     .0576916    1.330887
  _Istate_92 |   .6550408   .1785115     3.67   0.001     .2963085    1.013773
  _Istate_93 |   .6365761   .6271192     1.02   0.315    -.6236672    1.896819
  _Istate_94 |   1.227658   .1024728    11.98   0.000     1.021731    1.433585
  _Istate_95 |   1.217086   .0840427    14.48   0.000     1.048196    1.385976
  _IstaXt_12 |   .0046722   .0016216     2.88   0.006     .0014134     .007931
  _IstaXt_13 |   -.010879   .0016486    -6.60   0.000     -.014192   -.0075661
  _IstaXt_14 |  -.0061496   .0038057    -1.62   0.113    -.0137974    .0014981
  _IstaXt_15 |  -.0171035   .0027268    -6.27   0.000    -.0225832   -.0116238
  _IstaXt_16 |  -.0143498   .0019527    -7.35   0.000    -.0182739   -.0104256
  _IstaXt_21 |  -.0398574   .0022973   -17.35   0.000     -.044474   -.0352408
  _IstaXt_22 |  -.0136282   .0017925    -7.60   0.000    -.0172304   -.0100261
  _IstaXt_23 |   -.017492    .007079    -2.47   0.017    -.0317177   -.0032662
  _IstaXt_31 |  -.0156611   .0040714    -3.85   0.000    -.0238428   -.0074794
  _IstaXt_32 |  -.0145451   .0031444    -4.63   0.000    -.0208639   -.0082262
  _IstaXt_33 |  -.0238032   .0029775    -7.99   0.000    -.0297867   -.0178197
  _IstaXt_34 |  -.0241652    .004173    -5.79   0.000    -.0325513   -.0157792
  _IstaXt_35 |  -.0246033    .001553   -15.84   0.000     -.027724   -.0214825
  _IstaXt_41 |  -.0094058    .002285    -4.12   0.000    -.0139977   -.0048139
  _IstaXt_42 |  -.0011128   .0042158    -0.26   0.793    -.0095849    .0073592
  _IstaXt_43 |  -.0337612   .0030454   -11.09   0.000    -.0398811   -.0276412
  _IstaXt_44 |  -.0073771   .0019853    -3.72   0.001    -.0113668   -.0033874
  _IstaXt_45 |   .0055877   .0018299     3.05   0.004     .0019104    .0092649
  _IstaXt_46 |   .0242759   .0018176    13.36   0.000     .0206232    .0279286
  _IstaXt_47 |  -.0105647   .0017706    -5.97   0.000     -.014123   -.0070065
  _IstaXt_51 |  -.0126093   .0028602    -4.41   0.000     -.018357   -.0068616
  _IstaXt_52 |  -.0193661   .0020103    -9.63   0.000     -.023406   -.0153262
  _IstaXt_54 |   .0031376   .0020317     1.54   0.129    -.0009452    .0072204
  _IstaXt_55 |   -.008837   .0083564    -1.06   0.295    -.0256297    .0079557
  _IstaXt_56 |  -.0125146    .002309    -5.42   0.000    -.0171548   -.0078745
  _IstaXt_57 |   .0016279   .0033636     0.48   0.631    -.0051316    .0083874
  _IstaXt_58 |  -.0187435   .0018836    -9.95   0.000    -.0225287   -.0149582
  _IstaXt_59 |  -.0281952   .0032492    -8.68   0.000    -.0347247   -.0216656
  _IstaXt_61 |  -.0104508   .0022172    -4.71   0.000    -.0149064   -.0059951
  _IstaXt_62 |  -.0164596    .001692    -9.73   0.000    -.0198598   -.0130594
  _IstaXt_63 |  -.0225171   .0032441    -6.94   0.000    -.0290364   -.0159978
  _IstaXt_64 |   -.033787   .0015699   -21.52   0.000    -.0369418   -.0306322
  _IstaXt_71 |  -.0124431   .0028349    -4.39   0.000    -.0181401   -.0067462
  _IstaXt_72 |  -.0340481    .003749    -9.08   0.000     -.041582   -.0265142
  _IstaXt_73 |   -.014171   .0022036    -6.43   0.000    -.0185992   -.0097428
  _IstaXt_74 |  -.0197842   .0021044    -9.40   0.000    -.0240132   -.0155552
  _IstaXt_81 |  -.0184219   .0013396   -13.75   0.000    -.0211138   -.0157299
  _IstaXt_82 |   .0179151   .0033278     5.38   0.000     .0112276    .0246025
  _IstaXt_83 |  -.0282548   .0031075    -9.09   0.000    -.0344995   -.0220101
  _IstaXt_84 |  -.0093028   .0016013    -5.81   0.000    -.0125208   -.0060848
  _IstaXt_85 |  -.0334105   .0011715   -28.52   0.000    -.0357646   -.0310563
  _IstaXt_86 |  -.0201694   .0061147    -3.30   0.002    -.0324574   -.0078813
  _IstaXt_87 |   .0108634   .0020812     5.22   0.000     .0066811    .0150457
  _IstaXt_88 |  -.0276498    .006746    -4.10   0.000    -.0412065   -.0140932
  _IstaXt_91 |  -.0295799   .0023156   -12.77   0.000    -.0342332   -.0249266
  _IstaXt_92 |  -.0203962   .0010793   -18.90   0.000     -.022565   -.0182273
  _IstaXt_93 |  -.0184402   .0009314   -19.80   0.000    -.0203119   -.0165685
  _IstaXt_94 |   -.059177   .0023677   -24.99   0.000    -.0639351   -.0544189
  _IstaXt_95 |  -.0399067   .0023551   -16.95   0.000    -.0446394    -.035174
       _cons |  -6.996253   2.504482    -2.79   0.007     -12.0292   -1.963307
------------------------------------------------------------------------------

. reg lnadv lnemp hm_union mico mppa mgfa _Iyear* _Istat* _IstaXt_* [aw=empwt]i
> f year>=79, cluster(state);
(sum of wgt is   8.5000e+02)

Linear regression                                      Number of obs =     850
                                                       F( 19,    49) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.9909
                                                       Root MSE      =  .14485

                                 (Std. Err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnadv |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       lnemp |   .9764029   .3643861     2.68   0.010     .2441417    1.708664
    hm_union |   .0090044   .0051352     1.75   0.086    -.0013152     .019324
        mico |   .0591757    .041776     1.42   0.163    -.0247764    .1431278
        mppa |   .0365839   .0363352     1.01   0.319    -.0364344    .1096021
        mgfa |   .0163043   .1001369     0.16   0.871    -.1849283     .217537
   _Iyear_80 |   .0245018   .0288354     0.85   0.400    -.0334452    .0824487
   _Iyear_81 |   .0514653   .0255826     2.01   0.050     .0000551    .1028755
   _Iyear_82 |   .1533268   .0328589     4.67   0.000     .0872944    .2193592
   _Iyear_83 |   .1788663   .0320138     5.59   0.000     .1145322    .2432005
   _Iyear_84 |   .2457607   .0422504     5.82   0.000     .1608554     .330666
   _Iyear_85 |    .289713   .0420319     6.89   0.000     .2052468    .3741792
   _Iyear_86 |   .3176349   .0515615     6.16   0.000     .2140181    .4212517
   _Iyear_87 |   .4228388   .0595739     7.10   0.000     .3031205    .5425571
   _Iyear_88 |    .361377   .0641322     5.63   0.000     .2324985    .4902554
   _Iyear_89 |   .3505064   .0743674     4.71   0.000     .2010595    .4999533
   _Iyear_90 |   .3537931   .0794805     4.45   0.000      .194071    .5135152
   _Iyear_91 |   .4027024   .0791496     5.09   0.000     .2436452    .5617595
   _Iyear_92 |   .3163331   .0848938     3.73   0.001     .1457326    .4869336
   _Iyear_93 |   .3595529   .0892315     4.03   0.000     .1802355    .5388702
   _Iyear_94 |   .3081077   .1027287     3.00   0.004     .1016667    .5145487
   _Iyear_95 |    .374953   .1109868     3.38   0.001     .1519167    .5979894
  _Istate_12 |   .4487819   .1065894     4.21   0.000     .2345824    .6629814
  _Istate_13 |  -.2284038   .2652838    -0.86   0.393    -.7615116     .304704
  _Istate_14 |   1.001982   .6915122     1.45   0.154    -.3876633    2.391628
  _Istate_15 |   1.154849   .0470097    24.57   0.000      1.06038    1.249319
  _Istate_16 |   1.017929   .4640872     2.19   0.033     .0853112    1.950548
  _Istate_21 |   2.605941   1.036738     2.51   0.015     .5225384    4.689343
  _Istate_22 |   .8210113   .7255664     1.13   0.263    -.6370689    2.279092
  _Istate_23 |   1.033138   .8628148     1.20   0.237    -.7007532    2.767029
  _Istate_31 |   .9885613    .831477     1.19   0.240    -.6823544    2.659477
  _Istate_32 |   .7768851   .5643003     1.38   0.175    -.3571188    1.910889
  _Istate_33 |   1.883846   .8650672     2.18   0.034     .1454284    3.622264
  _Istate_34 |   1.208171   .7338613     1.65   0.106    -.2665784     2.68292
  _Istate_35 |   .9257515    .529827     1.75   0.087    -.1389758    1.990479
  _Istate_41 |   1.318126   .5066132     2.60   0.012     .3000489    2.336204
  _Istate_42 |   .7015991    .336168     2.09   0.042     .0260442    1.377154
  _Istate_43 |   1.415284   .5553563     2.55   0.014     .2992536    2.531314
  _Istate_44 |    .001676   .1934158     0.01   0.993    -.3870075    .3903596
  _Istate_45 |   .4464539   .2218074     2.01   0.050     .0007153    .8921925
  _Istate_46 |   .9007167   .1444192     6.24   0.000     .6104955    1.190938
  _Istate_47 |   .8632184   .2960557     2.92   0.005     .2682721    1.458165
  _Istate_51 |  -.0406913   .2021674    -0.20   0.841    -.4469619    .3655794
  _Istate_52 |   1.125649   .5068826     2.22   0.031     .1070303    2.144268
  _Istate_54 |   .6846158   .6026156     1.14   0.261    -.5263857    1.895617
  _Istate_55 |   .0828777   .1484182     0.56   0.579    -.2153798    .3811352
  _Istate_56 |   .3400475   .6444765     0.53   0.600    -.9550765    1.635172
  _Istate_57 |   .3645719   .3988511     0.91   0.365    -.4369494    1.166093
  _Istate_58 |   1.181019   .6065324     1.95   0.057    -.0378533    2.399892
  _Istate_59 |   1.163117   .7893448     1.47   0.147    -.4231305    2.749365
  _Istate_61 |   .3925532   .3653206     1.07   0.288     -.341586    1.126692
  _Istate_62 |   1.218986   .5066684     2.41   0.020     .2007974    2.237174
  _Istate_63 |    .815774   .4198122     1.94   0.058    -.0278702    1.659418
  _Istate_64 |    .266755    .250386     1.07   0.292    -.2364144    .7699244
  _Istate_71 |   .6275632   .2074688     3.02   0.004      .210639    1.044487
  _Istate_72 |   .6656628    .496052     1.34   0.186    -.3311909    1.662517
  _Istate_73 |   .7961582   .3919926     2.03   0.048     .0084195    1.583897
  _Istate_74 |   1.243841   .9801409     1.27   0.210    -.7258263    3.213508
  _Istate_81 |   .3262244   .1741515     1.87   0.067    -.0237462    .6761949
  _Istate_82 |    .347253   .1347543     2.58   0.013      .076454     .618052
  _Istate_83 |   -.299292   .2513137    -1.19   0.239    -.8043259    .2057418
  _Istate_84 |   .7938215    .404249     1.96   0.055    -.0185472     1.60619
  _Istate_85 |   1.098169   .0436398    25.16   0.000     1.010472    1.185866
  _Istate_86 |   .7062542   .3244706     2.18   0.034     .0542061    1.358302
  _Istate_87 |   .9765589   .1004561     9.72   0.000     .7746849    1.178433
  _Istate_88 |   .7122487   .0953296     7.47   0.000     .5206767    .9038207
  _Istate_91 |   .5125417   .4510249     1.14   0.261    -.3938267     1.41891
  _Istate_92 |   .5673612   .2941908     1.93   0.060    -.0238374     1.15856
  _Istate_93 |   1.171768   1.145182     1.02   0.311    -1.129561    3.473096
  _Istate_94 |  -.3263559   .3197234    -1.02   0.312    -.9688641    .3161522
  _Istate_95 |   .9309946   .0916771    10.16   0.000     .7467627    1.115227
  _IstaXt_12 |  -.0200891   .0038052    -5.28   0.000     -.027736   -.0124422
  _IstaXt_13 |   .0529146   .0050754    10.43   0.000     .0427153     .063114
  _IstaXt_14 |   .0018929   .0059156     0.32   0.750    -.0099948    .0137807
  _IstaXt_15 |  -.0139176    .004304    -3.23   0.002    -.0225669   -.0052684
  _IstaXt_16 |    .016566   .0064716     2.56   0.014     .0035609     .029571
  _IstaXt_21 |  -.0291257   .0050337    -5.79   0.000    -.0392414   -.0190101
  _IstaXt_22 |   .0214223   .0046797     4.58   0.000     .0120181    .0308265
  _IstaXt_23 |    -.00236   .0043587    -0.54   0.591    -.0111191    .0063991
  _IstaXt_31 |  -.0001741   .0034273    -0.05   0.960    -.0070615    .0067133
  _IstaXt_32 |  -.0246353   .0043252    -5.70   0.000     -.033327   -.0159435
  _IstaXt_33 |  -.0114636   .0028392    -4.04   0.000    -.0171691    -.005758
  _IstaXt_34 |   .0056977   .0024674     2.31   0.025     .0007392    .0106561
  _IstaXt_35 |  -.0068884   .0038214    -1.80   0.078    -.0145678    .0007909
  _IstaXt_41 |  -.0010907   .0044898    -0.24   0.809    -.0101133    .0079319
  _IstaXt_42 |   .0232012   .0058995     3.93   0.000     .0113456    .0350567
  _IstaXt_43 |  -.0141022   .0032081    -4.40   0.000    -.0205491   -.0076554
  _IstaXt_44 |   .0136464   .0058142     2.35   0.023     .0019623    .0253304
  _IstaXt_45 |   .0154366   .0048186     3.20   0.002     .0057532      .02512
  _IstaXt_46 |  -.0035511   .0046886    -0.76   0.452    -.0129731     .005871
  _IstaXt_47 |   .0072404   .0038865     1.86   0.068    -.0005697    .0150505
  _IstaXt_51 |   .0674882    .007968     8.47   0.000     .0514759    .0835005
  _IstaXt_52 |  -.0211664   .0041439    -5.11   0.000    -.0294938    -.012839
  _IstaXt_54 |  -.0030998   .0047706    -0.65   0.519    -.0126866     .006487
  _IstaXt_55 |  -.0097043   .0068964    -1.41   0.166     -.023563    .0041545
  _IstaXt_56 |   .0405065   .0034655    11.69   0.000     .0335423    .0474707
  _IstaXt_57 |   .0083484   .0052875     1.58   0.121    -.0022772     .018974
  _IstaXt_58 |   .0081417   .0039591     2.06   0.045     .0001855    .0160979
  _IstaXt_59 |   .0032044    .005964     0.54   0.593    -.0087807    .0151895
  _IstaXt_61 |    .020029   .0043688     4.58   0.000     .0112495    .0288084
  _IstaXt_62 |   .0009963   .0040474     0.25   0.807    -.0071373    .0091298
  _IstaXt_63 |  -.0131017   .0110794    -1.18   0.243    -.0353665    .0091631
  _IstaXt_64 |   .0127481   .0033082     3.85   0.000     .0061001    .0193961
  _IstaXt_71 |  -.0173638   .0037551    -4.62   0.000    -.0249099   -.0098176
  _IstaXt_72 |   .0036402   .0049649     0.73   0.467    -.0063371    .0136175
  _IstaXt_73 |  -.0040847   .0064254    -0.64   0.528     -.016997    .0088275
  _IstaXt_74 |  -.0077678   .0047741    -1.63   0.110    -.0173616    .0018261
  _IstaXt_81 |   .0120331   .0079257     1.52   0.135    -.0038942    .0279605
  _IstaXt_82 |  -.0056105   .0099501    -0.56   0.575     -.025606    .0143849
  _IstaXt_83 |   .0071054   .0100606     0.71   0.483    -.0131121    .0273229
  _IstaXt_84 |   .0043055   .0044038     0.98   0.333    -.0045443    .0131553
  _IstaXt_85 |  -.0413688   .0031659   -13.07   0.000    -.0477309   -.0350067
  _IstaXt_86 |    .011704   .0121963     0.96   0.342    -.0128053    .0362133
  _IstaXt_87 |   -.006793   .0069891    -0.97   0.336    -.0208381    .0072521
  _IstaXt_88 |   .0119629   .0151778     0.79   0.434     -.018538    .0424638
  _IstaXt_91 |   .0187255   .0049063     3.82   0.000      .008866    .0285851
  _IstaXt_92 |   .0182281   .0011574    15.75   0.000     .0159023    .0205539
  _IstaXt_93 |   .0076664   .0022244     3.45   0.001     .0031963    .0121365
  _IstaXt_94 |   .0396634   .0094267     4.21   0.000     .0207197    .0586071
  _IstaXt_95 |  -.0326479   .0046266    -7.06   0.000    -.0419454   -.0233504
       _cons |  -7.737184   4.698607    -1.65   0.106    -17.17939    1.705021
------------------------------------------------------------------------------

. reg lncrd lnemp hm_union mico mppa mgfa _Iyear* _Istat* _IstaXt_* [aw=empwt]i
> f year>=79, cluster(state);
(sum of wgt is   8.5000e+02)

Linear regression                                      Number of obs =     850
                                                       F( 19,    49) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.9863
                                                       Root MSE      =  .14287

                                 (Std. Err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lncrd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       lnemp |   .6049131   .2947677     2.05   0.046     .0125553    1.197271
    hm_union |  -.0005024   .0042735    -0.12   0.907    -.0090902    .0080855
        mico |  -.0253181   .0332425    -0.76   0.450    -.0921214    .0414852
        mppa |  -.0120517   .0307418    -0.39   0.697    -.0738296    .0497263
        mgfa |   .0006856   .0679381     0.01   0.992    -.1358412    .1372124
   _Iyear_80 |  -.1193185   .0280266    -4.26   0.000      -.17564   -.0629971
   _Iyear_81 |   -.145208   .0282824    -5.13   0.000    -.2020435   -.0883725
   _Iyear_82 |  -.1262004    .031928    -3.95   0.000     -.190362   -.0620388
   _Iyear_83 |  -.2012873   .0336693    -5.98   0.000    -.2689483   -.1336263
   _Iyear_84 |  -.2163719   .0363763    -5.95   0.000    -.2894728    -.143271
   _Iyear_85 |  -.2092871   .0317839    -6.58   0.000    -.2731592   -.1454149
   _Iyear_86 |  -.1689947   .0421848    -4.01   0.000    -.2537681   -.0842213
   _Iyear_87 |  -.0708981   .0564042    -1.26   0.215    -.1842466    .0424503
   _Iyear_88 |  -.1809282   .0559592    -3.23   0.002    -.2933823    -.068474
   _Iyear_89 |  -.1903684   .0634942    -3.00   0.004    -.3179648    -.062772
   _Iyear_90 |  -.1860328   .0695402    -2.68   0.010    -.3257791   -.0462865
   _Iyear_91 |  -.1843794    .065856    -2.80   0.007     -.316722   -.0520369
   _Iyear_92 |  -.1703922   .0709707    -2.40   0.020    -.3130131   -.0277713
   _Iyear_93 |  -.1749022   .0764242    -2.29   0.026    -.3284823   -.0213221
   _Iyear_94 |  -.2343512   .0949974    -2.47   0.017    -.4252557   -.0434467
   _Iyear_95 |  -.2821852   .1005432    -2.81   0.007    -.4842343    -.080136
  _Istate_12 |  -.5643747   .0828063    -6.82   0.000    -.7307801   -.3979692
  _Istate_13 |  -.4911425   .2354695    -2.09   0.042    -.9643362   -.0179487
  _Istate_14 |   .7157786   .5262263     1.36   0.180    -.3417127     1.77327
  _Istate_15 |  -.2285495   .0428798    -5.33   0.000    -.3147196   -.1423794
  _Istate_16 |   .4591403   .3512271     1.31   0.197     -.246677    1.164958
  _Istate_21 |   1.642234   .8240446     1.99   0.052    -.0137456    3.298214
  _Istate_22 |   1.266677   .5727495     2.21   0.032     .1156934     2.41766
  _Istate_23 |   .9116788   .6873506     1.33   0.191    -.4696039    2.292961
  _Istate_31 |   1.371316   .6605028     2.08   0.043     .0439864    2.698647
  _Istate_32 |   .9479241   .4411988     2.15   0.037     .0613018    1.834546
  _Istate_33 |   1.381838    .709386     1.95   0.057    -.0437266    2.807403
  _Istate_34 |   .8943142   .5975984     1.50   0.141    -.3066048    2.095233
  _Istate_35 |   .7342365   .4145459     1.77   0.083    -.0988246    1.567298
  _Istate_41 |   1.111797   .3911095     2.84   0.007     .3258331    1.897761
  _Istate_42 |   .5221023   .2449842     2.13   0.038     .0297882    1.014416
  _Istate_43 |   1.054338   .4390329     2.40   0.020     .1720686    1.936608
  _Istate_44 |   .4577541   .1750939     2.61   0.012     .1058898    .8096185
  _Istate_45 |  -.1516476   .1962678    -0.77   0.443    -.5460625    .2427672
  _Istate_46 |   .3819295   .0977724     3.91   0.000     .1854485    .5784105
  _Istate_47 |    .648803    .227011     2.86   0.006     .1926072    1.104999
  _Istate_51 |  -.1435791   .1742161    -0.82   0.414    -.4936794    .2065212
  _Istate_52 |   1.036191   .3940901     2.63   0.011      .244237    1.828145
  _Istate_54 |   .6680301   .4716998     1.42   0.163    -.2798861    1.615946
  _Istate_55 |   .5488556   .1102188     4.98   0.000     .3273625    .7703486
  _Istate_56 |   .3379995   .5025474     0.67   0.504    -.6719072    1.347906
  _Istate_57 |   .5759425   .2984242     1.93   0.059    -.0237633    1.175648
  _Istate_58 |    .909665   .4720871     1.93   0.060    -.0390295     1.85836
  _Istate_59 |    1.08339   .6201768     1.75   0.087    -.1629016    2.329682
  _Istate_61 |   .6964716   .2811246     2.48   0.017     .1315307    1.261413
  _Istate_62 |   .9131934   .4016675     2.27   0.027     .1060124    1.720374
  _Istate_63 |   .5334565   .3179907     1.68   0.100    -.1055698    1.172483
  _Istate_64 |   .1367875    .180513     0.76   0.452    -.2259669    .4995419
  _Istate_71 |   .3387659   .1577553     2.15   0.037     .0217448    .6557869
  _Istate_72 |   .6862678   .3822118     1.80   0.079    -.0818156    1.454351
  _Istate_73 |   1.013656   .3097844     3.27   0.002     .3911206    1.636191
  _Istate_74 |   1.429927   .7735957     1.85   0.071    -.1246722    2.984525
  _Istate_81 |   .6100358   .1645845     3.71   0.001     .2792909    .9407807
  _Istate_82 |   .3913706   .0904189     4.33   0.000     .2096671    .5730741
  _Istate_83 |   .2323989   .2226701     1.04   0.302    -.2150734    .6798713
  _Istate_84 |   1.134924   .3107231     3.65   0.001     .5105026    1.759346
  _Istate_85 |   .5247244   .0333606    15.73   0.000     .4576839     .591765
  _Istate_86 |   .6821511   .2481226     2.75   0.008     .1835301    1.180772
  _Istate_87 |   .5405116   .0549413     9.84   0.000      .430103    .6509203
  _Istate_88 |    .562822   .0813509     6.92   0.000     .3993412    .7263028
  _Istate_91 |   1.322124   .3633232     3.64   0.001     .5919988     2.05225
  _Istate_92 |   .8591129   .2482959     3.46   0.001     .3601437    1.358082
  _Istate_93 |   1.859331    .924655     2.01   0.050     .0011673    3.717495
  _Istate_94 |   .5085297   .2817979     1.80   0.077    -.0577643    1.074824
  _Istate_95 |   .5466109    .087488     6.25   0.000     .3707971    .7224248
  _IstaXt_12 |    .079207   .0034611    22.89   0.000     .0722517    .0861623
  _IstaXt_13 |   .0094546   .0046163     2.05   0.046     .0001778    .0187315
  _IstaXt_14 |    .043108   .0032563    13.24   0.000     .0365642    .0496518
  _IstaXt_15 |   .0091035   .0034685     2.62   0.012     .0021334    .0160737
  _IstaXt_16 |   .0151239   .0038148     3.96   0.000     .0074578    .0227899
  _IstaXt_21 |   .0218124   .0030243     7.21   0.000     .0157349    .0278899
  _IstaXt_22 |    .051037   .0024897    20.50   0.000     .0460338    .0560403
  _IstaXt_23 |   .0565882     .00348    16.26   0.000      .049595    .0635815
  _IstaXt_31 |   .0256739   .0023552    10.90   0.000      .020941    .0304069
  _IstaXt_32 |     .01823   .0038252     4.77   0.000     .0105429    .0259171
  _IstaXt_33 |     .03441   .0022684    15.17   0.000     .0298514    .0389686
  _IstaXt_34 |   .0235645   .0019321    12.20   0.000     .0196818    .0274472
  _IstaXt_35 |   .0230639    .003417     6.75   0.000     .0161972    .0299306
  _IstaXt_41 |   .0498151   .0039937    12.47   0.000     .0417895    .0578408
  _IstaXt_42 |   .0175874   .0045229     3.89   0.000     .0084983    .0266764
  _IstaXt_43 |   .0213074   .0025327     8.41   0.000     .0162177     .026397
  _IstaXt_44 |  -.0022954   .0036045    -0.64   0.527    -.0095389    .0049481
  _IstaXt_45 |     .06646   .0048777    13.63   0.000     .0566578    .0762621
  _IstaXt_46 |   .0442282   .0038999    11.34   0.000      .036391    .0520653
  _IstaXt_47 |   .0548014   .0025417    21.56   0.000     .0496936    .0599092
  _IstaXt_51 |   .0705051   .0046192    15.26   0.000     .0612226    .0797877
  _IstaXt_52 |   .0306517    .003558     8.61   0.000     .0235015    .0378018
  _IstaXt_54 |   .0221792   .0049346     4.49   0.000     .0122628    .0320957
  _IstaXt_55 |  -.0112039   .0045605    -2.46   0.018    -.0203686   -.0020392
  _IstaXt_56 |   .0522728   .0034383    15.20   0.000     .0453633    .0591823
  _IstaXt_57 |  -.0049585   .0050162    -0.99   0.328    -.0150389     .005122
  _IstaXt_58 |   .0668802   .0032051    20.87   0.000     .0604394     .073321
  _IstaXt_59 |    .046604   .0048179     9.67   0.000      .036922     .056286
  _IstaXt_61 |   .0248508   .0042804     5.81   0.000     .0162489    .0334526
  _IstaXt_62 |   .0482381   .0041688    11.57   0.000     .0398605    .0566156
  _IstaXt_63 |   .0198808   .0073071     2.72   0.009     .0051967    .0345649
  _IstaXt_64 |   .0383402   .0026559    14.44   0.000     .0330029    .0436774
  _IstaXt_71 |   .0251152    .003724     6.74   0.000     .0176316    .0325989
  _IstaXt_72 |   .0429571   .0039891    10.77   0.000     .0349406    .0509736
  _IstaXt_73 |   .0092064   .0043301     2.13   0.039     .0005047     .017908
  _IstaXt_74 |   .0488999    .003825    12.78   0.000     .0412134    .0565865
  _IstaXt_81 |   .0027171   .0051571     0.53   0.601    -.0076464    .0130805
  _IstaXt_82 |   .0361253   .0058176     6.21   0.000     .0244344    .0478163
  _IstaXt_83 |   .0261594   .0065172     4.01   0.000     .0130626    .0392561
  _IstaXt_84 |   .0348092   .0042208     8.25   0.000     .0263272    .0432913
  _IstaXt_85 |   .0001908   .0032572     0.06   0.954    -.0063548    .0067365
  _IstaXt_86 |   .0748901   .0097502     7.68   0.000     .0552963    .0944839
  _IstaXt_87 |   .0412404   .0073967     5.58   0.000     .0263761    .0561047
  _IstaXt_88 |   .0216832   .0119361     1.82   0.075    -.0023033    .0456697
  _IstaXt_91 |   .0203415   .0046648     4.36   0.000     .0109672    .0297157
  _IstaXt_92 |   .0204044   .0009265    22.02   0.000     .0185425    .0222662
  _IstaXt_93 |   .0292154   .0013493    21.65   0.000     .0265039    .0319268
  _IstaXt_94 |  -.0118031   .0072365    -1.63   0.109    -.0263454    .0027393
  _IstaXt_95 |    -.00648   .0045802    -1.41   0.163    -.0156843    .0027243
       _cons |  -2.419158   3.814536    -0.63   0.529    -10.08475     5.24644
------------------------------------------------------------------------------

. reg lnmal lnemp hm_union mico mppa mgfa _Iyear* _Istat* _IstaXt_* [aw=empwt]i
> f year>=79, cluster(state);
(sum of wgt is   8.5000e+02)

Linear regression                                      Number of obs =     850
                                                       F( 19,    49) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.9902
                                                       Root MSE      =  .15788

                                 (Std. Err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnmal |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       lnemp |   .9623587   .2671451     3.60   0.001     .4255106    1.499207
    hm_union |   .0013873   .0074842     0.19   0.854    -.0136528    .0164273
        mico |  -.0109264    .046625    -0.23   0.816    -.1046228      .08277
        mppa |    .018369   .0442907     0.41   0.680    -.0706365    .1073745
        mgfa |  -.0472576   .0806117    -0.59   0.560    -.2092529    .1147378
   _Iyear_80 |   .0854401   .0187496     4.56   0.000     .0477614    .1231188
   _Iyear_81 |    .190687   .0362708     5.26   0.000     .1177981    .2635759
   _Iyear_82 |   .3453203   .0404155     8.54   0.000     .2641023    .4265384
   _Iyear_83 |   .4509066   .0415459    10.85   0.000      .367417    .5343961
   _Iyear_84 |   .4668283   .0572569     8.15   0.000     .3517663    .5818903
   _Iyear_85 |   .5583855   .0593465     9.41   0.000     .4391242    .6776467
   _Iyear_86 |   .6620511   .0600914    11.02   0.000      .541293    .7828092
   _Iyear_87 |   .8039812   .0615782    13.06   0.000     .6802352    .9277271
   _Iyear_88 |   .7752097   .0619757    12.51   0.000     .6506648    .8997546
   _Iyear_89 |   .7904666   .0697503    11.33   0.000     .6502982     .930635
   _Iyear_90 |   .8424679   .0759123    11.10   0.000     .6899165    .9950193
   _Iyear_91 |   .9478786   .0720357    13.16   0.000     .8031175     1.09264
   _Iyear_92 |   .9994982   .0780475    12.81   0.000     .8426558    1.156341
   _Iyear_93 |   1.048539   .0749874    13.98   0.000     .8978458    1.199232
   _Iyear_94 |   1.069557   .0900652    11.88   0.000     .8885644     1.25055
   _Iyear_95 |   1.150433   .1000483    11.50   0.000     .9493781    1.351487
  _Istate_12 |   .7252485   .1301253     5.57   0.000     .4637519    .9867451
  _Istate_13 |   1.601702   .1833759     8.73   0.000     1.233194     1.97021
  _Istate_14 |   1.803604   .5045308     3.57   0.001     .7897113    2.817497
  _Istate_15 |   1.550198   .0500738    30.96   0.000     1.449571    1.650825
  _Istate_16 |     1.7865   .3431833     5.21   0.000     1.096847    2.476152
  _Istate_21 |   2.512209   .7661761     3.28   0.002     .9725203    4.051897
  _Istate_22 |   1.961513   .5530745     3.55   0.001     .8500685    3.072958
  _Istate_23 |   1.307332   .6544355     2.00   0.051    -.0078059    2.622469
  _Istate_31 |   1.245985   .6178303     2.02   0.049     .0044085    2.487561
  _Istate_32 |    .808599   .4426639     1.83   0.074    -.0809673    1.698165
  _Istate_33 |   2.336317   .6396497     3.65   0.001     1.050893    3.621741
  _Istate_34 |   1.987909   .5507275     3.61   0.001     .8811803    3.094637
  _Istate_35 |   1.386249   .4113094     3.37   0.001     .5596923    2.212807
  _Istate_41 |   1.628415   .3805802     4.28   0.000     .8636102    2.393219
  _Istate_42 |   1.493655   .2648491     5.64   0.000     .9614204    2.025889
  _Istate_43 |   1.641332   .4118407     3.99   0.000     .8137066    2.468956
  _Istate_44 |  -.4760176   .1358302    -3.50   0.001    -.7489786   -.2030566
  _Istate_45 |   -.537274   .1583829    -3.39   0.001    -.8555564   -.2189916
  _Istate_46 |   1.158779    .120643     9.61   0.000     .9163377     1.40122
  _Istate_47 |    .938639   .2442456     3.84   0.000     .4478091    1.429469
  _Istate_51 |   .7906972   .1281506     6.17   0.000     .5331688    1.048226
  _Istate_52 |    2.11852   .3923866     5.40   0.000      1.32999    2.907051
  _Istate_54 |   1.411768   .4600678     3.07   0.003     .4872266    2.336308
  _Istate_55 |  -.1375474   .1654055    -0.83   0.410    -.4699421    .1948474
  _Istate_56 |   1.379487   .5004691     2.76   0.008     .3737568    2.385217
  _Istate_57 |   .1423155   .3326726     0.43   0.671    -.5262152    .8108461
  _Istate_58 |   1.280947   .4684154     2.73   0.009     .3396308    2.222263
  _Istate_59 |   1.461053   .6021084     2.43   0.019     .2510712    2.671036
  _Istate_61 |   .6136617   .2812135     2.18   0.034     .0485419    1.178781
  _Istate_62 |   .8922332   .3791837     2.35   0.023     .1302351    1.654231
  _Istate_63 |    .125614   .3358712     0.37   0.710    -.5493445    .8005725
  _Istate_64 |   .0906858   .2084513     0.44   0.665    -.3282127    .5095844
  _Istate_71 |   .1598249   .1885536     0.85   0.401    -.2190878    .5387375
  _Istate_72 |   .5602931   .3850155     1.46   0.152    -.2134246    1.334011
  _Istate_73 |   .9404047   .2891691     3.25   0.002     .3592977    1.521512
  _Istate_74 |   1.528516   .7438527     2.05   0.045     .0336883    3.023344
  _Istate_81 |   .2958139   .1437445     2.06   0.045     .0069485    .5846793
  _Istate_82 |   .1558829   .0879822     1.77   0.083    -.0209241    .3326898
  _Istate_83 |  -.1802961   .1647085    -1.09   0.279    -.5112902    .1506981
  _Istate_84 |   1.524608   .3130347     4.87   0.000     .8955415    2.153675
  _Istate_85 |    .643914   .0507798    12.68   0.000     .5418682    .7459598
  _Istate_86 |   1.827562   .2619556     6.98   0.000     1.301143    2.353982
  _Istate_87 |   .8358657   .0946974     8.83   0.000     .6455641    1.026167
  _Istate_88 |   1.006625   .0674332    14.93   0.000     .8711133    1.142138
  _Istate_91 |   1.253957   .3332148     3.76   0.000     .5843371    1.923577
  _Istate_92 |   1.063749   .2248772     4.73   0.000     .6118412    1.515657
  _Istate_93 |   2.044279   .8194785     2.49   0.016      .397475    3.691082
  _Istate_94 |   1.034076   .2447992     4.22   0.000      .542134    1.526019
  _Istate_95 |   1.831623    .107305    17.07   0.000     1.615986    2.047261
  _IstaXt_12 |   .0005006   .0039347     0.13   0.899    -.0074064    .0084076
  _IstaXt_13 |  -.0439008   .0040933   -10.73   0.000    -.0521265   -.0356751
  _IstaXt_14 |  -.0411837   .0056685    -7.27   0.000     -.052575   -.0297924
  _IstaXt_15 |  -.0631759   .0031503   -20.05   0.000    -.0695067   -.0568451
  _IstaXt_16 |  -.0115624   .0059447    -1.95   0.058    -.0235087    .0003838
  _IstaXt_21 |   -.060283   .0046469   -12.97   0.000    -.0696213   -.0509448
  _IstaXt_22 |  -.0340647   .0046297    -7.36   0.000    -.0433685   -.0247609
  _IstaXt_23 |  -.0123103   .0049963    -2.46   0.017    -.0223506   -.0022699
  _IstaXt_31 |  -.0202039    .004139    -4.88   0.000    -.0285215   -.0118862
  _IstaXt_32 |   -.025714   .0048174    -5.34   0.000    -.0353949    -.016033
  _IstaXt_33 |  -.0554311   .0023454   -23.63   0.000    -.0601443   -.0507179
  _IstaXt_34 |  -.0633182   .0032899   -19.25   0.000    -.0699295    -.056707
  _IstaXt_35 |  -.0397351   .0035928   -11.06   0.000    -.0469552   -.0325151
  _IstaXt_41 |   -.028775   .0041041    -7.01   0.000    -.0370226   -.0205275
  _IstaXt_42 |  -.0230656    .005002    -4.61   0.000    -.0331175   -.0130137
  _IstaXt_43 |  -.0507587   .0040765   -12.45   0.000    -.0589508   -.0425665
  _IstaXt_44 |   .0230961   .0050002     4.62   0.000     .0130478    .0331443
  _IstaXt_45 |   .0127639   .0038997     3.27   0.002     .0049273    .0206006
  _IstaXt_46 |   .0167779   .0038305     4.38   0.000     .0090803    .0244755
  _IstaXt_47 |   .0047259   .0038588     1.22   0.227    -.0030286    .0124804
  _IstaXt_51 |   .0293249   .0060218     4.87   0.000     .0172237    .0414261
  _IstaXt_52 |  -.0475551   .0036641   -12.98   0.000    -.0549184   -.0401918
  _IstaXt_54 |  -.0178984    .003783    -4.73   0.000    -.0255006   -.0102962
  _IstaXt_55 |  -.0054401   .0077047    -0.71   0.483    -.0209233    .0100431
  _IstaXt_56 |  -.0486932   .0041291   -11.79   0.000    -.0569908   -.0403955
  _IstaXt_57 |  -.0210505   .0047314    -4.45   0.000    -.0305585   -.0115424
  _IstaXt_58 |  -.0172782   .0029113    -5.93   0.000    -.0231287   -.0114276
  _IstaXt_59 |  -.0265001   .0043575    -6.08   0.000    -.0352568   -.0177434
  _IstaXt_61 |  -.0017336   .0035003    -0.50   0.623    -.0087677    .0053004
  _IstaXt_62 |   -.029867   .0034328    -8.70   0.000    -.0367656   -.0229685
  _IstaXt_63 |  -.0092001   .0077829    -1.18   0.243    -.0248405    .0064403
  _IstaXt_64 |  -.0420432   .0036996   -11.36   0.000    -.0494778   -.0346086
  _IstaXt_71 |  -.0041141   .0033682    -1.22   0.228    -.0108827    .0026545
  _IstaXt_72 |  -.0180481   .0037007    -4.88   0.000     -.025485   -.0106111
  _IstaXt_73 |  -.0200323   .0055949    -3.58   0.001    -.0312756    -.008789
  _IstaXt_74 |  -.0372146   .0042892    -8.68   0.000    -.0458341   -.0285952
  _IstaXt_81 |  -.0261901   .0064059    -4.09   0.000    -.0390631    -.013317
  _IstaXt_82 |   .0058903   .0075865     0.78   0.441    -.0093553     .021136
  _IstaXt_83 |  -.0025414   .0084406    -0.30   0.765    -.0195035    .0144207
  _IstaXt_84 |   -.026312   .0036109    -7.29   0.000    -.0335684   -.0190556
  _IstaXt_85 |  -.0127423   .0029046    -4.39   0.000    -.0185793   -.0069053
  _IstaXt_86 |  -.0417221   .0071296    -5.85   0.000    -.0560496   -.0273945
  _IstaXt_87 |   .0090887   .0050643     1.79   0.079    -.0010884    .0192658
  _IstaXt_88 |  -.0018869   .0085775    -0.22   0.827     -.019124    .0153503
  _IstaXt_91 |  -.0250798   .0049727    -5.04   0.000    -.0350728   -.0150868
  _IstaXt_92 |   .0018512   .0009103     2.03   0.047     .0000218    .0036806
  _IstaXt_93 |  -.0294142   .0019238   -15.29   0.000    -.0332802   -.0255482
  _IstaXt_94 |  -.0234278   .0062024    -3.78   0.000    -.0358919   -.0109636
  _IstaXt_95 |  -.0627491   .0037849   -16.58   0.000    -.0703552   -.0551431
       _cons |  -7.724232   3.416321    -2.26   0.028    -14.58959   -.8588772
------------------------------------------------------------------------------

. reg lnbld lnemp hm_union mico mppa mgfa _Iyear* _Istat* _IstaXt_* [aw=empwt]i
> f year>=79, cluster(state);
(sum of wgt is   8.5000e+02)

Linear regression                                      Number of obs =     850
                                                       F( 19,    49) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.9951
                                                       Root MSE      =  .09314

                                 (Std. Err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnbld |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       lnemp |   1.070855   .2520794     4.25   0.000     .5642828    1.577428
    hm_union |   .0022977   .0035679     0.64   0.523    -.0048722    .0094676
        mico |  -.0303835   .0272937    -1.11   0.271    -.0852322    .0244652
        mppa |  -.0318935   .0241872    -1.32   0.193    -.0804995    .0167125
        mgfa |  -.0157158   .0352749    -0.45   0.658    -.0866033    .0551717
   _Iyear_80 |   .0664189   .0222703     2.98   0.004     .0216652    .1111727
   _Iyear_81 |   .1160379   .0219932     5.28   0.000     .0718409     .160235
   _Iyear_82 |   .2343518   .0257194     9.11   0.000     .1826668    .2860368
   _Iyear_83 |   .3125033   .0206711    15.12   0.000     .2709631    .3540434
   _Iyear_84 |   .3812622   .0311558    12.24   0.000     .3186523     .443872
   _Iyear_85 |   .4675378   .0362558    12.90   0.000     .3946792    .5403965
   _Iyear_86 |   .5393954    .039871    13.53   0.000     .4592716    .6195192
   _Iyear_87 |   .6856066    .044171    15.52   0.000     .5968418    .7743715
   _Iyear_88 |   .7437362   .0494754    15.03   0.000     .6443117    .8431607
   _Iyear_89 |   .8022488   .0566311    14.17   0.000     .6884443    .9160533
   _Iyear_90 |   .8801499   .0599841    14.67   0.000     .7596074    1.000692
   _Iyear_91 |    .929405   .0567976    16.36   0.000     .8152661    1.043544
   _Iyear_92 |   .9777844   .0558264    17.51   0.000     .8655971    1.089972
   _Iyear_93 |   1.041208   .0559337    18.62   0.000     .9288045    1.153611
   _Iyear_94 |   1.075361   .0638184    16.85   0.000     .9471131    1.203609
   _Iyear_95 |   1.120834    .072001    15.57   0.000     .9761422    1.265525
  _Istate_12 |   .5244264   .0582595     9.00   0.000     .4073495    .6415033
  _Istate_13 |   .4111627   .1937091     2.12   0.039     .0218897    .8004358
  _Istate_14 |   1.090932   .4933227     2.21   0.032     .0995635    2.082302
  _Istate_15 |   .7250677   .0271635    26.69   0.000     .6704806    .7796547
  _Istate_16 |   1.223779   .3342132     3.66   0.001     .5521521    1.895405
  _Istate_21 |     1.4065   .7385136     1.90   0.063    -.0775984    2.890599
  _Istate_22 |   1.165654   .5194076     2.24   0.029     .1218655    2.209443
  _Istate_23 |   .9143706    .624345     1.46   0.149    -.3402976    2.169039
  _Istate_31 |   .8840889    .592357     1.49   0.142     -.306297    2.074475
  _Istate_32 |   .5575572   .4108363     1.36   0.181    -.2680492    1.383164
  _Istate_33 |   .8899632   .6192872     1.44   0.157     -.354541    2.134467
  _Istate_34 |   .6288009   .5416117     1.16   0.251    -.4596085     1.71721
  _Istate_35 |   .6778951   .3826146     1.77   0.083    -.0909976    1.446788
  _Istate_41 |   .9747252   .3547702     2.75   0.008     .2617879    1.687663
  _Istate_42 |    .593054   .2364523     2.51   0.015     .1178853    1.068223
  _Istate_43 |   1.136348   .3881253     2.93   0.005     .3563807    1.916315
  _Istate_44 |   .8898847   .1471681     6.05   0.000     .5941393     1.18563
  _Istate_45 |   .1533707   .1691721     0.91   0.369    -.1865933    .4933348
  _Istate_46 |    1.12348   .0921899    12.19   0.000     .9382171    1.308742
  _Istate_47 |   .9668611   .1972503     4.90   0.000     .5704719     1.36325
  _Istate_51 |   1.656265   .1288394    12.86   0.000     1.397352    1.915178
  _Istate_52 |   1.412067   .3578376     3.95   0.000     .6929657    2.131169
  _Istate_54 |   1.106791   .4023995     2.75   0.008     .2981392    1.915443
  _Istate_55 |   .3937455   .1243045     3.17   0.003     .1439462    .6435448
  _Istate_56 |    1.02155   .4226151     2.42   0.019     .1722732    1.870827
  _Istate_57 |   1.180631   .2507064     4.71   0.000     .6768176    1.684444
  _Istate_58 |   1.364589   .4029465     3.39   0.001     .5548376     2.17434
  _Istate_59 |   1.205312    .528265     2.28   0.027      .143724    2.266901
  _Istate_61 |   .5402491   .2564418     2.11   0.040       .02491    1.055588
  _Istate_62 |   1.167154   .3479796     3.35   0.002     .4678633    1.866445
  _Istate_63 |   .9220563   .2841191     3.25   0.002     .3510977    1.493015
  _Istate_64 |   .6107195   .1576422     3.87   0.000     .2939257    .9275133
  _Istate_71 |   .8121488   .1345631     6.04   0.000     .5417341    1.082564
  _Istate_72 |   1.145369   .3307965     3.46   0.001     .4806082    1.810129
  _Istate_73 |   .6862879   .2515879     2.73   0.009      .180703    1.191873
  _Istate_74 |   1.296579   .6587223     1.97   0.055     -.027173    2.620331
  _Istate_81 |   .8376818   .1114513     7.52   0.000      .613712    1.061652
  _Istate_82 |   .5705256   .0858226     6.65   0.000     .3980586    .7429926
  _Istate_83 |   .2922058    .180742     1.62   0.112    -.0710089    .6554205
  _Istate_84 |   1.313958   .2690784     4.88   0.000     .7732251    1.854692
  _Istate_85 |    .730774    .025901    28.21   0.000     .6787239    .7828241
  _Istate_86 |   1.132063   .2091188     5.41   0.000     .7118229    1.552303
  _Istate_87 |   .7015909   .0616967    11.37   0.000     .5776068    .8255749
  _Istate_88 |   .3537668    .046869     7.55   0.000     .2595801    .4479535
  _Istate_91 |   .7576646   .3342996     2.27   0.028     .0858643    1.429465
  _Istate_92 |   .7081491   .2174546     3.26   0.002     .2711578     1.14514
  _Istate_93 |   .9419688   .8091899     1.16   0.250    -.6841591    2.568097
  _Istate_94 |   1.829726   .2060577     8.88   0.000     1.415637    2.243814
  _Istate_95 |   1.400258   .0475463    29.45   0.000      1.30471    1.495806
  _IstaXt_12 |  -.0226069   .0025223    -8.96   0.000    -.0276756   -.0175381
  _IstaXt_13 |  -.0112698   .0032129    -3.51   0.001    -.0177263   -.0048133
  _IstaXt_14 |  -.0380602   .0039486    -9.64   0.000    -.0459953   -.0301252
  _IstaXt_15 |    -.02432   .0031192    -7.80   0.000    -.0305883   -.0180517
  _IstaXt_16 |  -.0440131   .0035207   -12.50   0.000    -.0510882   -.0369381
  _IstaXt_21 |   -.066596   .0033853   -19.67   0.000    -.0733991    -.059793
  _IstaXt_22 |  -.0368795   .0029196   -12.63   0.000    -.0427467   -.0310123
  _IstaXt_23 |  -.0332985    .003941    -8.45   0.000    -.0412184   -.0253787
  _IstaXt_31 |  -.0352291   .0025563   -13.78   0.000    -.0403663   -.0300919
  _IstaXt_32 |  -.0331667   .0025148   -13.19   0.000    -.0382204    -.028113
  _IstaXt_33 |  -.0410016   .0023127   -17.73   0.000    -.0456491   -.0363542
  _IstaXt_34 |  -.0389746   .0019944   -19.54   0.000    -.0429826   -.0349666
  _IstaXt_35 |  -.0307824   .0022566   -13.64   0.000    -.0353172   -.0262476
  _IstaXt_41 |    -.04318   .0030026   -14.38   0.000    -.0492139    -.037146
  _IstaXt_42 |   -.035038   .0035742    -9.80   0.000    -.0422207   -.0278553
  _IstaXt_43 |  -.0416543   .0023518   -17.71   0.000    -.0463805   -.0369281
  _IstaXt_44 |  -.0361531   .0033719   -10.72   0.000    -.0429291   -.0293771
  _IstaXt_45 |  -.0291047   .0033183    -8.77   0.000     -.035773   -.0224363
  _IstaXt_46 |  -.0413627   .0028525   -14.50   0.000    -.0470949   -.0356305
  _IstaXt_47 |  -.0534936   .0023897   -22.39   0.000    -.0582959   -.0486913
  _IstaXt_51 |   -.038273   .0026689   -14.34   0.000    -.0436363   -.0329097
  _IstaXt_52 |  -.0301746   .0024378   -12.38   0.000    -.0350735   -.0252758
  _IstaXt_54 |  -.0319457   .0033713    -9.48   0.000    -.0387206   -.0251707
  _IstaXt_55 |  -.0367693   .0052936    -6.95   0.000    -.0474071   -.0261315
  _IstaXt_56 |  -.0460987   .0028266   -16.31   0.000    -.0517789   -.0404186
  _IstaXt_57 |  -.0133737   .0037597    -3.56   0.001     -.020929   -.0058184
  _IstaXt_58 |  -.0706503   .0027149   -26.02   0.000     -.076106   -.0651946
  _IstaXt_59 |  -.0591872    .004195   -14.11   0.000    -.0676173   -.0507571
  _IstaXt_61 |  -.0146498   .0026229    -5.59   0.000    -.0199208   -.0093788
  _IstaXt_62 |  -.0544202   .0026446   -20.58   0.000    -.0597347   -.0491057
  _IstaXt_63 |  -.0441729   .0033426   -13.22   0.000    -.0508901   -.0374556
  _IstaXt_64 |  -.0481684   .0021596   -22.30   0.000    -.0525082   -.0438286
  _IstaXt_71 |  -.0463158   .0028172   -16.44   0.000    -.0519772   -.0406543
  _IstaXt_72 |  -.0510431    .003736   -13.66   0.000    -.0585509   -.0435352
  _IstaXt_73 |  -.0299708   .0035097    -8.54   0.000    -.0370238   -.0229179
  _IstaXt_74 |  -.0636224   .0030139   -21.11   0.000     -.069679   -.0575657
  _IstaXt_81 |  -.0510821   .0026819   -19.05   0.000    -.0564716   -.0456925
  _IstaXt_82 |  -.0148563   .0031135    -4.77   0.000    -.0211131   -.0085995
  _IstaXt_83 |  -.0269046   .0051659    -5.21   0.000    -.0372858   -.0165234
  _IstaXt_84 |  -.0497757   .0029204   -17.04   0.000    -.0556444    -.043907
  _IstaXt_85 |  -.0471645   .0021906   -21.53   0.000    -.0515667   -.0427624
  _IstaXt_86 |  -.0399841   .0064107    -6.24   0.000    -.0528669   -.0271012
  _IstaXt_87 |  -.0227758   .0046242    -4.93   0.000    -.0320684   -.0134831
  _IstaXt_88 |  -.0280674   .0082819    -3.39   0.001    -.0447105   -.0114243
  _IstaXt_91 |  -.0460066   .0033081   -13.91   0.000    -.0526545   -.0393587
  _IstaXt_92 |  -.0482529   .0009153   -52.72   0.000    -.0500922   -.0464136
  _IstaXt_93 |  -.0456854    .000647   -70.61   0.000    -.0469857   -.0443852
  _IstaXt_94 |  -.0971304   .0034814   -27.90   0.000    -.1041266   -.0901342
  _IstaXt_95 |  -.0546853   .0032176   -17.00   0.000    -.0611513   -.0482192
       _cons |  -7.335344   3.284048    -2.23   0.030    -13.93489   -.7358028
------------------------------------------------------------------------------

. reg lneqp lnemp hm_union mico mppa mgfa _Iyear* _Istat* _IstaXt_* [aw=empwt]i
> f year>=79, cluster(state);
(sum of wgt is   8.5000e+02)

Linear regression                                      Number of obs =     850
                                                       F( 19,    49) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.9873
                                                       Root MSE      =  .14702

                                 (Std. Err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lneqp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       lnemp |   2.299484   .3129915     7.35   0.000     1.670504    2.928464
    hm_union |   .0013802    .004983     0.28   0.783    -.0086335    .0113939
        mico |   .0191896      .0375     0.51   0.611    -.0561694    .0945486
        mppa |    .016377   .0393221     0.42   0.679    -.0626437    .0953977
        mgfa |   .0097142   .0560844     0.17   0.863    -.1029915    .1224199
   _Iyear_80 |   .0065572   .0184374     0.36   0.724    -.0304941    .0436085
   _Iyear_81 |   .0589009    .029452     2.00   0.051     -.000285    .1180869
   _Iyear_82 |   .2416632   .0325522     7.42   0.000     .1762472    .3070792
   _Iyear_83 |   .2301004   .0368903     6.24   0.000     .1559666    .3042343
   _Iyear_84 |   .5197335   .0438145    11.86   0.000     .4316849     .607782
   _Iyear_85 |   .5294521   .0507774    10.43   0.000     .4274111    .6314931
   _Iyear_86 |   .5444103   .0543551    10.02   0.000     .4351798    .6536409
   _Iyear_87 |    .717046   .0640694    11.19   0.000     .5882938    .8457981
   _Iyear_88 |   .2941764   .0637937     4.61   0.000     .1659782    .4223746
   _Iyear_89 |   .2950166    .066989     4.40   0.000     .1603971    .4296361
   _Iyear_90 |   .2769275   .0691622     4.00   0.000     .1379408    .4159141
   _Iyear_91 |   .2959197    .063654     4.65   0.000     .1680022    .4238372
   _Iyear_92 |   .2532472   .0682413     3.71   0.001      .116111    .3903833
   _Iyear_93 |   .2648092   .0696351     3.80   0.000     .1248723    .4047461
   _Iyear_94 |   .2143325   .0796824     2.69   0.010     .0542047    .3744603
   _Iyear_95 |   .2022505   .0870412     2.32   0.024     .0273347    .3771662
  _Istate_12 |  -.0856499   .0995507    -0.86   0.394    -.2857045    .1144046
  _Istate_13 |   .4084049   .2437121     1.68   0.100     -.081353    .8981628
  _Istate_14 |  -2.191731   .6131236    -3.57   0.001    -3.423849   -.9596135
  _Istate_15 |  -.3118177   .0408921    -7.63   0.000    -.3939936   -.2296419
  _Istate_16 |  -1.799722   .4165733    -4.32   0.000    -2.636857   -.9625864
  _Istate_21 |  -3.370904   .9218676    -3.66   0.001    -5.223466   -1.518342
  _Istate_22 |  -2.165593   .6507126    -3.33   0.002    -3.473249   -.8579366
  _Istate_23 |  -3.023314   .7838771    -3.86   0.000    -4.598574   -1.448054
  _Istate_31 |   -2.89757   .7397646    -3.92   0.000    -4.384183   -1.410957
  _Istate_32 |  -1.960174   .5178331    -3.79   0.000    -3.000798   -.9195489
  _Istate_33 |  -2.665078   .7756975    -3.44   0.001      -4.2239   -1.106255
  _Istate_34 |  -2.513779    .682531    -3.68   0.001    -3.885376   -1.142181
  _Istate_35 |  -2.547204   .4809062    -5.30   0.000    -3.513622   -1.580787
  _Istate_41 |  -1.576833   .4412148    -3.57   0.001    -2.463487   -.6901785
  _Istate_42 |   -1.41855   .2951875    -4.81   0.000    -2.011751   -.8253482
  _Istate_43 |  -1.949729   .4825546    -4.04   0.000    -2.919459   -.9799995
  _Istate_44 |   .9635136   .1864579     5.17   0.000     .5888124    1.338215
  _Istate_45 |   .7479347   .2142616     3.49   0.001     .3173599     1.17851
  _Istate_46 |  -.5419292   .1121793    -4.83   0.000    -.7673619   -.3164966
  _Istate_47 |  -.8642869   .2446224    -3.53   0.001    -1.355874   -.3726997
  _Istate_51 |    .539402   .1616106     3.34   0.002     .2146334    .8641706
  _Istate_52 |  -1.171536   .4472717    -2.62   0.012    -2.070362   -.2727102
  _Istate_54 |  -1.654938   .4959479    -3.34   0.002    -2.651582   -.6582931
  _Istate_55 |  -.3720286   .1685998    -2.21   0.032    -.7108426   -.0332145
  _Istate_56 |   -2.38428   .5191267    -4.59   0.000    -3.427505   -1.341056
  _Istate_57 |  -1.669594   .3050888    -5.47   0.000    -2.282693   -1.056495
  _Istate_58 |  -1.858772   .4962412    -3.75   0.000    -2.856006   -.8615383
  _Istate_59 |   -1.80948    .651605    -2.78   0.008    -3.118929   -.5000307
  _Istate_61 |  -1.510587   .3197293    -4.72   0.000    -2.153107   -.8680667
  _Istate_62 |  -1.787483   .4314171    -4.14   0.000    -2.654449   -.9205183
  _Istate_63 |  -1.470958   .3530313    -4.17   0.000    -2.180401    -.761515
  _Istate_64 |  -.6746647   .1912579    -3.53   0.001    -1.059012   -.2903176
  _Istate_71 |  -.5593386   .1680485    -3.33   0.002    -.8970447   -.2216325
  _Istate_72 |   .1907328   .4075898     0.47   0.642    -.6283496    1.009815
  _Istate_73 |  -.0728474   .3082356    -0.24   0.814    -.6922701    .5465752
  _Istate_74 |  -2.170319   .8133202    -2.67   0.010    -3.804747   -.5358905
  _Istate_81 |   .8907496   .1411346     6.31   0.000      .607129     1.17437
  _Istate_82 |   .3752714   .1043293     3.60   0.001     .1656138     .584929
  _Istate_83 |   2.461984   .2269384    10.85   0.000     2.005935    2.918034
  _Istate_84 |   -.445126   .3312539    -1.34   0.185    -1.110806    .2205535
  _Istate_85 |   .7383131   .0330754    22.32   0.000     .6718455    .8047807
  _Istate_86 |  -.3640354   .2558448    -1.42   0.161    -.8781748    .1501039
  _Istate_87 |    .308665   .0754771     4.09   0.000      .156988     .460342
  _Istate_88 |   .9587323    .065413    14.66   0.000       .82728    1.090185
  _Istate_91 |  -1.144659   .4205782    -2.72   0.009    -1.989843   -.2994756
  _Istate_92 |  -.4246713   .2759262    -1.54   0.130    -.9791658    .1298232
  _Istate_93 |   -3.07804   1.007215    -3.06   0.004    -5.102114   -1.053966
  _Istate_94 |   2.238914   .2554078     8.77   0.000     1.725653    2.752175
  _Istate_95 |   .4469283   .0721727     6.19   0.000     .3018919    .5919647
  _IstaXt_12 |   .0146552   .0034667     4.23   0.000     .0076885    .0216219
  _IstaXt_13 |   .0222727   .0047278     4.71   0.000     .0127718    .0317736
  _IstaXt_14 |   .0269462   .0052491     5.13   0.000     .0163977    .0374946
  _IstaXt_15 |    .058646   .0039061    15.01   0.000     .0507965    .0664956
  _IstaXt_16 |   .0290146   .0047103     6.16   0.000     .0195489    .0384803
  _IstaXt_21 |   -.002035   .0042579    -0.48   0.635    -.0105916    .0065215
  _IstaXt_22 |   .0090005   .0038041     2.37   0.022     .0013558    .0166452
  _IstaXt_23 |   .0238385    .005265     4.53   0.000     .0132581    .0344189
  _IstaXt_31 |   .0215271   .0036562     5.89   0.000     .0141797    .0288746
  _IstaXt_32 |   .0226893   .0038503     5.89   0.000     .0149519    .0304267
  _IstaXt_33 |  -.0039531   .0029735    -1.33   0.190    -.0099286    .0020223
  _IstaXt_34 |   .0102309   .0028422     3.60   0.001     .0045193    .0159425
  _IstaXt_35 |   .0170587   .0033055     5.16   0.000     .0104161    .0237014
  _IstaXt_41 |   -.008398   .0043462    -1.93   0.059     -.017132     .000336
  _IstaXt_42 |   .0094593   .0053505     1.77   0.083     -.001293    .0202115
  _IstaXt_43 |   .0257561   .0036841     6.99   0.000     .0183527    .0331595
  _IstaXt_44 |  -.0099368   .0046143    -2.15   0.036    -.0192096   -.0006641
  _IstaXt_45 |  -.0073138   .0048718    -1.50   0.140    -.0171041    .0024764
  _IstaXt_46 |  -.0011149   .0043245    -0.26   0.798    -.0098052    .0075755
  _IstaXt_47 |    .015076   .0031327     4.81   0.000     .0087807    .0213714
  _IstaXt_51 |   .0244237    .004802     5.09   0.000     .0147738    .0340737
  _IstaXt_52 |  -.0053162    .003608    -1.47   0.147    -.0125667    .0019343
  _IstaXt_54 |  -.0156266   .0048542    -3.22   0.002    -.0253814   -.0058718
  _IstaXt_55 |    .028019   .0073637     3.81   0.000     .0132211    .0428168
  _IstaXt_56 |   .0111875   .0042251     2.65   0.011     .0026969    .0196781
  _IstaXt_57 |   .0384868   .0052233     7.37   0.000     .0279901    .0489834
  _IstaXt_58 |   .0116288   .0033659     3.45   0.001     .0048648    .0183929
  _IstaXt_59 |  -.0347824   .0052238    -6.66   0.000      -.04528   -.0242847
  _IstaXt_61 |   .0378788   .0040143     9.44   0.000     .0298117    .0459459
  _IstaXt_62 |   .0179441   .0040204     4.46   0.000     .0098647    .0260235
  _IstaXt_63 |   .0188414   .0057972     3.25   0.002     .0071915    .0304914
  _IstaXt_64 |  -.0042567   .0034993    -1.22   0.230    -.0112889    .0027754
  _IstaXt_71 |   .0102072   .0037188     2.74   0.008      .002734    .0176804
  _IstaXt_72 |  -.0205126   .0047147    -4.35   0.000    -.0299872   -.0110381
  _IstaXt_73 |  -.0341854   .0045286    -7.55   0.000    -.0432859   -.0250848
  _IstaXt_74 |  -.0274294   .0042169    -6.50   0.000    -.0359036   -.0189551
  _IstaXt_81 |  -.0082909   .0045506    -1.82   0.075    -.0174356    .0008538
  _IstaXt_82 |  -.0110519   .0058753    -1.88   0.066    -.0228588     .000755
  _IstaXt_83 |  -.0302044   .0071578    -4.22   0.000    -.0445885   -.0158203
  _IstaXt_84 |  -.0298722   .0043061    -6.94   0.000    -.0385256   -.0212188
  _IstaXt_85 |    -.01103   .0033203    -3.32   0.002    -.0177025   -.0043575
  _IstaXt_86 |  -.0286049   .0091073    -3.14   0.003    -.0469067   -.0103032
  _IstaXt_87 |   -.024438   .0065517    -3.73   0.000    -.0376042   -.0112718
  _IstaXt_88 |   -.031615   .0114111    -2.77   0.008    -.0545465   -.0086834
  _IstaXt_91 |  -.0174791   .0047294    -3.70   0.001    -.0269833   -.0079749
  _IstaXt_92 |  -.0151919   .0011681   -13.01   0.000    -.0175394   -.0128445
  _IstaXt_93 |  -.0212133   .0014112   -15.03   0.000    -.0240492   -.0183775
  _IstaXt_94 |  -.0618888   .0064021    -9.67   0.000    -.0747542   -.0490233
  _IstaXt_95 |  -.0202241   .0044249    -4.57   0.000    -.0291162    -.011332
       _cons |  -24.17242   4.085656    -5.92   0.000    -32.38286   -15.96199
------------------------------------------------------------------------------

. reg lncmp lnemp hm_union mico mppa mgfa _Iyear* _Istat* _IstaXt_* [aw=empwt]i
> f year>=79, cluster(state);
(sum of wgt is   8.5000e+02)

Linear regression                                      Number of obs =     850
                                                       F( 19,    49) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.9919
                                                       Root MSE      =  .15994

                                 (Std. Err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lncmp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       lnemp |    1.45852   .4193241     3.48   0.001     .6158569    2.301184
    hm_union |  -.0107418   .0046808    -2.29   0.026    -.0201482   -.0013354
        mico |   .0229625   .0386192     0.59   0.555    -.0546457    .1005707
        mppa |   .0558943   .0462149     1.21   0.232     -.036978    .1487666
        mgfa |   .0754061   .0731076     1.03   0.307    -.0715092    .2223214
   _Iyear_80 |   .0676197   .0249678     2.71   0.009      .017445    .1177944
   _Iyear_81 |   .1419712   .0274058     5.18   0.000     .0868971    .1970453
   _Iyear_82 |   .3211556   .0418948     7.67   0.000     .2369649    .4053463
   _Iyear_83 |   .3982411   .0484321     8.22   0.000     .3009131    .4955691
   _Iyear_84 |   .4031971   .0490804     8.22   0.000     .3045664    .5018279
   _Iyear_85 |   .4572969   .0621794     7.35   0.000     .3323427    .5822512
   _Iyear_86 |   .4808905   .0768363     6.26   0.000     .3264822    .6352989
   _Iyear_87 |   .6150074   .0847731     7.25   0.000     .4446495    .7853653
   _Iyear_88 |   .6790663   .0877765     7.74   0.000     .5026729    .8554597
   _Iyear_89 |   .7223545   .0995833     7.25   0.000     .5222344    .9224746
   _Iyear_90 |    .811081   .0980046     8.28   0.000     .6141334    1.008029
   _Iyear_91 |   .8853241   .0957854     9.24   0.000     .6928361    1.077812
   _Iyear_92 |   .9417866   .0987685     9.54   0.000     .7433038    1.140269
   _Iyear_93 |   1.056403   .1027621    10.28   0.000      .849895    1.262911
   _Iyear_94 |    1.06829    .108302     9.86   0.000     .8506488    1.285931
   _Iyear_95 |   1.191405    .121449     9.81   0.000      .947344    1.435466
  _Istate_12 |   1.326243   .1284258    10.33   0.000     1.068161    1.584324
  _Istate_13 |   1.114436   .3113018     3.58   0.001     .4888514     1.74002
  _Istate_14 |   1.257278   .8509335     1.48   0.146    -.4527367    2.967293
  _Istate_15 |   1.900535   .0388195    48.96   0.000     1.822525    1.978546
  _Istate_16 |    1.21882   .5821315     2.09   0.041     .0489827    2.388657
  _Istate_21 |   .6436747   1.223396     0.53   0.601    -1.814831     3.10218
  _Istate_22 |   1.271548   .8762855     1.45   0.153    -.4894139    3.032509
  _Istate_23 |   .5013278   1.049377     0.48   0.635    -1.607475    2.610131
  _Istate_31 |   .3302432   .9851668     0.34   0.739    -1.649524     2.31001
  _Istate_32 |   .0715433   .6989813     0.10   0.919    -1.333112    1.476199
  _Istate_33 |   .9371501   1.037286     0.90   0.371    -1.147355    3.021655
  _Istate_34 |    .600619   .9026243     0.67   0.509    -1.213272     2.41451
  _Istate_35 |   .6440076   .6490998     0.99   0.326    -.6604074    1.948422
  _Istate_41 |   .9796274   .5907424     1.66   0.104    -.2075139    2.166769
  _Istate_42 |   .8886608   .3980322     2.23   0.030     .0887852    1.688536
  _Istate_43 |   1.263368   .6457588     1.96   0.056    -.0343326    2.561069
  _Istate_44 |    .216994   .2339585     0.93   0.358    -.2531631    .6871512
  _Istate_45 |  -.1642222    .271805    -0.60   0.549    -.7104347    .3819904
  _Istate_46 |   1.625761   .1558339    10.43   0.000     1.312601    1.938921
  _Istate_47 |   1.043883   .3465028     3.01   0.004     .3475596    1.740206
  _Istate_51 |   1.174801   .2143618     5.48   0.000     .7440251    1.605577
  _Istate_52 |   2.168566   .6086408     3.56   0.001     .9454562    3.391675
  _Istate_54 |   1.636223   .6791416     2.41   0.020     .2714369    3.001009
  _Istate_55 |  -.4443741   .2121399    -2.09   0.041    -.8706852   -.0180631
  _Istate_56 |    .067467   .7168354     0.09   0.925    -1.373068    1.508002
  _Istate_57 |  -.5067483   .4310243    -1.18   0.245    -1.372924    .3594276
  _Istate_58 |   .9979772   .6833519     1.46   0.151    -.3752699    2.371224
  _Istate_59 |   .6942166   .8925254     0.78   0.440     -1.09938    2.487813
  _Istate_61 |   .5085327   .4335646     1.17   0.247    -.3627479    1.379813
  _Istate_62 |   .2803363   .5837972     0.48   0.633    -.8928481    1.453521
  _Istate_63 |   1.060378    .478959     2.21   0.032     .0978736    2.022882
  _Istate_64 |   .4540546    .268423     1.69   0.097    -.0853617    .9934708
  _Istate_71 |   .3672856   .2454446     1.50   0.141    -.1259538    .8605249
  _Istate_72 |   .4302556   .5616722     0.77   0.447     -.698467    1.558978
  _Istate_73 |   .4626144   .4230901     1.09   0.280     -.387617    1.312846
  _Istate_74 |   .5944924   1.111576     0.53   0.595    -1.639303    2.828288
  _Istate_81 |   .3555127   .1643924     2.16   0.035     .0251539    .6858716
  _Istate_82 |   .0758451   .1314436     0.58   0.567    -.1883006    .3399909
  _Istate_83 |   .3381397   .2965574     1.14   0.260    -.2578148    .9340941
  _Istate_84 |   1.423131   .4556646     3.12   0.003      .507439    2.338823
  _Istate_85 |   .9666157    .045708    21.15   0.000      .874762    1.058469
  _Istate_86 |   1.033591   .3554729     2.91   0.005     .3192419    1.747941
  _Istate_87 |   1.316437   .1020825    12.90   0.000     1.111294     1.52158
  _Istate_88 |    1.31024   .0800355    16.37   0.000     1.149403    1.471077
  _Istate_91 |   1.439251   .5458386     2.64   0.011     .3423472    2.536155
  _Istate_92 |   1.105875   .3717745     2.97   0.005     .3587659    1.852984
  _Istate_93 |   .6011096   1.366348     0.44   0.662    -2.144669    3.346888
  _Istate_94 |   .9688034    .341108     2.84   0.007     .2833212    1.654286
  _Istate_95 |   1.711101   .0637775    26.83   0.000     1.582936    1.839267
  _IstaXt_12 |   .0018112   .0034181     0.53   0.599    -.0050577    .0086801
  _IstaXt_13 |  -.0009901   .0052405    -0.19   0.851    -.0115213    .0095411
  _IstaXt_14 |   .0086672   .0064554     1.34   0.186    -.0043055    .0216399
  _IstaXt_15 |  -.0156929   .0051222    -3.06   0.004    -.0259864   -.0053994
  _IstaXt_16 |  -.0199921   .0057991    -3.45   0.001    -.0316459   -.0083383
  _IstaXt_21 |  -.0288872   .0058723    -4.92   0.000    -.0406879   -.0170865
  _IstaXt_22 |  -.0110581   .0046818    -2.36   0.022    -.0204664   -.0016497
  _IstaXt_23 |  -.0083737    .005756    -1.45   0.152    -.0199408    .0031933
  _IstaXt_31 |   .0052109   .0041109     1.27   0.211    -.0030503     .013472
  _IstaXt_32 |  -.0004163   .0036682    -0.11   0.910    -.0077877    .0069552
  _IstaXt_33 |  -.0316644   .0036374    -8.71   0.000    -.0389739   -.0243548
  _IstaXt_34 |  -.0009564   .0028727    -0.33   0.741    -.0067294    .0048165
  _IstaXt_35 |  -.0317899   .0032638    -9.74   0.000    -.0383488    -.025231
  _IstaXt_41 |  -.0034091   .0048497    -0.70   0.485     -.013155    .0063367
  _IstaXt_42 |  -.0028288   .0056268    -0.50   0.617    -.0141363    .0084787
  _IstaXt_43 |  -.0518417   .0042435   -12.22   0.000    -.0603694   -.0433141
  _IstaXt_44 |   .0296269   .0050721     5.84   0.000     .0194342    .0398195
  _IstaXt_45 |   .0483321   .0058055     8.33   0.000     .0366655    .0599987
  _IstaXt_46 |   .0072875   .0047825     1.52   0.134    -.0023233    .0168983
  _IstaXt_47 |  -.0391464   .0033802   -11.58   0.000    -.0459392   -.0323536
  _IstaXt_51 |   .0008137   .0065763     0.12   0.902    -.0124019    .0140293
  _IstaXt_52 |  -.0380549    .003659   -10.40   0.000    -.0454078   -.0307019
  _IstaXt_54 |  -.0052401   .0058214    -0.90   0.372    -.0169386    .0064584
  _IstaXt_55 |   .0042554   .0084221     0.51   0.616    -.0126694    .0211802
  _IstaXt_56 |  -.0030834   .0055609    -0.55   0.582    -.0142585    .0080916
  _IstaXt_57 |   .0379149   .0057496     6.59   0.000     .0263607     .049469
  _IstaXt_58 |  -.0142779    .004526    -3.15   0.003    -.0233732   -.0051826
  _IstaXt_59 |  -.0374133   .0069479    -5.38   0.000    -.0513756   -.0234509
  _IstaXt_61 |  -.0216908   .0045104    -4.81   0.000    -.0307548   -.0126268
  _IstaXt_62 |  -.0327924   .0050957    -6.44   0.000    -.0430326   -.0225521
  _IstaXt_63 |  -.0336271   .0067185    -5.01   0.000    -.0471284   -.0201259
  _IstaXt_64 |  -.0793633   .0040581   -19.56   0.000    -.0875184   -.0712082
  _IstaXt_71 |  -.0146561   .0038904    -3.77   0.000    -.0224742    -.006838
  _IstaXt_72 |  -.0580733   .0060616    -9.58   0.000    -.0702545   -.0458921
  _IstaXt_73 |  -.0121065   .0049642    -2.44   0.018    -.0220823   -.0021306
  _IstaXt_74 |   -.022395   .0044942    -4.98   0.000    -.0314264   -.0133637
  _IstaXt_81 |   .0058232   .0049555     1.18   0.246    -.0041352    .0157816
  _IstaXt_82 |   .0103824   .0078669     1.32   0.193    -.0054268    .0261916
  _IstaXt_83 |  -.0691709   .0084721    -8.16   0.000    -.0861962   -.0521457
  _IstaXt_84 |  -.0042735   .0049457    -0.86   0.392    -.0142122    .0056653
  _IstaXt_85 |  -.0380509   .0043659    -8.72   0.000    -.0468246   -.0292772
  _IstaXt_86 |  -.0399011   .0133319    -2.99   0.004    -.0666925   -.0131097
  _IstaXt_87 |   .0253563   .0080942     3.13   0.003     .0090905    .0416222
  _IstaXt_88 |  -.0880906   .0167531    -5.26   0.000    -.1217572   -.0544239
  _IstaXt_91 |  -.0488207   .0067128    -7.27   0.000    -.0623105   -.0353309
  _IstaXt_92 |  -.0135577   .0014579    -9.30   0.000    -.0164874    -.010628
  _IstaXt_93 |   -.015943   .0015991    -9.97   0.000    -.0191565   -.0127294
  _IstaXt_94 |  -.0769062   .0089952    -8.55   0.000    -.0949826   -.0588297
  _IstaXt_95 |  -.0888333   .0048007   -18.50   0.000    -.0984806    -.079186
       _cons |  -13.23018   5.432258    -2.44   0.019    -24.14671   -2.313644
------------------------------------------------------------------------------

. reg lnmsc lnemp hm_union mico mppa mgfa _Iyear* _Istat* _IstaXt_* [aw=empwt]i
> f year>=79, cluster(state);
(sum of wgt is   8.4900e+02)

Linear regression                                      Number of obs =     849
                                                       F( 19,    49) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.9928
                                                       Root MSE      =  .11791

                                 (Std. Err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnmsc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       lnemp |   1.413941   .1952667     7.24   0.000     1.021538    1.806344
    hm_union |  -.0018129   .0047825    -0.38   0.706    -.0114236    .0077978
        mico |  -.0046799   .0234167    -0.20   0.842    -.0517375    .0423777
        mppa |    .032729    .043578     0.75   0.456    -.0548443    .1203023
        mgfa |   .0998517   .0534367     1.87   0.068    -.0075334    .2072369
   _Iyear_80 |   .0575452   .0235894     2.44   0.018     .0101405      .10495
   _Iyear_81 |   .0868902   .0169815     5.12   0.000     .0527647    .1210157
   _Iyear_82 |   .1693654   .0231103     7.33   0.000     .1229234    .2158073
   _Iyear_83 |    .194183   .0229385     8.47   0.000     .1480864    .2402797
   _Iyear_84 |   .1817701   .0259699     7.00   0.000     .1295817    .2339585
   _Iyear_85 |   .2161686   .0362369     5.97   0.000     .1433478    .2889893
   _Iyear_86 |   .2708923   .0389591     6.95   0.000      .192601    .3491836
   _Iyear_87 |   .3453156   .0497626     6.94   0.000     .2453139    .4453173
   _Iyear_88 |   .3669177   .0432061     8.49   0.000     .2800918    .4537435
   _Iyear_89 |   .3425372   .0502847     6.81   0.000     .2414863    .4435881
   _Iyear_90 |   .4091567   .0512714     7.98   0.000      .306123    .5121904
   _Iyear_91 |   .5237621   .0467961    11.19   0.000     .4297217    .6178024
   _Iyear_92 |   .5275031   .0493952    10.68   0.000     .4282397    .6267664
   _Iyear_93 |   .5816712   .0503293    11.56   0.000     .4805306    .6828118
   _Iyear_94 |      .5969   .0584691    10.21   0.000      .479402    .7143981
   _Iyear_95 |   .6153259   .0607697    10.13   0.000     .4932046    .7374473
  _Istate_12 |  -.2936651   .0804386    -3.65   0.001    -.4553126   -.1320177
  _Istate_13 |   .3091764   .1392706     2.22   0.031     .0293016    .5890512
  _Istate_14 |  -.1278208   .3822712    -0.33   0.740    -.8960235     .640382
  _Istate_15 |   .7406113   .0324975    22.79   0.000     .6753052    .8059174
  _Istate_16 |    .181499   .2619961     0.69   0.492    -.3450018    .7079998
  _Istate_21 |   .0157377   .5716272     0.03   0.978     -1.13299    1.164466
  _Istate_22 |   .2340216   .4144736     0.56   0.575    -.5988944    1.066938
  _Istate_23 |  -.3612886   .4952034    -0.73   0.469    -1.356437    .6338599
  _Istate_31 |  -.4109462   .4611118    -0.89   0.377    -1.337585    .5156927
  _Istate_32 |   -.384767   .3353326    -1.15   0.257    -1.058643    .2891092
  _Istate_33 |  -.3198016   .4834022    -0.66   0.511    -1.291235    .6516315
  _Istate_34 |  -.1760102   .4235494    -0.42   0.680    -1.027165    .6751442
  _Istate_35 |  -.2306507   .3097494    -0.74   0.460    -.8531154    .3918139
  _Istate_41 |   -.139457     .27871    -0.50   0.619    -.6995457    .4206318
  _Istate_42 |  -.4388172   .1925345    -2.28   0.027    -.8257298   -.0519046
  _Istate_43 |   .0744568   .3022933     0.25   0.806    -.5330243     .681938
  _Istate_44 |  -.1326908   .1043321    -1.27   0.209     -.342354    .0769724
  _Istate_45 |  -.0643085   .1229341    -0.52   0.603    -.3113539    .1827368
  _Istate_46 |  -.0129402   .0777012    -0.17   0.868    -.1690865    .1432061
  _Istate_47 |  -.4639946   .1711118    -2.71   0.009    -.8078566   -.1201325
  _Istate_51 |   1.057212   .0928067    11.39   0.000     .8707101    1.243714
  _Istate_52 |   .2311159   .2898734     0.80   0.429    -.3514066    .8136384
  _Istate_54 |   -.350895   .3232566    -1.09   0.283    -1.000504    .2987135
  _Istate_55 |  -.4517511   .1270658    -3.56   0.001    -.7070993   -.1964029
  _Istate_56 |  -.5436148   .3451074    -1.58   0.122    -1.237134    .1499044
  _Istate_57 |  -.2031485   .2163668    -0.94   0.352    -.6379539    .2316569
  _Istate_58 |  -.1633652    .327047    -0.50   0.620    -.8205908    .4938604
  _Istate_59 |  -.0189912   .4245214    -0.04   0.964    -.8720988    .8341164
  _Istate_61 |  -.2061809   .2061274    -1.00   0.322    -.6204095    .2080476
  _Istate_62 |  -.4248802    .274434    -1.55   0.128    -.9763761    .1266156
  _Istate_63 |   .0077816   .2361605     0.03   0.974    -.4668008     .482364
  _Istate_64 |  -.0981008   .1339846    -0.73   0.468    -.3673529    .1711514
  _Istate_71 |  -.3554707   .1297713    -2.74   0.009    -.6162559   -.0946855
  _Istate_72 |   .1795314   .2690024     0.67   0.508    -.3610491     .720112
  _Istate_73 |  -.2949691   .1982881    -1.49   0.143     -.693444    .1035058
  _Istate_74 |  -.5056299   .5272541    -0.96   0.342    -1.565187    .5539269
  _Istate_81 |  -.2644763   .0928137    -2.85   0.006    -.4509924   -.0779603
  _Istate_82 |   .4246817   .0714802     5.94   0.000      .281037    .5683265
  _Istate_83 |  -.0839371   .1278383    -0.66   0.515    -.3408378    .1729637
  _Istate_84 |   .0844124   .2181181     0.39   0.700    -.3539124    .5227371
  _Istate_85 |  -.0933631   .0320192    -2.92   0.005    -.1577081   -.0290181
  _Istate_86 |   .4518148   .1757896     2.57   0.013     .0985523    .8050773
  _Istate_87 |   .2530232   .0548397     4.61   0.000     .1428188    .3632277
  _Istate_88 |   1.034466   .0447117    23.14   0.000     .9446144    1.124318
  _Istate_91 |  -.0560108   .2554173    -0.22   0.827     -.569291    .4572694
  _Istate_92 |   .2764656   .1769846     1.56   0.125    -.0791983    .6321294
  _Istate_93 |  -.4367918    .618252    -0.71   0.483    -1.679216    .8056322
  _Istate_94 |   .7187572   .1716516     4.19   0.000     .3738104    1.063704
  _Istate_95 |    .915357   .0704651    12.99   0.000     .7737521    1.056962
  _IstaXt_12 |   -.014791   .0019872    -7.44   0.000    -.0187844   -.0107975
  _IstaXt_13 |   -.042845   .0040473   -10.59   0.000    -.0509783   -.0347117
  _IstaXt_14 |  -.0257449   .0039427    -6.53   0.000    -.0336681   -.0178216
  _IstaXt_15 |  -.0288939   .0023825   -12.13   0.000    -.0336817   -.0241062
  _IstaXt_16 |  -.0194472   .0035908    -5.42   0.000    -.0266631   -.0122312
  _IstaXt_21 |  -.0348595   .0030564   -11.41   0.000    -.0410015   -.0287175
  _IstaXt_22 |  -.0247373   .0027731    -8.92   0.000      -.03031   -.0191645
  _IstaXt_23 |  -.0206557   .0036848    -5.61   0.000    -.0280606   -.0132508
  _IstaXt_31 |  -.0191601    .003031    -6.32   0.000     -.025251   -.0130692
  _IstaXt_32 |  -.0104005   .0032732    -3.18   0.003    -.0169782   -.0038228
  _IstaXt_33 |  -.0082183   .0018374    -4.47   0.000    -.0119106   -.0045259
  _IstaXt_34 |  -.0323854   .0024204   -13.38   0.000    -.0372495   -.0275213
  _IstaXt_35 |  -.0313871   .0024622   -12.75   0.000    -.0363351   -.0264391
  _IstaXt_41 |  -.0167742   .0037382    -4.49   0.000    -.0242864    -.009262
  _IstaXt_42 |   .0155314   .0049216     3.16   0.003      .005641    .0254217
  _IstaXt_43 |  -.0370977    .003953    -9.38   0.000    -.0450416   -.0291538
  _IstaXt_44 |  -.0027302   .0040722    -0.67   0.506    -.0109137    .0054532
  _IstaXt_45 |    .009387   .0041779     2.25   0.029     .0009912    .0177828
  _IstaXt_46 |   .0588912   .0041279    14.27   0.000     .0505959    .0671865
  _IstaXt_47 |   .0076449   .0021486     3.56   0.001     .0033271    .0119627
  _IstaXt_51 |  -.0222786   .0038015    -5.86   0.000    -.0299179   -.0146392
  _IstaXt_52 |   -.022218   .0029166    -7.62   0.000     -.028079    -.016357
  _IstaXt_54 |  -.0091376   .0039323    -2.32   0.024    -.0170399   -.0012353
  _IstaXt_55 |   .0214453   .0058384     3.67   0.001     .0097126     .033178
  _IstaXt_56 |  -.0166014   .0040168    -4.13   0.000    -.0246734   -.0085293
  _IstaXt_57 |  -.0162267   .0037524    -4.32   0.000    -.0237675    -.008686
  _IstaXt_58 |   -.021551   .0021128   -10.20   0.000    -.0257969   -.0173052
  _IstaXt_59 |  -.0319099   .0032267    -9.89   0.000    -.0383943   -.0254255
  _IstaXt_61 |  -.0242635   .0037107    -6.54   0.000    -.0317205   -.0168064
  _IstaXt_62 |   .0109578   .0039049     2.81   0.007     .0031106     .018805
  _IstaXt_63 |  -.0365816    .004721    -7.75   0.000    -.0460688   -.0270944
  _IstaXt_64 |  -.0280812   .0039016    -7.20   0.000    -.0359217   -.0202406
  _IstaXt_71 |  -.0073562   .0018017    -4.08   0.000    -.0109769   -.0037355
  _IstaXt_72 |  -.0205653    .002857    -7.20   0.000    -.0263066    -.014824
  _IstaXt_73 |  -.0043516   .0040879    -1.06   0.292    -.0125666    .0038635
  _IstaXt_74 |  -.0089113    .003331    -2.68   0.010    -.0156053   -.0022174
  _IstaXt_81 |  -.0045075   .0037012    -1.22   0.229    -.0119454    .0029304
  _IstaXt_82 |  -.0683041   .0047442   -14.40   0.000    -.0778379   -.0587703
  _IstaXt_83 |  -.0107624    .005652    -1.90   0.063    -.0221205    .0005958
  _IstaXt_84 |  -.0100538   .0037292    -2.70   0.010     -.017548   -.0025596
  _IstaXt_85 |   .0133204    .003265     4.08   0.000     .0067591    .0198817
  _IstaXt_86 |  -.0314623      .0056    -5.62   0.000    -.0427159   -.0202087
  _IstaXt_87 |   .0035185   .0051782     0.68   0.500    -.0068875    .0139246
  _IstaXt_88 |  -.0344134   .0068172    -5.05   0.000    -.0481131   -.0207138
  _IstaXt_91 |  -.0361991    .004626    -7.83   0.000    -.0454954   -.0269027
  _IstaXt_92 |  -.0347215   .0007128   -48.71   0.000     -.036154    -.033289
  _IstaXt_93 |  -.0245033   .0012224   -20.04   0.000    -.0269599   -.0220467
  _IstaXt_94 |  -.0367443   .0048561    -7.57   0.000    -.0465031   -.0269855
  _IstaXt_95 |  -.0306671   .0028011   -10.95   0.000    -.0362962    -.025038
       _cons |   -10.8818    2.52213    -4.31   0.000    -15.95021   -5.813392
------------------------------------------------------------------------------

. reg lnper lnemp hm_union mico mppa mgfa _Iyear* _Istat* _IstaXt_* [aw=empwt]i
> f year>=79, cluster(state);
(sum of wgt is   8.5000e+02)

Linear regression                                      Number of obs =     850
                                                       F( 19,    49) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.9886
                                                       Root MSE      =  .18619

                                 (Std. Err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnper |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       lnemp |   1.865923   .3523391     5.30   0.000     1.157871    2.573975
    hm_union |   .0071969   .0063267     1.14   0.261    -.0055171     .019911
        mico |   .1048789   .0473694     2.21   0.032     .0096865    .2000714
        mppa |  -.0456874   .0751229    -0.61   0.546    -.1966525    .1052777
        mgfa |  -.1115604   .0625695    -1.78   0.081    -.2372985    .0141777
   _Iyear_80 |  -.0023454    .042284    -0.06   0.956    -.0873183    .0826276
   _Iyear_81 |   .0372412   .0504246     0.74   0.464    -.0640909    .1385733
   _Iyear_82 |   .1779413   .0484314     3.67   0.001     .0806149    .2752678
   _Iyear_83 |   .1741219   .0535855     3.25   0.002     .0664378    .2818061
   _Iyear_84 |   .4244366   .0567569     7.48   0.000     .3103793    .5384938
   _Iyear_85 |   .6389323   .0670246     9.53   0.000     .5042413    .7736233
   _Iyear_86 |   .8101102   .0713314    11.36   0.000     .6667644     .953456
   _Iyear_87 |   1.033093   .0969158    10.66   0.000     .8383332    1.227852
   _Iyear_88 |   1.148379   .0779551    14.73   0.000     .9917219    1.305035
   _Iyear_89 |   1.298044   .0880564    14.74   0.000     1.121088       1.475
   _Iyear_90 |   1.417325   .0929688    15.25   0.000     1.230498    1.604153
   _Iyear_91 |   1.527365   .0896815    17.03   0.000     1.347143    1.707587
   _Iyear_92 |   1.683759   .0979711    17.19   0.000     1.486879    1.880639
   _Iyear_93 |   1.877996   .0970677    19.35   0.000     1.682931     2.07306
   _Iyear_94 |   2.035009   .1054285    19.30   0.000     1.823143    2.246876
   _Iyear_95 |   2.167775   .1134997    19.10   0.000     1.939689    2.395861
  _Istate_12 |   1.068174    .139981     7.63   0.000     .7868719    1.349477
  _Istate_13 |   .0779652   .2539608     0.31   0.760    -.4323882    .5883186
  _Istate_14 |   .5913821   .7301066     0.81   0.422    -.8758221    2.058586
  _Istate_15 |   1.393204   .0538597    25.87   0.000     1.284969     1.50144
  _Istate_16 |   1.070537   .5046447     2.12   0.039     .0564155    2.084659
  _Istate_21 |  -.4464078   1.024468    -0.44   0.665    -2.505153    1.612337
  _Istate_22 |   .1988811   .7502751     0.27   0.792    -1.308853    1.706615
  _Istate_23 |  -.4995415   .8949046    -0.56   0.579     -2.29792    1.298837
  _Istate_31 |  -.7444395   .8284622    -0.90   0.373    -2.409297    .9204176
  _Istate_32 |  -.3614536   .6076586    -0.59   0.555    -1.582589     .859682
  _Istate_33 |  -.6891477   .8784957    -0.78   0.437    -2.454551    1.076256
  _Istate_34 |  -.6818119    .763158    -0.89   0.376    -2.215435    .8518116
  _Istate_35 |   .2217639   .5610915     0.40   0.694    -.9057917     1.34932
  _Istate_41 |   .5820001   .4984218     1.17   0.249    -.4196159    1.583616
  _Istate_42 |  -.1340749   .3433624    -0.39   0.698    -.8240874    .5559375
  _Istate_43 |   .0570626   .5430454     0.11   0.917    -1.034228    1.148353
  _Istate_44 |    .376892   .1898693     1.99   0.053    -.0046647    .7584486
  _Istate_45 |   .4520326   .2221403     2.03   0.047     .0056249    .8984403
  _Istate_46 |   .7397528   .1378894     5.36   0.000     .4626538    1.016852
  _Istate_47 |  -.2008632   .3156708    -0.64   0.528    -.8352275    .4335011
  _Istate_51 |   2.440336   .1792634    13.61   0.000     2.080092    2.800579
  _Istate_52 |   .6189103   .5266061     1.18   0.246    -.4393443    1.677165
  _Istate_54 |   .0923122   .5829564     0.16   0.875    -1.079183    1.263807
  _Istate_55 |  -.0460989   .2124639    -0.22   0.829    -.4730611    .3808633
  _Istate_56 |  -.4557189   .6217426    -0.73   0.467    -1.705157    .7937197
  _Istate_57 |  -.0139695   .3875808    -0.04   0.971    -.7928423    .7649033
  _Istate_58 |   .1196031   .5907577     0.20   0.840    -1.067569    1.306775
  _Istate_59 |   .0427243   .7667812     0.06   0.956     -1.49818    1.583629
  _Istate_61 |  -.0004982    .372418    -0.00   0.999    -.7489001    .7479037
  _Istate_62 |   .1058136   .4956796     0.21   0.832    -.8902919    1.101919
  _Istate_63 |  -.5149029    .415859    -1.24   0.222    -1.350603     .320797
  _Istate_64 |  -.3001563   .2384905    -1.26   0.214    -.7794209    .1791083
  _Istate_71 |   -.156605   .2421179    -0.65   0.521    -.6431591    .3299492
  _Istate_72 |   .7766831   .4861351     1.60   0.117    -.2002421    1.753608
  _Istate_73 |   .5683294   .3602472     1.58   0.121    -.1556146    1.292273
  _Istate_74 |  -.5131653   .9528134    -0.54   0.593    -2.427916    1.401585
  _Istate_81 |  -.2739401   .1473784    -1.86   0.069    -.5701082    .0222279
  _Istate_82 |   .5138339   .1175595     4.37   0.000     .2775892    .7500785
  _Istate_83 |   .8129945   .2444497     3.33   0.002     .3217545    1.304234
  _Istate_84 |   .9094268   .3932251     2.31   0.025     .1192114    1.699642
  _Istate_85 |   2.310473   .0546112    42.31   0.000     2.200728    2.420219
  _Istate_86 |   1.123997   .3131162     3.59   0.001     .4947669    1.753228
  _Istate_87 |   .4325648   .0974499     4.44   0.000     .2367319    .6283977
  _Istate_88 |   .9403885   .0768063    12.24   0.000     .7860405    1.094736
  _Istate_91 |   .4845833   .4525448     1.07   0.290    -.4248395    1.394006
  _Istate_92 |   .2346419    .325608     0.72   0.475    -.4196918    .8889756
  _Istate_93 |  -.3488523   1.153926    -0.30   0.764    -2.667753    1.970048
  _Istate_94 |   1.244908   .3001405     4.15   0.000     .6417533    1.848063
  _Istate_95 |   1.109697   .0976589    11.36   0.000     .9134442     1.30595
  _IstaXt_12 |  -.0187431   .0040485    -4.63   0.000    -.0268789   -.0106073
  _IstaXt_13 |   .0083227   .0069874     1.19   0.239     -.005719    .0223643
  _IstaXt_14 |  -.0983835   .0066508   -14.79   0.000    -.1117489   -.0850181
  _IstaXt_15 |  -.0324332   .0042539    -7.62   0.000    -.0409817   -.0238848
  _IstaXt_16 |  -.1024173   .0057993   -17.66   0.000    -.1140714   -.0907633
  _IstaXt_21 |  -.1105754   .0055627   -19.88   0.000    -.1217541   -.0993966
  _IstaXt_22 |  -.1056132   .0049495   -21.34   0.000    -.1155596   -.0956669
  _IstaXt_23 |  -.0837594   .0053865   -15.55   0.000     -.094584   -.0729348
  _IstaXt_31 |  -.0457894    .004679    -9.79   0.000    -.0551922   -.0363866
  _IstaXt_32 |  -.0450403   .0051719    -8.71   0.000    -.0554336   -.0346471
  _IstaXt_33 |  -.0465902   .0030531   -15.26   0.000    -.0527256   -.0404548
  _IstaXt_34 |   -.032822   .0033291    -9.86   0.000    -.0395122   -.0261319
  _IstaXt_35 |  -.0835535   .0042143   -19.83   0.000    -.0920225   -.0750845
  _IstaXt_41 |  -.0974355    .006379   -15.27   0.000    -.1102545   -.0846165
  _IstaXt_42 |  -.0545897   .0078907    -6.92   0.000    -.0704467   -.0387327
  _IstaXt_43 |  -.0709812   .0070357   -10.09   0.000      -.08512   -.0568423
  _IstaXt_44 |  -.0864715   .0065663   -13.17   0.000    -.0996671   -.0732759
  _IstaXt_45 |   -.056082   .0074154    -7.56   0.000    -.0709838   -.0411803
  _IstaXt_46 |  -.0496411   .0069593    -7.13   0.000    -.0636264   -.0356558
  _IstaXt_47 |  -.0172395   .0037716    -4.57   0.000    -.0248188   -.0096602
  _IstaXt_51 |  -.0956677   .0054151   -17.67   0.000    -.1065498   -.0847856
  _IstaXt_52 |  -.1050324   .0048369   -21.71   0.000    -.1147526   -.0953122
  _IstaXt_54 |  -.0877642   .0070564   -12.44   0.000    -.1019446   -.0735838
  _IstaXt_55 |  -.0534054   .0089481    -5.97   0.000    -.0713873   -.0354235
  _IstaXt_56 |   -.028259   .0072272    -3.91   0.000    -.0427825   -.0137354
  _IstaXt_57 |  -.0162076   .0065948    -2.46   0.018    -.0294604   -.0029549
  _IstaXt_58 |  -.0635995    .003815   -16.67   0.000    -.0712661   -.0559329
  _IstaXt_59 |  -.0597205    .005808   -10.28   0.000    -.0713921   -.0480489
  _IstaXt_61 |  -.0442373   .0062834    -7.04   0.000    -.0568643   -.0316104
  _IstaXt_62 |  -.0496517   .0069314    -7.16   0.000    -.0635809   -.0357225
  _IstaXt_63 |  -.0098264   .0061168    -1.61   0.115    -.0221185    .0024657
  _IstaXt_64 |  -.0134189   .0067748    -1.98   0.053    -.0270334    .0001956
  _IstaXt_71 |   .0205622    .003624     5.67   0.000     .0132795    .0278448
  _IstaXt_72 |  -.0819782   .0050179   -16.34   0.000    -.0920619   -.0718944
  _IstaXt_73 |  -.0599106   .0061917    -9.68   0.000    -.0723533   -.0474679
  _IstaXt_74 |  -.0626162    .005654   -11.07   0.000    -.0739783   -.0512541
  _IstaXt_81 |   .0060401   .0050938     1.19   0.241    -.0041963    .0162765
  _IstaXt_82 |  -.0338454   .0063515    -5.33   0.000    -.0466093   -.0210815
  _IstaXt_83 |  -.0602427   .0084868    -7.10   0.000    -.0772977   -.0431878
  _IstaXt_84 |  -.0959587    .006515   -14.73   0.000    -.1090511   -.0828664
  _IstaXt_85 |  -.1599729   .0058954   -27.14   0.000    -.1718201   -.1481256
  _IstaXt_86 |  -.0787805   .0120373    -6.54   0.000    -.1029705   -.0545906
  _IstaXt_87 |  -.0016779   .0093752    -0.18   0.859     -.020518    .0171621
  _IstaXt_88 |  -.0650462   .0147368    -4.41   0.000    -.0946609   -.0354316
  _IstaXt_91 |  -.1155388   .0085208   -13.56   0.000     -.132662   -.0984155
  _IstaXt_92 |  -.0381792    .001213   -31.48   0.000    -.0406168   -.0357417
  _IstaXt_93 |  -.1050751   .0012762   -82.34   0.000    -.1076396   -.1025105
  _IstaXt_94 |  -.0896274   .0092468    -9.69   0.000    -.1082096   -.0710452
  _IstaXt_95 |  -.0767441   .0051753   -14.83   0.000    -.0871442    -.066344
       _cons |  -17.98663   4.540731    -3.96   0.000    -27.11157    -8.86169
------------------------------------------------------------------------------

. 
end of do-file


. exit, clear
