-------------------------------------------------------------------------------
       log:  C:\Documents and Settings\jwang\Desktop\HM-Union_table8.log
  log type:  text
 opened on:  29 May 2008, 17:39:57

. set matsize 450;

Current memory allocation

                    current                                 memory usage
    settable          value     description                 (1M = 1024k)
    --------------------------------------------------------------------
    set maxvar         5000     max. variables allowed           1.909M
    set memory           10M    max. data space                 10.000M
    set matsize         450     max. RHS vars in models          1.583M
                                                            -----------
                                                                13.492M

. set mem 20m;

Current memory allocation

                    current                                 memory usage
    settable          value     description                 (1M = 1024k)
    --------------------------------------------------------------------
    set maxvar         5000     max. variables allowed           1.909M
    set memory           20M    max. data space                 20.000M
    set matsize         450     max. RHS vars in models          1.583M
                                                            -----------
                                                                23.492M

. use eow-svcs.dta;
(EOW SVCs, CPS, rulings research data set)

. * Weights;
. egen empwt=mean(annemp) if year>=79 & year<=95, by(state);
(350 missing values generated)

. if "`1'"!="wt" {;
.  replace empwt=1;
(1200 real changes made)
.  };

. * Log total employment - from BLS employment & earnings;
. gen lnemp=ln(annemp);

. * Non-business-service sector employment from CBP;
. gen nonemp= stateemp-svcemp;
(200 missing values generated)

. gen lnnon=ln(nonemp);
(200 missing values generated)

. gen svcfrac= svcemp/nonemp;
(200 missing values generated)

. * Total business services employment from CBP;
. gen bizemp= svcemp+peremp;
(200 missing values generated)

. gen lnbiz = ln(biz);
(200 missing values generated)

. * Add Hirsch-Macpherson-Vroman union data;
. sort state year;

. merge state year using hm-union-6400.dta;

. drop if state==53;
(37 observations deleted)

. assert _merge==3 if year>=79 & year<=95;

. xi: reg unmem hm_union i.state i.year;
i.state           _Istate_11-95       (naturally coded; _Istate_11 omitted)
i.year            _Iyear_0-99         (naturally coded; _Iyear_0 omitted)

      Source |       SS       df       MS              Number of obs =    1150
-------------+------------------------------           F( 72,  1077) =  270.42
       Model |  6.92869717    72  .096231905           Prob > F      =  0.0000
    Residual |  .383262818  1077  .000355861           R-squared     =  0.9476
-------------+------------------------------           Adj R-squared =  0.9441
       Total |  7.31195999  1149   .00636376           Root MSE      =  .01886

------------------------------------------------------------------------------
       unmem |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    hm_union |   .0059263   .0003174    18.67   0.000     .0053036     .006549
  _Istate_12 |  -.0189819   .0057854    -3.28   0.001    -.0303339   -.0076299
  _Istate_13 |  -.0253323   .0057508    -4.41   0.000    -.0366163   -.0140483
  _Istate_14 |   .0041162   .0055997     0.74   0.462    -.0068713    .0151036
  _Istate_15 |   .0056622   .0056923     0.99   0.320     -.005507    .0168315
  _Istate_16 |   .0077014    .005653     1.36   0.173    -.0033907    .0187935
  _Istate_21 |   .0607174   .0068734     8.83   0.000     .0472305    .0742042
  _Istate_22 |   .0126345   .0060637     2.08   0.037     .0007366    .0245325
  _Istate_23 |   .0207175   .0060211     3.44   0.001      .008903    .0325319
  _Istate_31 |   .0316291    .005945     5.32   0.000     .0199639    .0432942
  _Istate_32 |   .0211553   .0058402     3.62   0.000     .0096959    .0326147
  _Istate_33 |   .0326274   .0058594     5.57   0.000     .0211303    .0441245
  _Istate_34 |    .045536   .0066713     6.83   0.000     .0324458    .0586263
  _Istate_35 |   .0195465   .0058306     3.35   0.001     .0081059    .0309871
  _Istate_41 |   .0177309   .0057858     3.06   0.002     .0063782    .0290836
  _Istate_42 |  -.0062048   .0055628    -1.12   0.265    -.0171201    .0047104
  _Istate_43 |   .0296049    .005564     5.32   0.000     .0186873    .0405225
  _Istate_44 |  -.0139145     .00582    -2.39   0.017    -.0253343   -.0024948
  _Istate_45 |  -.0307664   .0060112    -5.12   0.000    -.0425613   -.0189715
  _Istate_46 |  -.0123376   .0057238    -2.16   0.031    -.0235687   -.0011066
  _Istate_47 |  -.0174027   .0058107    -2.99   0.003    -.0288043   -.0060012
  _Istate_51 |   .0070497   .0055687     1.27   0.206     -.003877    .0179765
  _Istate_52 |   .0047485   .0055656     0.85   0.394    -.0061721    .0156691
  _Istate_54 |  -.0207061   .0060615    -3.42   0.001    -.0325997   -.0088124
  _Istate_55 |   .0203446   .0058846     3.46   0.001      .008798    .0318911
  _Istate_56 |  -.0239343   .0066698    -3.59   0.000    -.0370216    -.010847
  _Istate_57 |   -.034588   .0068581    -5.04   0.000    -.0480447   -.0211313
  _Istate_58 |  -.0124623   .0061721    -2.02   0.044    -.0245731   -.0003516
  _Istate_59 |  -.0142429   .0061841    -2.30   0.021    -.0263772   -.0021086
  _Istate_61 |   .0003731   .0055682     0.07   0.947    -.0105526    .0112989
  _Istate_62 |  -.0070388   .0056694    -1.24   0.215    -.0181631    .0040854
  _Istate_63 |  -.0009285   .0055927    -0.17   0.868    -.0119024    .0100454
  _Istate_64 |  -.0296423   .0061402    -4.83   0.000    -.0416904   -.0175942
  _Istate_71 |  -.0099045   .0060506    -1.64   0.102    -.0217768    .0019677
  _Istate_72 |  -.0114959   .0059874    -1.92   0.055    -.0232441    .0002524
  _Istate_73 |   -.006986   .0059727    -1.17   0.242    -.0187055    .0047335
  _Istate_74 |  -.0137284    .006322    -2.17   0.030    -.0261332   -.0013237
  _Istate_81 |   .0058391   .0056208     1.04   0.299      -.00519    .0168681
  _Istate_82 |  -.0172777   .0057428    -3.01   0.003    -.0285461   -.0060094
  _Istate_83 |  -.0063109   .0056786    -1.11   0.267    -.0174532    .0048315
  _Istate_84 |   .0051044   .0058314     0.88   0.382    -.0063378    .0165467
  _Istate_85 |  -.0209589   .0059742    -3.51   0.000    -.0326813   -.0092365
  _Istate_86 |  -.0080217   .0061268    -1.31   0.191    -.0200436    .0040002
  _Istate_87 |    -.00383   .0057672    -0.66   0.507    -.0151462    .0074863
  _Istate_88 |   .0300419   .0056876     5.28   0.000     .0188818     .041202
  _Istate_91 |   .0423689   .0062786     6.75   0.000     .0300493    .0546886
  _Istate_92 |   .0241643   .0057539     4.20   0.000      .012874    .0354545
  _Istate_93 |   .0275193   .0056423     4.88   0.000     .0164482    .0385904
  _Istate_94 |   .0348698   .0060775     5.74   0.000     .0229447    .0467949
  _Istate_95 |   .0405591   .0066843     6.07   0.000     .0274433    .0536748
   _Iyear_64 |  (dropped)
   _Iyear_65 |  (dropped)
   _Iyear_66 |  (dropped)
   _Iyear_67 |  (dropped)
   _Iyear_68 |  (dropped)
   _Iyear_69 |  (dropped)
   _Iyear_70 |  (dropped)
   _Iyear_71 |  (dropped)
   _Iyear_72 |  (dropped)
   _Iyear_73 |  (dropped)
   _Iyear_74 |  (dropped)
   _Iyear_75 |   .0118355   .0037743     3.14   0.002     .0044297    .0192414
   _Iyear_76 |  (dropped)
   _Iyear_77 |  -.0055655   .0037799    -1.47   0.141    -.0129822    .0018513
   _Iyear_78 |  -.0117473    .003797    -3.09   0.002    -.0191977   -.0042969
   _Iyear_79 |  -.0263327   .0037769    -6.97   0.000    -.0337436   -.0189217
   _Iyear_80 |  -.0329056   .0037892    -8.68   0.000    -.0403407   -.0254705
   _Iyear_81 |  -.0366085   .0037939    -9.65   0.000    -.0440527   -.0291643
   _Iyear_82 |  -.0330338   .0038642    -8.55   0.000    -.0406161   -.0254516
   _Iyear_83 |  -.0769453   .0039815   -19.33   0.000    -.0847577   -.0691329
   _Iyear_84 |  -.0757417   .0041056   -18.45   0.000    -.0837976   -.0676858
   _Iyear_85 |   -.076085   .0041789   -18.21   0.000    -.0842847   -.0678853
   _Iyear_86 |  -.0765918   .0042651   -17.96   0.000    -.0849607   -.0682229
   _Iyear_87 |  -.0762374   .0043076   -17.70   0.000    -.0846896   -.0677851
   _Iyear_88 |  -.0754102   .0043354   -17.39   0.000    -.0839171   -.0669033
   _Iyear_89 |   -.076104   .0044059   -17.27   0.000    -.0847491   -.0674589
   _Iyear_90 |  -.0771999    .004444   -17.37   0.000    -.0859199     -.06848
   _Iyear_91 |  -.0783448   .0044414   -17.64   0.000    -.0870595   -.0696301
   _Iyear_92 |  -.0791495   .0044916   -17.62   0.000    -.0879628   -.0703362
   _Iyear_93 |  -.0788976   .0045302   -17.42   0.000    -.0877867   -.0700085
   _Iyear_94 |  -.0791253   .0045643   -17.34   0.000    -.0880812   -.0701695
   _Iyear_95 |  -.0791671   .0046369   -17.07   0.000    -.0882654   -.0700687
   _Iyear_96 |  -.0794732   .0047076   -16.88   0.000    -.0887104    -.070236
   _Iyear_97 |  -.0800444   .0047995   -16.68   0.000    -.0894619    -.070627
   _Iyear_98 |  (dropped)
   _Iyear_99 |  (dropped)
       _cons |   .1062819   .0086856    12.24   0.000     .0892393    .1233246
------------------------------------------------------------------------------

. keep if year>=79 & year<=95;
(1000 observations deleted)

. * State dummies, year dummies, and state*time trends;
. gen t=year-78;

. gen t2=t^2;

. drop if state==98;
(0 observations deleted)

. xi i.state i.year i.state*t i.state*t2 i.region*i.year;
i.state           _Istate_11-95       (naturally coded; _Istate_11 omitted)
i.year            _Iyear_79-95        (naturally coded; _Iyear_79 omitted)
i.state*t         _IstaXt_#           (coded as above)
i.state*t2        _IstaXt2_#          (coded as above)
i.region          _Iregion_1-9        (naturally coded; _Iregion_1 omitted)
i.reg~n*i.year    _IregXyea_#_#       (coded as above)

. * Working sample;
. gen year1 = year>=79 & year<=95;

. keep if year1;
(0 observations deleted)

. gen year2 = ((int(year/2)*2 + 1)==year);

. gen year4 = (year==79 | year==83 | year==87 | year==91 | year==95);

. * Generate more aggregate demos;
. gen clp=clg+gtc;

. gen a1624=m1619+m2024+f1619+f2024;

. gen a2554=m2554+f2554;

. gen a55up=m5564+m65up+f5564+f65up;

. gen fem=f1619+f2024+f2554+f5564+f65up;

. gen white=rs_wm+rs_wf;

. gen black=rs_bm+rs_bf;

. gen other=rs_om+rs_of;

. gen married=marfem+marmale;

. * Modify union variable so that:
>   1 - We don't use interpolated data for 1979 & 1981
>   2 - Turn from fraction into percent so that coefficient will be friendly si
> ze;
. replace unmem=. if year==79 | year==81;
(100 real changes made, 100 to missing)

. replace unmem=unmem*100;
(750 real changes made)

. ****************************;
. ** Table 8: unionization
> ****************************;
. reg lnths hm_union _Iyear* _Istat* [aw=empwt] if year>=79, cluster(state);
(sum of wgt is   8.5000e+02)

Linear regression                                      Number of obs =     850
                                                       F( 16,    49) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.9689
                                                       Root MSE      =  .31395

                                 (Std. Err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    hm_union |   .0258456   .0114886     2.25   0.029     .0027583    .0489328
   _Iyear_80 |   .0014862   .0351637     0.04   0.966     -.069178    .0721504
   _Iyear_81 |   -.000181   .0530692    -0.00   0.997    -.1068276    .1064655
   _Iyear_82 |   .0109397   .0660126     0.17   0.869    -.1217176    .1435971
   _Iyear_83 |   .0889667   .0711295     1.25   0.217    -.0539734    .2319068
   _Iyear_84 |   .5011489   .0820622     6.11   0.000     .3362388     .666059
   _Iyear_85 |   .7457615   .0930079     8.02   0.000     .5588552    .9326679
   _Iyear_86 |    .873432   .0956358     9.13   0.000     .6812447    1.065619
   _Iyear_87 |   1.014587   .1158924     8.75   0.000     .7816921    1.247481
   _Iyear_88 |   1.349692   .1200281    11.24   0.000     1.108487    1.590897
   _Iyear_89 |   1.460145   .1275814    11.44   0.000      1.20376    1.716529
   _Iyear_90 |   1.514188   .1377086    11.00   0.000     1.237452    1.790924
   _Iyear_91 |   1.548778   .1442806    10.73   0.000     1.258836    1.838721
   _Iyear_92 |   1.705507    .152188    11.21   0.000     1.399674    2.011341
   _Iyear_93 |   1.989529   .1483405    13.41   0.000     1.691427     2.28763
   _Iyear_94 |   2.150744   .1548485    13.89   0.000     1.839564    2.461923
   _Iyear_95 |   2.271738   .1604764    14.16   0.000     1.949248    2.594227
  _Istate_12 |   .5930777     .06535     9.08   0.000     .4617519    .7244034
  _Istate_13 |  -1.231375   .0571052   -21.56   0.000    -1.346133   -1.116618
  _Istate_14 |    2.71928   .0232476   116.97   0.000     2.672562    2.765998
  _Istate_15 |   .6783454   .0352093    19.27   0.000     .6075897     .749101
  _Istate_16 |   1.969625   .0345335    57.04   0.000     1.900227    2.039023
  _Istate_21 |   3.417877   .1419859    24.07   0.000     3.132546    3.703208
  _Istate_22 |    2.55645   .0811638    31.50   0.000     2.393345    2.719555
  _Istate_23 |   2.743735    .072919    37.63   0.000     2.597198    2.890271
  _Istate_31 |   2.905075   .0670395    43.33   0.000     2.770355    3.039796
  _Istate_32 |   1.972035   .0550102    35.85   0.000     1.861487    2.082582
  _Istate_33 |   3.090085    .059876    51.61   0.000      2.96976     3.21041
  _Istate_34 |    2.63076   .1227256    21.44   0.000     2.384133    2.877386
  _Istate_35 |   2.096614    .055213    37.97   0.000     1.985659    2.207568
  _Istate_41 |   2.244062   .0530504    42.30   0.000     2.137453    2.350671
  _Istate_42 |    .944263   .0031763   297.29   0.000     .9378801     .950646
  _Istate_43 |   2.103546   .0018247  1152.84   0.000     2.099879    2.107212
  _Istate_44 |  -1.801501   .0642687   -28.03   0.000    -1.930654   -1.672348
  _Istate_45 |  -1.064503   .0833939   -12.76   0.000     -1.23209   -.8969169
  _Istate_46 |   .9352429   .0508879    18.38   0.000     .8329799    1.037506
  _Istate_47 |   1.030685   .0625792    16.47   0.000     .9049274    1.156443
  _Istate_51 |   .5748648   .0060146    95.58   0.000     .5627779    .5869517
  _Istate_52 |   2.101504   .0021626   971.77   0.000     2.097158     2.10585
  _Istate_54 |   2.455148   .0879894    27.90   0.000     2.278326    2.631969
  _Istate_55 |  -.1658623   .0643363    -2.58   0.013     -.295151   -.0365737
  _Istate_56 |   2.548267    .130227    19.57   0.000     2.286566    2.809968
  _Istate_57 |   1.897229   .1431348    13.25   0.000     1.609588    2.184869
  _Istate_58 |   2.769249   .0971803    28.50   0.000     2.573958     2.96454
  _Istate_59 |   3.689081   .0984643    37.47   0.000      3.49121    3.886952
  _Istate_61 |   1.460789    .013043   112.00   0.000     1.434578       1.487
  _Istate_62 |   2.178132   .0447381    48.69   0.000     2.088228    2.268037
  _Istate_63 |   1.338814   .0221663    60.40   0.000      1.29427    1.383359
  _Istate_64 |   .2671851   .0950853     2.81   0.007     .0761041    .4582661
  _Istate_71 |   1.158041   .0879894    13.16   0.000       .98122    1.334862
  _Istate_72 |   2.239697    .085151    26.30   0.000      2.06858    2.410815
  _Istate_73 |   1.807046   .0829884    21.77   0.000     1.640275    1.973818
  _Istate_74 |    3.83962   .1109666    34.60   0.000     3.616624    4.062616
  _Istate_81 |  -1.697689   .0270996   -62.65   0.000    -1.752148    -1.64323
  _Istate_82 |  -.4536372   .0543344    -8.35   0.000    -.5628263    -.344448
  _Istate_83 |  -1.624912   .0381828   -42.56   0.000    -1.701643   -1.548181
  _Istate_84 |   2.147823   .0647418    33.18   0.000     2.017719    2.277926
  _Istate_85 |   .4682463   .0797446     5.87   0.000     .3079936     .628499
  _Istate_86 |   2.264576   .0969099    23.37   0.000     2.069828    2.459323
  _Istate_87 |   .9859361   .0568349    17.35   0.000     .8717221     1.10015
  _Istate_88 |   .2431631   .0388586     6.26   0.000     .1650739    .3212524
  _Istate_91 |    1.54408   .0971127    15.90   0.000     1.348925    1.739235
  _Istate_92 |   1.360332   .0445353    30.55   0.000     1.270835    1.449829
  _Istate_93 |   4.279964   .0323033   132.49   0.000     4.215048     4.34488
  _Istate_94 |  -1.635138   .0791364   -20.66   0.000    -1.794169   -1.476108
  _Istate_95 |  -.0843064   .1357009    -0.62   0.537    -.3570077    .1883948
       _cons |   5.990129   .2845605    21.05   0.000     5.418283    6.561975
------------------------------------------------------------------------------

. reg lnths hm_union inagri-inmiss _Iyear* _Istat* _IstaXt_* [aw=empwt] if year
> >=79, cluster(state);
(sum of wgt is   8.5000e+02)

Linear regression                                      Number of obs =     850
                                                       F( 26,    49) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.9883
                                                       Root MSE      =  .20052

                                 (Std. Err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    hm_union |   .0164487   .0073545     2.24   0.030     .0016694    .0312281
      inagri |   8.519902   5.592959     1.52   0.134    -2.719569    19.75937
      inmine |    9.68892   5.353725     1.81   0.076    -1.069793    20.44763
      intran |   8.993688   5.249163     1.71   0.093    -1.554899    19.54228
      inmand |   10.89936    5.79494     1.88   0.066    -.7460069    22.54473
      inmann |   8.860668   5.931474     1.49   0.142    -3.059075    20.78041
      incons |   12.44251   5.417785     2.30   0.026     1.555059    23.32995
      inwtrd |    10.8145    5.72813     1.89   0.065    -.6966103    22.32561
      inrtrd |   8.704404   5.488448     1.59   0.119    -2.325045    19.73385
      infire |   10.65878   5.459057     1.95   0.057    -.3116075    21.62916
      insvcs |   8.486544   5.692151     1.49   0.142    -2.952261    19.92535
      ingovt |   6.912559   5.437165     1.27   0.210    -4.013832    17.83895
      inmiss |  (dropped)
   _Iyear_80 |   .0541837   .0373567     1.45   0.153    -.0208874    .1292547
   _Iyear_81 |   .1007274   .0568758     1.77   0.083    -.0135688    .2150236
   _Iyear_82 |   .1703754   .0775394     2.20   0.033      .014554    .3261967
   _Iyear_83 |   .2849256   .0799929     3.56   0.001     .1241739    .4456774
   _Iyear_84 |   .7069867   .0894279     7.91   0.000     .5272746    .8866988
   _Iyear_85 |   .9802029   .0985825     9.94   0.000     .7820939    1.178312
   _Iyear_86 |   1.145541   .1017239    11.26   0.000     .9411195    1.349963
   _Iyear_87 |   1.314806   .1191756    11.03   0.000     1.075314    1.554298
   _Iyear_88 |   1.685314   .1241674    13.57   0.000      1.43579    1.934838
   _Iyear_89 |   1.835902   .1308009    14.04   0.000     1.573047    2.098756
   _Iyear_90 |   1.923506   .1445121    13.31   0.000     1.633098    2.213914
   _Iyear_91 |   2.025457   .1545946    13.10   0.000     1.714787    2.336126
   _Iyear_92 |   2.224638   .1602069    13.89   0.000      1.90269    2.546585
   _Iyear_93 |    2.55117   .1721655    14.82   0.000      2.20519    2.897149
   _Iyear_94 |   2.730748   .1841022    14.83   0.000     2.360781    3.100715
   _Iyear_95 |   2.886632   .1972254    14.64   0.000     2.490293    3.282971
  _Istate_12 |   .4897115   .2376541     2.06   0.045     .0121277    .9672953
  _Istate_13 |   -1.82172   .2855818    -6.38   0.000    -2.395618   -1.247821
  _Istate_14 |   3.564121   .2514557    14.17   0.000     3.058802     4.06944
  _Istate_15 |   1.115663   .2682923     4.16   0.000     .5765096    1.654817
  _Istate_16 |     2.8721   .3318591     8.65   0.000     2.205204    3.538996
  _Istate_21 |   4.767987   .2534332    18.81   0.000     4.258694     5.27728
  _Istate_22 |   3.630604   .1707135    21.27   0.000     3.287542    3.973665
  _Istate_23 |   3.559675   .2431229    14.64   0.000     3.071101    4.048249
  _Istate_31 |    3.25954   .2995133    10.88   0.000     2.657645    3.861434
  _Istate_32 |    2.10552   .3619387     5.82   0.000     1.378177    2.832863
  _Istate_33 |   3.628686     .23375    15.52   0.000     3.158948    4.098424
  _Istate_34 |   3.018674    .391486     7.71   0.000     2.231953    3.805395
  _Istate_35 |   2.790953   .2260856    12.34   0.000     2.336617    3.245289
  _Istate_41 |   3.138113   .2302043    13.63   0.000     2.675501    3.600726
  _Istate_42 |   1.523617   .2952623     5.16   0.000     .9302648    2.116969
  _Istate_43 |   2.774302   .2220458    12.49   0.000     2.328084     3.22052
  _Istate_44 |  -1.385208   .4862345    -2.85   0.006    -2.362332   -.4080827
  _Istate_45 |  -.6063176   .4306217    -1.41   0.165    -1.471684     .259049
  _Istate_46 |   1.291369   .3266827     3.95   0.000     .6348756    1.947863
  _Istate_47 |   .9921913   .2610417     3.80   0.000     .4676085    1.516774
  _Istate_51 |   1.539525    .098898    15.57   0.000     1.340782    1.738268
  _Istate_52 |   3.082651   .3134909     9.83   0.000     2.452667    3.712634
  _Istate_54 |   3.091524   .2031365    15.22   0.000     2.683306    3.499742
  _Istate_55 |   .4618672   .4009487     1.15   0.255    -.3438694    1.267604
  _Istate_56 |   2.467702   .1287776    19.16   0.000     2.208914     2.72649
  _Istate_57 |   1.659898   .1187952    13.97   0.000      1.42117    1.898626
  _Istate_58 |   3.068113   .1594016    19.25   0.000     2.747784    3.388443
  _Istate_59 |    3.65304   .2821769    12.95   0.000     3.085984    4.220095
  _Istate_61 |   1.693427   .2763664     6.13   0.000     1.138048    2.248806
  _Istate_62 |   2.179299    .123211    17.69   0.000     1.931697    2.426901
  _Istate_63 |   1.283409   .1808917     7.09   0.000     .9198932    1.646924
  _Istate_64 |  -.6029355   .2065429    -2.92   0.005    -1.017999   -.1878719
  _Istate_71 |   .6930522   .2211604     3.13   0.003     .2486137    1.137491
  _Istate_72 |   3.071449   .2921229    10.51   0.000     2.484406    3.658492
  _Istate_73 |   2.387328   .3239029     7.37   0.000     1.736421    3.038235
  _Istate_74 |   4.011425   .2689493    14.92   0.000     3.470951    4.551899
  _Istate_81 |  -1.968094    .392109    -5.02   0.000    -2.756067   -1.180122
  _Istate_82 |   -.456101   .3011801    -1.51   0.136    -1.061345    .1491431
  _Istate_83 |  -1.310429   .4608297    -2.84   0.006    -2.236501   -.3843568
  _Istate_84 |    2.72169   .3004127     9.06   0.000     2.117988    3.325392
  _Istate_85 |   .7724948    .316823     2.44   0.018     .1358152    1.409174
  _Istate_86 |   2.434909   .3091125     7.88   0.000     1.813724    3.056093
  _Istate_87 |   .5396951   .2900841     1.86   0.069    -.0432506    1.122641
  _Istate_88 |   .5856954   .3269007     1.79   0.079    -.0712361    1.242627
  _Istate_91 |   2.044985   .3419223     5.98   0.000     1.357867    2.732104
  _Istate_92 |   1.585868   .2973238     5.33   0.000      .988374    2.183363
  _Istate_93 |   5.161263   .2636624    19.58   0.000     4.631413    5.691112
  _Istate_94 |  -1.100919   .3792562    -2.90   0.006    -1.863063   -.3387752
  _Istate_95 |   1.053686   .3109882     3.39   0.001     .4287322     1.67864
  _IstaXt_12 |  -.0200033   .0068007    -2.94   0.005    -.0336698   -.0063368
  _IstaXt_13 |   .0503811   .0144393     3.49   0.001     .0213642    .0793981
  _IstaXt_14 |  -.0979206   .0118317    -8.28   0.000    -.1216974   -.0741438
  _IstaXt_15 |   -.057423   .0091868    -6.25   0.000    -.0758847   -.0389614
  _IstaXt_16 |  -.1194441   .0125793    -9.50   0.000    -.1447231   -.0941652
  _IstaXt_21 |  -.1291453   .0103877   -12.43   0.000    -.1500203   -.1082704
  _IstaXt_22 |  -.1106859    .008917   -12.41   0.000    -.1286054   -.0927665
  _IstaXt_23 |  -.0868462    .013145    -6.61   0.000    -.1132621   -.0604302
  _IstaXt_31 |  -.0425498   .0128823    -3.30   0.002    -.0684377   -.0166619
  _IstaXt_32 |  -.0275027    .014395    -1.91   0.062    -.0564305    .0014251
  _IstaXt_33 |  -.0553454   .0113717    -4.87   0.000    -.0781978   -.0324931
  _IstaXt_34 |  -.0422023   .0139484    -3.03   0.004    -.0702326   -.0141721
  _IstaXt_35 |  -.0776167   .0125519    -6.18   0.000    -.1028406   -.0523928
  _IstaXt_41 |  -.0930288   .0120741    -7.70   0.000    -.1172927    -.068765
  _IstaXt_42 |   -.058585   .0153407    -3.82   0.000    -.0894133   -.0277567
  _IstaXt_43 |  -.0741327   .0115796    -6.40   0.000    -.0974029   -.0508625
  _IstaXt_44 |  -.0295262   .0179064    -1.65   0.106    -.0655105    .0064581
  _IstaXt_45 |  -.0402363    .016344    -2.46   0.017    -.0730808   -.0073919
  _IstaXt_46 |  -.0358849   .0158178    -2.27   0.028     -.067672   -.0040979
  _IstaXt_47 |   .0011029   .0124028     0.09   0.930    -.0238216    .0260273
  _IstaXt_51 |  -.0993526   .0085096   -11.68   0.000    -.1164533   -.0822519
  _IstaXt_52 |  -.0811874   .0111701    -7.27   0.000    -.1036345   -.0587403
  _IstaXt_54 |  -.0627249   .0066225    -9.47   0.000    -.0760334   -.0494164
  _IstaXt_55 |   -.057709   .0170684    -3.38   0.001    -.0920092   -.0234089
  _IstaXt_56 |  -.0062219   .0041978    -1.48   0.145    -.0146576    .0022139
  _IstaXt_57 |   .0149397   .0129345     1.16   0.254    -.0110531    .0409325
  _IstaXt_58 |  -.0357194   .0083121    -4.30   0.000    -.0524232   -.0190156
  _IstaXt_59 |   -.003045   .0109726    -0.28   0.783    -.0250952    .0190053
  _IstaXt_61 |  -.0244199   .0139326    -1.75   0.086    -.0524185    .0035786
  _IstaXt_62 |  -.0067256   .0076038    -0.88   0.381     -.022006    .0085547
  _IstaXt_63 |   .0057025   .0105493     0.54   0.591     -.015497    .0269021
  _IstaXt_64 |    .089394   .0099174     9.01   0.000     .0694644    .1093237
  _IstaXt_71 |   .0480397    .013639     3.52   0.001     .0206312    .0754482
  _IstaXt_72 |  -.0917504    .012002    -7.64   0.000    -.1158693   -.0676315
  _IstaXt_73 |  -.0688873   .0130552    -5.28   0.000    -.0951226    -.042652
  _IstaXt_74 |  -.0320756   .0112259    -2.86   0.006    -.0546348   -.0095164
  _IstaXt_81 |   .0500292   .0138614     3.61   0.001     .0221736    .0778849
  _IstaXt_82 |   .0012644   .0143482     0.09   0.930    -.0275695    .0300983
  _IstaXt_83 |  -.0271036    .014344    -1.89   0.065     -.055929    .0017217
  _IstaXt_84 |  -.0720824   .0129823    -5.55   0.000    -.0981714   -.0459934
  _IstaXt_85 |   -.020111   .0121776    -1.65   0.105    -.0445828    .0043608
  _IstaXt_86 |  -.0330435   .0118819    -2.78   0.008     -.056921    -.009166
  _IstaXt_87 |   .0497695   .0145925     3.41   0.001     .0204448    .0790942
  _IstaXt_88 |   -.018374   .0124842    -1.47   0.147    -.0434619    .0067138
  _IstaXt_91 |  -.0471216   .0137402    -3.43   0.001    -.0747336   -.0195097
  _IstaXt_92 |  -.0258711   .0133889    -1.93   0.059    -.0527771    .0010349
  _IstaXt_93 |  -.0957766   .0123476    -7.76   0.000      -.12059   -.0709632
  _IstaXt_94 |  -.0233274   .0114061    -2.05   0.046    -.0462487    -.000406
  _IstaXt_95 |  -.0902014    .008323   -10.84   0.000     -.106927   -.0734758
       _cons |  -3.385502   5.427123    -0.62   0.536    -14.29171     7.52071
------------------------------------------------------------------------------

. reg lnths hm_union mico mppa mgfa _Iyear* _Istat* _IstaXt_* [aw=empwt] if yea
> r>=79, cluster(state);
(sum of wgt is   8.5000e+02)

Linear regression                                      Number of obs =     850
                                                       F( 18,    49) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.9879
                                                       Root MSE      =  .20267

                                 (Std. Err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    hm_union |   .0155397   .0069794     2.23   0.031     .0015142    .0295653
        mico |   .1315508   .0620135     2.12   0.039       .00693    .2561716
        mppa |  -.0208485   .0578358    -0.36   0.720    -.1370739    .0953768
        mgfa |    -.07075   .0953774    -0.74   0.462    -.2624181     .120918
   _Iyear_80 |   .0389292   .0317624     1.23   0.226    -.0248997    .1027581
   _Iyear_81 |   .0770428   .0530901     1.45   0.153    -.0296458    .1837315
   _Iyear_82 |   .1136559   .0589587     1.93   0.060     -.004826    .2321379
   _Iyear_83 |   .1965441   .0558002     3.52   0.001     .0844093    .3086789
   _Iyear_84 |   .6343297   .0561879    11.29   0.000     .5214159    .7472436
   _Iyear_85 |    .904023   .0631564    14.31   0.000     .7771056     1.03094
   _Iyear_86 |   1.061909   .0638808    16.62   0.000     .9335359    1.190283
   _Iyear_87 |    1.23377   .0711231    17.35   0.000     1.090842    1.376697
   _Iyear_88 |   1.603863   .0555963    28.85   0.000     1.492138    1.715588
   _Iyear_89 |   1.758182   .0491684    35.76   0.000     1.659374    1.856989
   _Iyear_90 |   1.852958   .0566758    32.69   0.000     1.739063    1.966852
   _Iyear_91 |   1.930816   .0545082    35.42   0.000     1.821278    2.040354
   _Iyear_92 |   2.129013   .0537279    39.63   0.000     2.021043    2.236983
   _Iyear_93 |    2.45385   .0515843    47.57   0.000     2.350187    2.557512
   _Iyear_94 |   2.657604   .0509872    52.12   0.000     2.555141    2.760067
   _Iyear_95 |   2.817579   .0505607    55.73   0.000     2.715974    2.919185
  _Istate_12 |   1.018949   .1498726     6.80   0.000     .7177684    1.320129
  _Istate_13 |   -1.58192   .0706702   -22.38   0.000    -1.723937   -1.439903
  _Istate_14 |   3.934089   .1520885    25.87   0.000     3.628455    4.239722
  _Istate_15 |   1.399175   .0667993    20.95   0.000     1.264937    1.533413
  _Istate_16 |   3.321407   .1250969    26.55   0.000     3.070016    3.572799
  _Istate_21 |    4.78767   .0957096    50.02   0.000     4.595334    4.980005
  _Istate_22 |   3.786214   .1090922    34.71   0.000     3.566985    4.005443
  _Istate_23 |   3.750076   .1350839    27.76   0.000     3.478615    4.021537
  _Istate_31 |   3.445207   .0806592    42.71   0.000     3.283116    3.607298
  _Istate_32 |   2.446457   .1307886    18.71   0.000     2.183628    2.709287
  _Istate_33 |   3.675669   .0834236    44.06   0.000     3.508024    3.843315
  _Istate_34 |   3.179512    .130207    24.42   0.000     2.917851    3.441173
  _Istate_35 |   2.950854   .1064833    27.71   0.000     2.736868     3.16484
  _Istate_41 |   3.219491   .0549197    58.62   0.000     3.109126    3.329856
  _Istate_42 |   1.603472   .0822849    19.49   0.000     1.438114    1.768829
  _Istate_43 |    2.83809   .0334247    84.91   0.000      2.77092    2.905259
  _Istate_44 |  -1.453522   .0691848   -21.01   0.000    -1.592554    -1.31449
  _Istate_45 |  -.7649002   .0680743   -11.24   0.000    -.9017006   -.6280998
  _Istate_46 |    1.29653   .0520264    24.92   0.000     1.191979    1.401081
  _Istate_47 |    1.13376   .0835549    13.57   0.000       .96585     1.30167
  _Istate_51 |   1.453644   .0725432    20.04   0.000     1.307863    1.599425
  _Istate_52 |   2.962456   .0858713    34.50   0.000     2.789891    3.135021
  _Istate_54 |   3.011959   .0701288    42.95   0.000      2.87103    3.152888
  _Istate_55 |   .6529067    .145221     4.50   0.000     .3610743    .9447392
  _Istate_56 |    2.56463   .1040629    24.65   0.000     2.355508    2.773752
  _Istate_57 |   1.779839   .1232424    14.44   0.000     1.532174    2.027504
  _Istate_58 |   3.129182   .0860142    36.38   0.000      2.95633    3.302034
  _Istate_59 |   3.794287    .088832    42.71   0.000     3.615772    3.972801
  _Istate_61 |   1.749972   .0570023    30.70   0.000     1.635422    1.864523
  _Istate_62 |   2.197687   .0296842    74.04   0.000     2.138035     2.25734
  _Istate_63 |   1.361834   .0816199    16.69   0.000     1.197813    1.525856
  _Istate_64 |  -.4807987   .0795405    -6.04   0.000    -.6406413   -.3209562
  _Istate_71 |   .7549458   .0983822     7.67   0.000     .5572393    .9526522
  _Istate_72 |   3.202294   .0752659    42.55   0.000     3.051041    3.353546
  _Istate_73 |   2.432846   .0711116    34.21   0.000     2.289942     2.57575
  _Istate_74 |   4.278124   .0972893    43.97   0.000     4.082614    4.473635
  _Istate_81 |  -1.915084   .1135697   -16.86   0.000    -2.143311   -1.686857
  _Istate_82 |  -.5536928    .066688    -8.30   0.000    -.6877074   -.4196782
  _Istate_83 |  -1.192014     .06878   -17.33   0.000    -1.330232   -1.053795
  _Istate_84 |   2.913578    .060221    48.38   0.000     2.792559    3.034597
  _Istate_85 |   .5472976   .0395093    13.85   0.000     .4679007    .6266946
  _Istate_86 |   2.623732   .0740945    35.41   0.000     2.474834    2.772631
  _Istate_87 |   .6846095   .0723127     9.47   0.000     .5392917    .8299272
  _Istate_88 |   .4575742   .0674656     6.78   0.000      .321997    .5931514
  _Istate_91 |    2.07374   .0849877    24.40   0.000      1.90295    2.244529
  _Istate_92 |   1.679119   .0667105    25.17   0.000     1.545059    1.813178
  _Istate_93 |   5.272348   .1035491    50.92   0.000     5.064259    5.480438
  _Istate_94 |   -1.20912   .0871077   -13.88   0.000    -1.384169   -1.034071
  _Istate_95 |   .9561473   .1182928     8.08   0.000      .718429    1.193866
  _IstaXt_12 |  -.0359166   .0054704    -6.57   0.000    -.0469098   -.0249235
  _IstaXt_13 |   .0397791   .0058137     6.84   0.000      .028096    .0514623
  _IstaXt_14 |   -.114882   .0055023   -20.88   0.000    -.1259392   -.1038247
  _IstaXt_15 |   -.061966    .000544  -113.91   0.000    -.0630592   -.0608729
  _IstaXt_16 |  -.1320182    .005036   -26.21   0.000    -.1421384    -.121898
  _IstaXt_21 |  -.1354678   .0031934   -42.42   0.000    -.1418851   -.1290504
  _IstaXt_22 |  -.1212116   .0047953   -25.28   0.000     -.130848   -.1115752
  _IstaXt_23 |  -.0876145   .0044322   -19.77   0.000    -.0965214   -.0787076
  _IstaXt_31 |  -.0504807   .0043939   -11.49   0.000    -.0593106   -.0416508
  _IstaXt_32 |  -.0380357   .0061824    -6.15   0.000    -.0504598   -.0256116
  _IstaXt_33 |  -.0567805   .0013907   -40.83   0.000    -.0595753   -.0539857
  _IstaXt_34 |  -.0455639   .0032624   -13.97   0.000    -.0521199    -.039008
  _IstaXt_35 |  -.0820734   .0049735   -16.50   0.000    -.0920679   -.0720788
  _IstaXt_41 |  -.0982915   .0054179   -18.14   0.000    -.1091792   -.0874037
  _IstaXt_42 |  -.0651846   .0064926   -10.04   0.000    -.0782319   -.0521373
  _IstaXt_43 |  -.0704773   .0053135   -13.26   0.000    -.0811553   -.0597994
  _IstaXt_44 |  -.0395447    .005689    -6.95   0.000    -.0509772   -.0281122
  _IstaXt_45 |  -.0370719   .0053442    -6.94   0.000    -.0478114   -.0263324
  _IstaXt_46 |  -.0405495   .0053498    -7.58   0.000    -.0513003   -.0297988
  _IstaXt_47 |  -.0113471    .004525    -2.51   0.016    -.0204404   -.0022538
  _IstaXt_51 |  -.0805762   .0063908   -12.61   0.000    -.0934191   -.0677333
  _IstaXt_52 |  -.0882429   .0050339   -17.53   0.000    -.0983589    -.078127
  _IstaXt_54 |  -.0656998   .0050709   -12.96   0.000    -.0758902   -.0555094
  _IstaXt_55 |  -.0762266    .007604   -10.02   0.000    -.0915074   -.0609459
  _IstaXt_56 |   .0013176   .0047593     0.28   0.783    -.0082467    .0108818
  _IstaXt_57 |   .0071542   .0062405     1.15   0.257    -.0053865    .0196949
  _IstaXt_58 |  -.0350619   .0000924  -379.57   0.000    -.0352475   -.0348763
  _IstaXt_59 |  -.0068869   .0002651   -25.97   0.000    -.0074197   -.0063541
  _IstaXt_61 |  -.0282208   .0047865    -5.90   0.000    -.0378397    -.018602
  _IstaXt_62 |  -.0032772   .0042544    -0.77   0.445    -.0118268    .0052724
  _IstaXt_63 |   .0062731   .0097359     0.64   0.522    -.0132919    .0258382
  _IstaXt_64 |   .0894751   .0049826    17.96   0.000     .0794622    .0994881
  _IstaXt_71 |   .0424976    .004498     9.45   0.000     .0334586    .0515366
  _IstaXt_72 |  -.1008255   .0011632   -86.68   0.000    -.1031631   -.0984879
  _IstaXt_73 |  -.0754638   .0054365   -13.88   0.000    -.0863889   -.0645387
  _IstaXt_74 |  -.0529889   .0055761    -9.50   0.000    -.0641946   -.0417833
  _IstaXt_81 |   .0423886    .006936     6.11   0.000     .0284502     .056327
  _IstaXt_82 |   .0112551   .0083594     1.35   0.184    -.0055437    .0280539
  _IstaXt_83 |   -.044868   .0065882    -6.81   0.000    -.0581074   -.0316286
  _IstaXt_84 |  -.0865987    .005061   -17.11   0.000    -.0967691   -.0764283
  _IstaXt_85 |  -.0141005   .0034782    -4.05   0.000    -.0210903   -.0071108
  _IstaXt_86 |  -.0395407   .0090071    -4.39   0.000    -.0576412   -.0214403
  _IstaXt_87 |   .0347884   .0061381     5.67   0.000     .0224534    .0471234
  _IstaXt_88 |  -.0107142    .009346    -1.15   0.257    -.0294956    .0080673
  _IstaXt_91 |  -.0475365   .0045667   -10.41   0.000    -.0567137   -.0383592
  _IstaXt_92 |  -.0286653   .0004499   -63.72   0.000    -.0295694   -.0277612
  _IstaXt_93 |    -.09733   .0019584   -49.70   0.000    -.1012655   -.0933944
  _IstaXt_94 |  -.0286344    .007753    -3.69   0.001    -.0442145   -.0130542
  _IstaXt_95 |   -.094154   .0052801   -17.83   0.000    -.1047648   -.0835432
       _cons |   5.792327   .1660387    34.89   0.000      5.45866    6.125994
------------------------------------------------------------------------------

. reg lnths hm_union lnemp mico mppa mgfa _Iyear* _Istat* _IstaXt_* [aw=empwt] 
> if year>=79, cluster(state);
(sum of wgt is   8.5000e+02)

Linear regression                                      Number of obs =     850
                                                       F( 19,    49) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.9887
                                                       Root MSE      =  .19633

                                 (Std. Err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    hm_union |   .0130648   .0065011     2.01   0.050     2.71e-07    .0261293
       lnemp |   1.517054   .4228452     3.59   0.001      .667315    2.366793
        mico |   .1431992   .0568887     2.52   0.015     .0288771    .2575212
        mppa |  -.0146562   .0579742    -0.25   0.801    -.1311597    .1018473
        mgfa |  -.1138865   .0680821    -1.67   0.101    -.2507027    .0229297
   _Iyear_80 |   .0319614    .031715     1.01   0.319    -.0317722    .0956951
   _Iyear_81 |   .0572173   .0500308     1.14   0.258    -.0433233    .1577579
   _Iyear_82 |   .1179327   .0585115     2.02   0.049     .0003494     .235516
   _Iyear_83 |    .182727   .0524187     3.49   0.001     .0773876    .2880664
   _Iyear_84 |   .5491471   .0562365     9.76   0.000     .4361357    .6621585
   _Iyear_85 |   .7776896   .0687905    11.31   0.000     .6394498    .9159293
   _Iyear_86 |   .9098655   .0763589    11.92   0.000     .7564166    1.063314
   _Iyear_87 |    1.04566   .0902385    11.59   0.000     .8643191    1.227001
   _Iyear_88 |   1.365475   .0821754    16.62   0.000     1.200337    1.530612
   _Iyear_89 |   1.477457   .0886584    16.66   0.000     1.299292    1.655623
   _Iyear_90 |   1.544818   .0938053    16.47   0.000     1.356309    1.733327
   _Iyear_91 |   1.631754   .0944295    17.28   0.000     1.441991    1.821517
   _Iyear_92 |   1.811007   .0998746    18.13   0.000     1.610301    2.011712
   _Iyear_93 |   2.098815   .1063697    19.73   0.000     1.885057    2.312573
   _Iyear_94 |   2.254194   .1212583    18.59   0.000     2.010517    2.497872
   _Iyear_95 |    2.37349   .1316326    18.03   0.000     2.108965    2.638016
  _Istate_12 |   1.138339   .1316899     8.64   0.000     .8736983     1.40298
  _Istate_13 |  -.4620141   .3069414    -1.51   0.139    -1.078836    .1548077
  _Istate_14 |   1.124813    .852255     1.32   0.193    -.5878578    2.837483
  _Istate_15 |   1.435353   .0603271    23.79   0.000     1.314121    1.556585
  _Istate_16 |   1.440371   .5845009     2.46   0.017     .2657725    2.614969
  _Istate_21 |   .4417189   1.228153     0.36   0.721    -2.026348    2.909786
  _Istate_22 |   .7359976   .8904553     0.83   0.413    -1.053439    2.525434
  _Istate_23 |   .1064409   1.062384     0.10   0.921    -2.028499    2.241381
  _Istate_31 |  -.0426129   .9914135    -0.04   0.966    -2.034933    1.949707
  _Istate_32 |   .0670087   .7158417     0.09   0.926    -1.371529    1.505546
  _Istate_33 |   .0188458   1.044766     0.02   0.986    -2.080691    2.118382
  _Istate_34 |   .0563576   .9069656     0.06   0.951    -1.766258    1.878973
  _Istate_35 |   .7213126   .6630431     1.09   0.282    -.6111223    2.053748
  _Istate_41 |   1.118881   .5975733     1.87   0.067    -.0819873     2.31975
  _Istate_42 |   .2286602   .4091753     0.56   0.579    -.5936084    1.050929
  _Istate_43 |   .5256304   .6514487     0.81   0.424    -.7835048    1.834766
  _Istate_44 |  -.6331311   .2295408    -2.76   0.008    -1.094411   -.1718517
  _Istate_45 |   .1822862   .2672723     0.68   0.498    -.3548177    .7193901
  _Istate_46 |   .7467393   .1663284     4.49   0.000       .41249    1.080989
  _Istate_47 |  -.0648183   .3666248    -0.18   0.860    -.8015784    .6719419
  _Istate_51 |   2.216494   .2124754    10.43   0.000     1.789508    2.643479
  _Istate_52 |   .8466569   .6235261     1.36   0.181    -.4063658    2.099679
  _Istate_54 |   .5514074   .6975932     0.79   0.433    -.8504586    1.953273
  _Istate_55 |   .0832921   .2406009     0.35   0.731    -.4002136    .5667977
  _Istate_56 |  -.0406078   .7426806    -0.05   0.957     -1.53308    1.451865
  _Istate_57 |   .2277501   .4606955     0.49   0.623    -.6980521    1.153552
  _Istate_58 |   .6612137   .7053208     0.94   0.353    -.7561814    2.078609
  _Istate_59 |   .5653539   .9164667     0.62   0.540    -1.276355    2.407063
  _Istate_61 |   .2322216    .443147     0.52   0.603    -.6583156    1.122759
  _Istate_62 |   .0986702   .5931938     0.17   0.869    -1.093397    1.290738
  _Istate_63 |  -.3619494   .4991673    -0.73   0.472    -1.365064    .6411648
  _Istate_64 |  -1.447032   .2865527    -5.05   0.000    -2.022882   -.8711832
  _Istate_71 |  -.0547895   .2696711    -0.20   0.840    -.5967138    .4871348
  _Istate_72 |   1.184211     .58029     2.04   0.047     .0180748    2.350348
  _Istate_73 |   .8831057   .4319237     2.04   0.046     .0151225    1.751089
  _Istate_74 |   .2575929   1.138873     0.23   0.822    -2.031057    2.546243
  _Istate_81 |  -1.221933   .1801197    -6.78   0.000    -1.583897   -.8599691
  _Istate_82 |  -.0901683   .1300273    -0.69   0.491    -.3514679    .1711314
  _Istate_83 |  -.1573202   .2905366    -0.54   0.591    -.7411753     .426535
  _Istate_84 |   1.271474   .4703504     2.70   0.009     .3262692    2.216678
  _Istate_85 |   .4188979   .0558896     7.50   0.000     .3065835    .5312123
  _Istate_86 |   1.326586   .3745489     3.54   0.001     .5739019     2.07927
  _Istate_87 |   .3690013    .117805     3.13   0.003     .1322633    .6057392
  _Istate_88 |   .7246108   .0877674     8.26   0.000     .5482356    .9009861
  _Istate_91 |   .1648159   .5423393     0.30   0.762    -.9250557    1.254688
  _Istate_92 |   .4183585   .3779948     1.11   0.274    -.3412504    1.177967
  _Istate_93 |   .5210458    1.36552     0.38   0.704    -2.223069    3.265161
  _Istate_94 |   .0945354   .3564001     0.27   0.792    -.6216773    .8107481
  _Istate_95 |   1.119145   .1084537    10.32   0.000     .9011991    1.337091
  _IstaXt_12 |  -.0409919   .0049001    -8.37   0.000     -.050839   -.0311449
  _IstaXt_13 |   .0351463   .0056085     6.27   0.000     .0238755     .046417
  _IstaXt_14 |  -.0982445   .0075368   -13.04   0.000    -.1133903   -.0830987
  _IstaXt_15 |  -.0438212   .0051057    -8.58   0.000    -.0540815   -.0335609
  _IstaXt_16 |  -.1138926   .0070048   -16.26   0.000    -.1279692   -.0998159
  _IstaXt_21 |  -.1171523   .0065659   -17.84   0.000    -.1303469   -.1039577
  _IstaXt_22 |  -.1104225   .0057839   -19.09   0.000    -.1220457   -.0987994
  _IstaXt_23 |  -.0725129   .0060267   -12.03   0.000    -.0846239   -.0604018
  _IstaXt_31 |  -.0422159   .0052138    -8.10   0.000    -.0526934   -.0317384
  _IstaXt_32 |  -.0394236   .0056735    -6.95   0.000    -.0508249   -.0280224
  _IstaXt_33 |   -.044925   .0036035   -12.47   0.000    -.0521666   -.0376834
  _IstaXt_34 |  -.0407034   .0035008   -11.63   0.000    -.0477385   -.0336683
  _IstaXt_35 |  -.0846332   .0044743   -18.92   0.000    -.0936247   -.0756417
  _IstaXt_41 |  -.1022778   .0053066   -19.27   0.000    -.1129419   -.0916138
  _IstaXt_42 |  -.0611108   .0060865   -10.04   0.000    -.0733421   -.0488795
  _IstaXt_43 |  -.0683841   .0051603   -13.25   0.000    -.0787541   -.0580141
  _IstaXt_44 |  -.0301432   .0055603    -5.42   0.000    -.0413171   -.0189694
  _IstaXt_45 |   -.047074    .006091    -7.73   0.000    -.0593144   -.0348336
  _IstaXt_46 |  -.0409401   .0050324    -8.14   0.000    -.0510531   -.0308271
  _IstaXt_47 |   -.008041   .0042617    -1.89   0.065    -.0166053    .0005232
  _IstaXt_51 |  -.0881164   .0058218   -15.14   0.000    -.0998159    -.076417
  _IstaXt_52 |  -.0893513   .0045638   -19.58   0.000    -.0985226     -.08018
  _IstaXt_54 |  -.0773426   .0060747   -12.73   0.000    -.0895501   -.0651351
  _IstaXt_55 |  -.0564429   .0098963    -5.70   0.000    -.0763302   -.0365556
  _IstaXt_56 |  -.0094998     .00643    -1.48   0.146    -.0224215    .0034218
  _IstaXt_57 |  -.0013196    .006263    -0.21   0.834    -.0139056    .0112665
  _IstaXt_58 |  -.0514924   .0045765   -11.25   0.000    -.0606893   -.0422956
  _IstaXt_59 |  -.0318495   .0069734    -4.57   0.000     -.045863   -.0178359
  _IstaXt_61 |  -.0344815   .0048507    -7.11   0.000    -.0442294   -.0247337
  _IstaXt_62 |  -.0130981    .005383    -2.43   0.019    -.0239155   -.0022806
  _IstaXt_63 |   .0065959   .0072292     0.91   0.366    -.0079318    .0211236
  _IstaXt_64 |   .0909539   .0048489    18.76   0.000     .0812097    .1006981
  _IstaXt_71 |   .0331999   .0044564     7.45   0.000     .0242444    .0421554
  _IstaXt_72 |  -.0798031   .0060071   -13.28   0.000    -.0918749   -.0677313
  _IstaXt_73 |  -.0570923    .006032    -9.46   0.000    -.0692141   -.0449706
  _IstaXt_74 |  -.0537785   .0050812   -10.58   0.000    -.0639897   -.0435674
  _IstaXt_81 |   .0523963   .0061021     8.59   0.000     .0401336    .0646589
  _IstaXt_82 |   .0062572    .006843     0.91   0.365    -.0074943    .0200086
  _IstaXt_83 |  -.0162838   .0087796    -1.85   0.070     -.033927    .0013594
  _IstaXt_84 |   -.092906   .0052369   -17.74   0.000    -.1034299    -.082382
  _IstaXt_85 |  -.0227306   .0046923    -4.84   0.000    -.0321601    -.013301
  _IstaXt_86 |  -.0649935   .0117683    -5.52   0.000    -.0886427   -.0413443
  _IstaXt_87 |   .0136193   .0084212     1.62   0.112    -.0033038    .0305423
  _IstaXt_88 |   -.049984   .0150752    -3.32   0.002    -.0802788   -.0196893
  _IstaXt_91 |  -.0642647   .0074557    -8.62   0.000    -.0792475   -.0492819
  _IstaXt_92 |  -.0335456   .0014414   -23.27   0.000    -.0364422   -.0306489
  _IstaXt_93 |  -.0954466   .0014576   -65.48   0.000    -.0983758   -.0925174
  _IstaXt_94 |  -.0364769   .0075699    -4.82   0.000    -.0516891   -.0212647
  _IstaXt_95 |  -.1034372   .0052923   -19.54   0.000    -.1140725   -.0928019
       _cons |  -13.82916   5.463146    -2.53   0.015    -24.80776   -2.850557
------------------------------------------------------------------------------

. reg lnths hm_union lnemp mico mppa mgfa inagri-inmiss _Iyear* _Istat* _IstaXt
> _* [aw=empwt] if year>=79, cluster(state);
(sum of wgt is   8.5000e+02)

Linear regression                                      Number of obs =     850
                                                       F( 30,    49) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.9888
                                                       Root MSE      =  .19686

                                 (Std. Err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    hm_union |   .0136948   .0069095     1.98   0.053    -.0001903    .0275799
       lnemp |   1.058439   .6135944     1.72   0.091    -.1746248    2.291503
        mico |    .141895   .0556721     2.55   0.014     .0300178    .2537723
        mppa |   -.012795    .059006    -0.22   0.829     -.131372    .1057819
        mgfa |  -.1284213   .0694247    -1.85   0.070    -.2679355    .0110929
      inagri |   2.820033   5.168028     0.55   0.588    -7.565508    13.20557
      inmine |   2.981085   5.618259     0.53   0.598    -8.309228     14.2714
      intran |   3.212275   4.775264     0.67   0.504    -6.383977    12.80853
      inmand |   5.137488   5.418055     0.95   0.348    -5.750501    16.02548
      inmann |   3.952956   5.558593     0.71   0.480    -7.217455    15.12337
      incons |   5.345801   5.097252     1.05   0.299    -4.897511    15.58911
      inwtrd |   5.361817   5.653131     0.95   0.348    -5.998576    16.72221
      inrtrd |   3.710135   5.005389     0.74   0.462     -6.34857    13.76884
      infire |   4.615676   5.470988     0.84   0.403    -6.378686    15.61004
      insvcs |   3.475916   5.177819     0.67   0.505    -6.929302    13.88113
      ingovt |    2.46418   4.876553     0.51   0.616    -7.335619    12.26398
      inmiss |  (dropped)
   _Iyear_80 |   .0494907   .0351137     1.41   0.165     -.021073    .1200544
   _Iyear_81 |   .0863416   .0546091     1.58   0.120    -.0233996    .1960827
   _Iyear_82 |    .158102   .0753183     2.10   0.041     .0067443    .3094597
   _Iyear_83 |   .2343443   .0798209     2.94   0.005     .0739383    .3947503
   _Iyear_84 |   .6138958   .0975002     6.30   0.000     .4179619    .8098297
   _Iyear_85 |   .8550727   .1164124     7.35   0.000     .6211332    1.089012
   _Iyear_86 |   .9998325   .1291701     7.74   0.000     .7402554    1.259409
   _Iyear_87 |   1.145758   .1556411     7.36   0.000     .8329852     1.45853
   _Iyear_88 |   1.483091   .1662291     8.92   0.000     1.149041    1.817141
   _Iyear_89 |   1.612471   .1860886     8.67   0.000     1.238512     1.98643
   _Iyear_90 |    1.69073   .1976832     8.55   0.000     1.293471    2.087989
   _Iyear_91 |   1.793873   .2114343     8.48   0.000      1.36898    2.218767
   _Iyear_92 |   1.983192   .2247794     8.82   0.000     1.531481    2.434903
   _Iyear_93 |   2.289444   .2404763     9.52   0.000     1.806189    2.772699
   _Iyear_94 |   2.456968   .2639354     9.31   0.000      1.92657    2.987366
   _Iyear_95 |   2.590848   .2853736     9.08   0.000     2.017368    3.164328
  _Istate_12 |   .9655192   .2284443     4.23   0.000     .5064433    1.424595
  _Istate_13 |  -.8163339   .5238696    -1.56   0.126    -1.869089    .2364215
  _Istate_14 |    1.92308   1.211124     1.59   0.119     -.510766    4.356925
  _Istate_15 |   1.292903   .2649314     4.88   0.000     .7605037    1.825303
  _Istate_16 |   1.870044   .8073842     2.32   0.025     .2475449    3.492543
  _Istate_21 |   1.813718   1.774649     1.02   0.312    -1.752573     5.38001
  _Istate_22 |   1.656589   1.259608     1.32   0.195    -.8746887    4.187866
  _Istate_23 |   1.191969   1.486008     0.80   0.426    -1.794276    4.178214
  _Istate_31 |   .9445893   1.403442     0.67   0.504    -1.875733    3.764911
  _Istate_32 |   .6950829   1.014286     0.69   0.496    -1.343201    2.733367
  _Istate_33 |   1.112439   1.473801     0.75   0.454    -1.849275    4.074153
  _Istate_34 |   .9087574   1.289848     0.70   0.484     -1.68329    3.500805
  _Istate_35 |   1.402289    .955792     1.47   0.149    -.5184468    3.323025
  _Istate_41 |   1.828695   .8784928     2.08   0.043     .0632975    3.594092
  _Istate_42 |   .7768594   .6573557     1.18   0.243    -.5441464    2.097865
  _Istate_43 |   1.264562   .9476007     1.33   0.188    -.6397125    3.168837
  _Istate_44 |  -.5542992   .5550533    -1.00   0.323    -1.669721    .5611222
  _Istate_45 |   .2103248   .4978311     0.42   0.675    -.7901043    1.210754
  _Istate_46 |   1.082766   .4002459     2.71   0.009     .2784421    1.887091
  _Istate_47 |   .3704609   .5534829     0.67   0.506    -.7418047    1.482726
  _Istate_51 |    2.09056   .2818399     7.42   0.000     1.524182    2.656939
  _Istate_52 |   1.690096   1.007848     1.68   0.100    -.3352503    3.715443
  _Istate_54 |   1.428109   1.072805     1.33   0.189    -.7277729     3.58399
  _Istate_55 |   .4164236   .3824354     1.09   0.282    -.3521091    1.184956
  _Istate_56 |   .7481052   1.090544     0.69   0.496    -1.443425    2.939636
  _Istate_57 |   .7311221   .6832275     1.07   0.290     -.641875    2.104119
  _Istate_58 |   1.464795   1.038725     1.41   0.165    -.6226021    3.552191
  _Istate_59 |   1.597078   1.341352     1.19   0.240    -1.098471    4.292626
  _Istate_61 |   .8173635   .6350657     1.29   0.204    -.4588488    2.093576
  _Istate_62 |   .7740838   .8494501     0.91   0.367    -.9329501    2.481118
  _Istate_63 |   .2100368    .718692     0.29   0.771    -1.234229    1.654302
  _Istate_64 |  -1.093176   .4066504    -2.69   0.010     -1.91037   -.2759814
  _Istate_71 |   .2755398   .4272583     0.64   0.522    -.5830679    1.134147
  _Istate_72 |   1.888786   .8104491     2.33   0.024      .260128    3.517445
  _Istate_73 |   1.472102   .5784085     2.55   0.014     .3097469    2.634458
  _Istate_74 |   1.486389   1.560296     0.95   0.345    -1.649143    4.621921
  _Istate_81 |  -1.147504   .4634187    -2.48   0.017    -2.078779   -.2162294
  _Istate_82 |  -.0744499   .3448424    -0.22   0.830    -.7674365    .6185368
  _Istate_83 |  -.2086657   .7667533    -0.27   0.787    -1.749514    1.332183
  _Istate_84 |   1.820424   .6461366     2.82   0.007     .5219636    3.118884
  _Istate_85 |   .7259306   .3176748     2.29   0.027     .0875393    1.364322
  _Istate_86 |    1.73818   .5634072     3.09   0.003     .6059708    2.870389
  _Istate_87 |   .5478796   .3130034     1.75   0.086    -.0811243    1.176884
  _Istate_88 |   .8723151   .3498946     2.49   0.016     .1691756    1.575455
  _Istate_91 |   .7793832    .810203     0.96   0.341    -.8487807    2.407547
  _Istate_92 |   .7969719   .5727571     1.39   0.170    -.3540266     1.94797
  _Istate_93 |    1.97882   1.954606     1.01   0.316    -1.949107    5.906747
  _Istate_94 |   .0083552    .632549     0.01   0.990      -1.2628     1.27951
  _Istate_95 |   1.301713   .3324442     3.92   0.000     .6336409    1.969784
  _IstaXt_12 |  -.0385425   .0079721    -4.83   0.000    -.0545631   -.0225219
  _IstaXt_13 |   .0347954    .014461     2.41   0.020      .005735    .0638558
  _IstaXt_14 |   -.100056   .0139872    -7.15   0.000    -.1281642   -.0719478
  _IstaXt_15 |  -.0453812   .0110177    -4.12   0.000    -.0675222   -.0232403
  _IstaXt_16 |  -.1161889    .014769    -7.87   0.000    -.1458682   -.0865095
  _IstaXt_21 |  -.1233377   .0135678    -9.09   0.000    -.1506033   -.0960721
  _IstaXt_22 |  -.1130649   .0110464   -10.24   0.000    -.1352635   -.0908663
  _IstaXt_23 |  -.0775297   .0133694    -5.80   0.000    -.1043966   -.0506629
  _IstaXt_31 |  -.0451283   .0133344    -3.38   0.001    -.0719248   -.0183319
  _IstaXt_32 |  -.0414089   .0148513    -2.79   0.008    -.0712538    -.011564
  _IstaXt_33 |  -.0487883   .0116255    -4.20   0.000    -.0721506    -.025426
  _IstaXt_34 |  -.0424271   .0136748    -3.10   0.003    -.0699076   -.0149466
  _IstaXt_35 |  -.0889769   .0130847    -6.80   0.000    -.1152715   -.0626823
  _IstaXt_41 |  -.1050557   .0127406    -8.25   0.000     -.130659   -.0794525
  _IstaXt_42 |  -.0689476   .0153015    -4.51   0.000    -.0996972    -.038198
  _IstaXt_43 |  -.0711109   .0118371    -6.01   0.000    -.0948983   -.0473234
  _IstaXt_44 |   -.040913   .0175363    -2.33   0.024    -.0761536   -.0056724
  _IstaXt_45 |  -.0564954   .0151714    -3.72   0.001    -.0869834   -.0260073
  _IstaXt_46 |  -.0470499   .0156186    -3.01   0.004    -.0784366   -.0156631
  _IstaXt_47 |  -.0106167   .0127853    -0.83   0.410    -.0363097    .0150764
  _IstaXt_51 |  -.0926412   .0092931    -9.97   0.000    -.1113165    -.073966
  _IstaXt_52 |  -.0919738   .0117722    -7.81   0.000    -.1156309   -.0683166
  _IstaXt_54 |  -.0769066    .008421    -9.13   0.000    -.0938294   -.0599839
  _IstaXt_55 |  -.0665467   .0167955    -3.96   0.000    -.1002986   -.0327948
  _IstaXt_56 |  -.0109057   .0068808    -1.58   0.119    -.0247331    .0029218
  _IstaXt_57 |  -.0038069   .0133809    -0.28   0.777    -.0306968     .023083
  _IstaXt_58 |  -.0482204   .0103421    -4.66   0.000    -.0690036   -.0274373
  _IstaXt_59 |  -.0247196   .0156562    -1.58   0.121    -.0561819    .0067427
  _IstaXt_61 |  -.0399996   .0134936    -2.96   0.005     -.067116   -.0128833
  _IstaXt_62 |  -.0164705   .0083712    -1.97   0.055    -.0332931    .0003521
  _IstaXt_63 |   .0034256   .0137723     0.25   0.805    -.0242509    .0311021
  _IstaXt_64 |   .0867969   .0107923     8.04   0.000      .065109    .1084849
  _IstaXt_71 |   .0305087   .0130631     2.34   0.024     .0042576    .0567599
  _IstaXt_72 |  -.0840571   .0128297    -6.55   0.000    -.1098394   -.0582747
  _IstaXt_73 |  -.0644301   .0133268    -4.83   0.000    -.0912113    -.037649
  _IstaXt_74 |  -.0509041   .0132012    -3.86   0.000    -.0774329   -.0243753
  _IstaXt_81 |   .0439952    .015502     2.84   0.007     .0128428    .0751476
  _IstaXt_82 |   .0026659   .0167024     0.16   0.874    -.0308988    .0362305
  _IstaXt_83 |  -.0246808    .015772    -1.56   0.124    -.0563759    .0070143
  _IstaXt_84 |  -.0920071   .0161902    -5.68   0.000    -.1245426   -.0594717
  _IstaXt_85 |  -.0282962   .0127145    -2.23   0.031    -.0538471   -.0027454
  _IstaXt_86 |  -.0559529   .0218618    -2.56   0.014    -.0998858     -.01202
  _IstaXt_87 |   .0179303    .020285     0.88   0.381    -.0228339    .0586945
  _IstaXt_88 |  -.0445115   .0226044    -1.97   0.055    -.0899368    .0009139
  _IstaXt_91 |  -.0609174   .0163823    -3.72   0.001    -.0938389   -.0279959
  _IstaXt_92 |  -.0327143   .0133756    -2.45   0.018    -.0595937    -.005835
  _IstaXt_93 |  -.0952187     .01251    -7.61   0.000    -.1203585   -.0700788
  _IstaXt_94 |   -.034546   .0132623    -2.60   0.012    -.0611975   -.0078945
  _IstaXt_95 |  -.1055881   .0097529   -10.83   0.000    -.1251873   -.0859888
       _cons |  -11.85924   8.477645    -1.40   0.168     -28.8957    5.177227
------------------------------------------------------------------------------

. reg lnths lnemp hm_union mico mppa mgfa inagri-inmiss hsd smc clp black other
>  a1624 a55up fem marfem married _Iyear* _Istat* _IstaXt_* _IstaXt2_*  _Ir* [a
> w=empwt] if year>=79, cluster(state);
(sum of wgt is   8.5000e+02)

Linear regression                                      Number of obs =     850
                                                       F( 48,    49) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.9931
                                                       Root MSE      =  .17719

                                 (Std. Err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       lnemp |   1.355194   .8986744     1.51   0.138    -.4507598    3.161148
    hm_union |   .0144274   .0070443     2.05   0.046     .0002714    .0285834
        mico |    .128716   .0640149     2.01   0.050     .0000732    .2573588
        mppa |  -.0420149   .0641235    -0.66   0.515    -.1708758    .0868461
        mgfa |  -.0991282   .1158801    -0.86   0.396     -.331998    .1337416
      inagri |  -.9301303   6.127871    -0.15   0.880    -13.24455    11.38429
      inmine |  -.0961679   5.149726    -0.02   0.985    -10.44493    10.25259
      intran |   .5559617   5.669345     0.10   0.922    -10.83701    11.94894
      inmand |   .1734144   5.505516     0.03   0.975    -10.89033    11.23716
      inmann |  -4.391536   5.630053    -0.78   0.439    -15.70555     6.92248
      incons |   1.155758   5.236745     0.22   0.826    -9.367876    11.67939
      inwtrd |   .1977527   5.228865     0.04   0.970    -10.31005    10.70555
      inrtrd |  -.1306489   4.717934    -0.03   0.978    -9.611692    9.350395
      infire |   1.793447   5.093789     0.35   0.726    -8.442905     12.0298
      insvcs |  -1.307752   4.732878    -0.28   0.783    -10.81883    8.203323
      ingovt |  -3.438999    5.45959    -0.63   0.532    -14.41046    7.532457
      inmiss |  (dropped)
         hsd |   .0976176   1.262126     0.08   0.939     -2.43872    2.633955
         smc |   1.032442   1.100458     0.94   0.353    -1.179011    3.243896
         clp |  -1.353895   1.473845    -0.92   0.363    -4.315698    1.607908
       black |  -1.793338   1.106494    -1.62   0.111     -4.01692    .4302447
       other |   .2810708    2.58002     0.11   0.914    -4.903673    5.465815
       a1624 |   -.360107   1.449675    -0.25   0.805    -3.273339    2.553125
       a55up |  -2.252518   1.533722    -1.47   0.148    -5.334647     .829611
         fem |   2.174641   1.414302     1.54   0.131    -.6675057    5.016788
      marfem |  -2.541539   3.029622    -0.84   0.406    -8.629793    3.546715
     married |    2.20039   1.949702     1.13   0.265    -1.717683    6.118463
   _Iyear_80 |   .1923108   .2010092     0.96   0.343    -.2116323    .5962539
   _Iyear_81 |   .3146473   .2101153     1.50   0.141    -.1075952    .7368898
   _Iyear_82 |    .354882   .2463096     1.44   0.156    -.1400957    .8498597
   _Iyear_83 |    .274311   .2511212     1.09   0.280    -.2303359    .7789579
   _Iyear_84 |   .6825857   .2474507     2.76   0.008     .1853149    1.179856
   _Iyear_85 |   .9447642   .2495814     3.79   0.000     .4432116    1.446317
   _Iyear_86 |   1.012143   .2887991     3.50   0.001     .4317797    1.592507
   _Iyear_87 |   1.163113   .3093521     3.76   0.000     .5414463    1.784779
   _Iyear_88 |   1.337148   .3988926     3.35   0.002     .5355432    2.138753
   _Iyear_89 |   1.351402   .4170586     3.24   0.002     .5132909    2.189512
   _Iyear_90 |   1.365899   .4135902     3.30   0.002      .534758    2.197039
   _Iyear_91 |   1.392462   .4216606     3.30   0.002     .5451033    2.239821
   _Iyear_92 |   1.615107   .4277914     3.78   0.000     .7554284    2.474786
   _Iyear_93 |   2.070611   .4870791     4.25   0.000     1.091789    3.049434
   _Iyear_94 |   2.235896   .5025911     4.45   0.000     1.225902    3.245891
   _Iyear_95 |   2.260549   .5408379     4.18   0.000     1.173694    3.347403
  _Istate_12 |   1.370399   .2380043     5.76   0.000     .8921115    1.848687
  _Istate_13 |  -1.387544   .6874006    -2.02   0.049    -2.768928   -.0061612
  _Istate_14 |   1.210055   1.668255     0.73   0.472    -2.142429    4.562539
  _Istate_15 |   1.465906    .217925     6.73   0.000      1.02797    1.903843
  _Istate_16 |   1.257153   1.113098     1.13   0.264    -.9797019    3.494008
  _Istate_21 |  (dropped)
  _Istate_22 |   .2045851   .8010405     0.26   0.799    -1.405166    1.814336
  _Istate_23 |    -.54083   .4128788    -1.31   0.196    -1.370541     .288881
  _Istate_31 |  -.3696206   .2234204    -1.65   0.104    -.8186006    .0793595
  _Istate_32 |  -.7559395   .8107632    -0.93   0.356    -2.385229    .8733502
  _Istate_33 |  (dropped)
  _Istate_34 |  -.4732151   .3922548    -1.21   0.233    -1.261481    .3150504
  _Istate_35 |   .0912331   .8542833     0.11   0.915    -1.625514     1.80798
  _Istate_41 |   .4657836   .1829015     2.55   0.014     .0982294    .8333379
  _Istate_42 |  -.4436944   .5069769    -0.88   0.386    -1.462503    .5751138
  _Istate_43 |  (dropped)
  _Istate_44 |  -1.622503   1.789295    -0.91   0.369    -5.218226    1.973219
  _Istate_45 |  -1.568628   1.774374    -0.88   0.381    -5.134365     1.99711
  _Istate_46 |  -.1429979   .9966066    -0.14   0.886    -2.145754    1.859758
  _Istate_47 |  -1.065391   .6323738    -1.68   0.098    -2.336194    .2054118
  _Istate_51 |   2.522948   .9062615     2.78   0.008     .7017478    4.344149
  _Istate_52 |   1.448274   1.134253     1.28   0.208     -.831093    3.727641
  _Istate_54 |   1.393149   1.259272     1.11   0.274    -1.137453    3.923751
  _Istate_55 |  (dropped)
  _Istate_56 |    .678704   1.322439     0.51   0.610    -1.978836    3.336244
  _Istate_57 |   .8623377    .797578     1.08   0.285    -.7404554    2.465131
  _Istate_58 |   1.248798   1.226381     1.02   0.314    -1.215707    3.713303
  _Istate_59 |   1.197196   1.611991     0.74   0.461    -2.042222    4.436614
  _Istate_61 |   .2544839    .289168     0.88   0.383    -.3266209    .8355886
  _Istate_62 |   .2668224   .2646581     1.01   0.318    -.2650279    .7986727
  _Istate_63 |  (dropped)
  _Istate_64 |  -1.243783   .4227717    -2.94   0.005    -2.093374   -.3941914
  _Istate_71 |  -.5714003   .4650634    -1.23   0.225     -1.50598    .3631797
  _Istate_72 |   .8199756   .4144662     1.98   0.054    -.0129253    1.652877
  _Istate_73 |  (dropped)
  _Istate_74 |  -.0452269    1.41077    -0.03   0.975    -2.880274    2.789821
  _Istate_81 |  -1.316856   .2452757    -5.37   0.000    -1.809756   -.8239563
  _Istate_82 |  (dropped)
  _Istate_83 |  -.5086592   .5901981    -0.86   0.393    -1.694707    .6773883
  _Istate_84 |   1.655485   1.126565     1.47   0.148     -.608431    3.919402
  _Istate_85 |   .5077275   .4928529     1.03   0.308    -.4826974    1.498152
  _Istate_86 |   1.288758   .9116696     1.41   0.164    -.5433102    3.120827
  _Istate_87 |   .0046897   .4646512     0.01   0.992    -.9290618    .9384413
  _Istate_88 |   .7690385   .5169367     1.49   0.143    -.2697847    1.807862
  _Istate_91 |   .4192013   1.901398     0.22   0.826    -3.401801    4.240204
  _Istate_92 |   .6051566   1.633473     0.37   0.713    -2.677431    3.887744
  _Istate_93 |   1.210068   3.549363     0.34   0.735    -5.922644    8.342779
  _Istate_94 |  (dropped)
  _Istate_95 |    .928411   1.860144     0.50   0.620    -2.809689     4.66651
  _IstaXt_12 |  -.2321173   .0402621    -5.77   0.000    -.3130269   -.1512076
  _IstaXt_13 |   .1742297   .0321041     5.43   0.000      .109714    .2387453
  _IstaXt_14 |  -.0732391   .0292125    -2.51   0.016    -.1319437   -.0145344
  _IstaXt_15 |  -.1133509   .0190124    -5.96   0.000    -.1515578    -.075144
  _IstaXt_16 |  -.0551271   .0288896    -1.91   0.062     -.113183    .0029288
  _IstaXt_21 |  -.1341805   .0429613    -3.12   0.003    -.2205145   -.0478464
  _IstaXt_22 |  -.1084169   .0408527    -2.65   0.011    -.1905134   -.0263203
  _IstaXt_23 |  -.0707666   .0463674    -1.53   0.133    -.1639453    .0224121
  _IstaXt_31 |  -.0867792   .0608109    -1.43   0.160    -.2089833     .035425
  _IstaXt_32 |  -.0050072   .0561375    -0.09   0.929    -.1178198    .1078054
  _IstaXt_33 |  -.1258343   .0585657    -2.15   0.037    -.2435264   -.0081421
  _IstaXt_34 |   -.053583   .0602237    -0.89   0.378     -.174607    .0674411
  _IstaXt_35 |  -.0541229   .0561969    -0.96   0.340    -.1670549    .0588091
  _IstaXt_41 |  -.1537005   .0524373    -2.93   0.005    -.2590771   -.0483238
  _IstaXt_42 |  -.1255495    .060688    -2.07   0.044    -.2475065   -.0035924
  _IstaXt_43 |  -.1215769   .0545319    -2.23   0.030    -.2311629    -.011991
  _IstaXt_44 |  -.1148477   .0704108    -1.63   0.109    -.2563434    .0266481
  _IstaXt_45 |   .1453923   .0668711     2.17   0.035     .0110097    .2797748
  _IstaXt_46 |  -.0862685   .0586247    -1.47   0.148    -.2040792    .0315422
  _IstaXt_47 |   .0309042   .0554763     0.56   0.580    -.0805796    .1423881
  _IstaXt_51 |  -.0629451   .0449976    -1.40   0.168    -.1533712     .027481
  _IstaXt_52 |  -.0724805   .0458317    -1.58   0.120    -.1645827    .0196217
  _IstaXt_54 |  -.1365767   .0421367    -3.24   0.002    -.2212536   -.0518998
  _IstaXt_55 |  -.1093668   .0585726    -1.87   0.068    -.2270729    .0083392
  _IstaXt_56 |   .0128982   .0340712     0.38   0.707    -.0555705    .0813669
  _IstaXt_57 |   .0170082   .0407063     0.42   0.678    -.0647942    .0988106
  _IstaXt_58 |  -.0406363   .0423688    -0.96   0.342    -.1257796     .044507
  _IstaXt_59 |  -.1479302   .0375671    -3.94   0.000    -.2234241   -.0724363
  _IstaXt_61 |  -.0510619   .0552799    -0.92   0.360     -.162151    .0600272
  _IstaXt_62 |   .0603019   .0575488     1.05   0.300    -.0553468    .1759505
  _IstaXt_63 |   .0073067    .050643     0.14   0.886    -.0944642    .1090776
  _IstaXt_64 |    .157391    .067299     2.34   0.023     .0221485    .2926334
  _IstaXt_71 |  -.1267494   .0478731    -2.65   0.011    -.2229539   -.0305449
  _IstaXt_72 |  -.2417664   .0527026    -4.59   0.000    -.3476763   -.1358566
  _IstaXt_73 |  -.1844769   .0666008    -2.77   0.008    -.3183163   -.0506375
  _IstaXt_74 |  -.2571548   .0414348    -6.21   0.000    -.3404213   -.1738884
  _IstaXt_81 |   .0205931   .0591909     0.35   0.729    -.0983554    .1395416
  _IstaXt_82 |  -.0788954   .0534719    -1.48   0.146    -.1863511    .0285603
  _IstaXt_83 |  -.0116121    .055048    -0.21   0.834    -.1222353     .099011
  _IstaXt_84 |  -.1953304    .040016    -4.88   0.000    -.2757457   -.1149152
  _IstaXt_85 |  -.0469308   .0455576    -1.03   0.308    -.1384823    .0446207
  _IstaXt_86 |  -.0872708    .046836    -1.86   0.068    -.1813914    .0068497
  _IstaXt_87 |   .0729614   .0464258     1.57   0.122    -.0203347    .1662575
  _IstaXt_88 |  -.0676897   .0500544    -1.35   0.182    -.1682777    .0328983
  _IstaXt_91 |  -.1272808   .0432572    -2.94   0.005    -.2142095   -.0403521
  _IstaXt_92 |  -.1012118   .0543462    -1.86   0.069    -.2104247    .0080011
  _IstaXt_93 |  -.1596083   .0407663    -3.92   0.000    -.2415313   -.0776853
  _IstaXt_94 |  -.0649843   .0533084    -1.22   0.229    -.1721116     .042143
  _IstaXt_95 |  -.0998059   .0433385    -2.30   0.026     -.186898   -.0127138
 _IstaXt2_12 |   .0118722    .002064     5.75   0.000     .0077245    .0160199
 _IstaXt2_13 |  -.0057525   .0014569    -3.95   0.000    -.0086802   -.0028247
 _IstaXt2_14 |   .0001555   .0015658     0.10   0.921    -.0029912    .0033021
 _IstaXt2_15 |     .00501   .0010867     4.61   0.000     .0028263    .0071938
 _IstaXt2_16 |  -.0020503   .0014186    -1.45   0.155     -.004901    .0008004
 _IstaXt2_21 |   .0024435   .0015791     1.55   0.128    -.0007298    .0056168
 _IstaXt2_22 |   .0014219   .0016352     0.87   0.389    -.0018643     .004708
 _IstaXt2_23 |   .0010748   .0018225     0.59   0.558    -.0025876    .0047371
 _IstaXt2_31 |   .0028934   .0026823     1.08   0.286    -.0024969    .0082837
 _IstaXt2_32 |  -.0014196   .0027004    -0.53   0.601    -.0068464    .0040071
 _IstaXt2_33 |    .004864   .0026379     1.84   0.071    -.0004371    .0101651
 _IstaXt2_34 |   .0013268    .002799     0.47   0.638     -.004298    .0069516
 _IstaXt2_35 |   -.001269   .0026147    -0.49   0.630    -.0065234    .0039853
 _IstaXt2_41 |    .003372   .0023859     1.41   0.164    -.0014227    .0081667
 _IstaXt2_42 |   .0039219   .0026114     1.50   0.140     -.001326    .0091697
 _IstaXt2_43 |   .0032501   .0024148     1.35   0.185    -.0016026    .0081027
 _IstaXt2_44 |   .0050907   .0029231     1.74   0.088    -.0007835     .010965
 _IstaXt2_45 |  -.0105058    .003069    -3.42   0.001    -.0166732   -.0043384
 _IstaXt2_46 |   .0029291   .0024853     1.18   0.244    -.0020652    .0079234
 _IstaXt2_47 |  -.0014272   .0022948    -0.62   0.537    -.0060389    .0031845
 _IstaXt2_51 |  -.0010954   .0022215    -0.49   0.624    -.0055596    .0033688
 _IstaXt2_52 |   .0006128   .0020545     0.30   0.767    -.0035158    .0047415
 _IstaXt2_54 |   .0041233     .00185     2.23   0.030     .0004056    .0078411
 _IstaXt2_55 |   .0040276   .0024678     1.63   0.109    -.0009315    .0089867
 _IstaXt2_56 |  -.0005756    .001822    -0.32   0.753     -.004237    .0030857
 _IstaXt2_57 |   .0004334   .0015961     0.27   0.787     -.002774    .0036409
 _IstaXt2_58 |   .0010097   .0021184     0.48   0.636    -.0032474    .0052667
 _IstaXt2_59 |   .0075606   .0016255     4.65   0.000      .004294    .0108273
 _IstaXt2_61 |   .0014813   .0025107     0.59   0.558    -.0035642    .0065268
 _IstaXt2_62 |  -.0036397   .0025865    -1.41   0.166    -.0088376    .0015581
 _IstaXt2_63 |   .0006879   .0022138     0.31   0.757    -.0037609    .0051367
 _IstaXt2_64 |  -.0030737   .0031727    -0.97   0.337    -.0094495     .003302
 _IstaXt2_71 |   .0088825   .0025983     3.42   0.001      .003661     .014104
 _IstaXt2_72 |   .0089612   .0024873     3.60   0.001     .0039628    .0139595
 _IstaXt2_73 |   .0071971    .003455     2.08   0.042     .0002541    .0141401
 _IstaXt2_74 |   .0116239   .0021181     5.49   0.000     .0073674    .0158805
 _IstaXt2_81 |   .0021071   .0028787     0.73   0.468    -.0036777     .007892
 _IstaXt2_82 |   .0053215   .0025067     2.12   0.039      .000284     .010359
 _IstaXt2_83 |   .0000111   .0024061     0.00   0.996    -.0048241    .0048463
 _IstaXt2_84 |   .0067568   .0018532     3.65   0.001     .0030326    .0104811
 _IstaXt2_85 |   .0017554   .0021535     0.82   0.419    -.0025722     .006083
 _IstaXt2_86 |   .0019252   .0021432     0.90   0.373    -.0023817    .0062322
 _IstaXt2_87 |  -.0023963   .0022154    -1.08   0.285    -.0068484    .0020557
 _IstaXt2_88 |   .0013242   .0023648     0.56   0.578     -.003428    .0060765
 _IstaXt2_91 |   .0046209   .0022126     2.09   0.042     .0001745    .0090673
 _IstaXt2_92 |   .0046758   .0029047     1.61   0.114    -.0011614    .0105129
 _IstaXt2_93 |   .0044359   .0017681     2.51   0.015     .0008827     .007989
 _IstaXt2_94 |   .0024162   .0028963     0.83   0.408    -.0034041    .0082365
 _IstaXt2_95 |   .0008342   .0019718     0.42   0.674    -.0031283    .0047967
  _Iregion_2 |   .9391641   2.620614     0.36   0.722    -4.327157    6.205486
  _Iregion_3 |   .7312568   2.300231     0.32   0.752    -3.891231    5.353745
  _Iregion_4 |   1.007515    1.51133     0.67   0.508    -2.029617    4.044647
  _Iregion_5 |  -.1146342   .6238188    -0.18   0.855    -1.368245    1.138977
  _Iregion_6 |  -.0562757   1.167678    -0.05   0.962    -2.402813    2.290261
  _Iregion_7 |   1.027574   1.029787     1.00   0.323    -1.041861    3.097009
  _Iregion_8 |  -.2441096    .439904    -0.55   0.581     -1.12813    .6399106
  _Iregion_9 |  -.3115818   .8936452    -0.35   0.729    -2.107429    1.484265
_IregXy~2_80 |  -.0387648   .1750215    -0.22   0.826    -.3904836     .312954
_IregXy~2_81 |  -.0661448   .2017962    -0.33   0.744    -.4716695    .3393799
_IregXy~2_82 |  -.0303665   .1700143    -0.18   0.859     -.372023      .31129
_IregXy~2_83 |   .1383365   .1674499     0.83   0.413    -.1981666    .4748396
_IregXy~2_84 |   .0644042   .1600652     0.40   0.689    -.2572589    .3860674
_IregXy~2_85 |  -.0398111   .0848583    -0.47   0.641    -.2103403    .1307181
_IregXy~2_86 |  -.0460366   .1130992    -0.41   0.686     -.273318    .1812448
_IregXy~2_87 |  -.0362157   .1136402    -0.32   0.751    -.2645841    .1921528
_IregXy~2_88 |  (dropped)
_IregXy~2_89 |   .1091661   .0845757     1.29   0.203    -.0607952    .2791274
_IregXy~2_90 |   .0845883   .1121237     0.75   0.454    -.1407327    .3099094
_IregXy~2_91 |   .1134725   .1326843     0.86   0.397    -.1531667    .3801117
_IregXy~2_92 |   .0557649   .1564704     0.36   0.723     -.258674    .3702039
_IregXy~2_93 |  -.0664121   .1235307    -0.54   0.593    -.3146563    .1818321
_IregXy~2_94 |  -.1049317   .0915624    -1.15   0.257    -.2889333    .0790699
_IregXy~2_95 |  (dropped)
_IregXy~3_80 |   -.187085   .1951143    -0.96   0.342    -.5791817    .2050118
_IregXy~3_81 |  -.3740184   .2061195    -1.81   0.076     -.788231    .0401942
_IregXy~3_82 |  -.2800319   .1893471    -1.48   0.146    -.6605391    .1004754
_IregXy~3_83 |   -.146454   .1937673    -0.76   0.453     -.535844    .2429359
_IregXy~3_84 |  -.1076475   .1242103    -0.87   0.390    -.3572575    .1419626
_IregXy~3_85 |  -.0411556   .0796706    -0.52   0.608    -.2012597    .1189485
_IregXy~3_86 |  (dropped)
_IregXy~3_87 |   -.063167    .104758    -0.60   0.549    -.2736861    .1473521
_IregXy~3_88 |   .1077744   .1517948     0.71   0.481    -.1972686    .4128174
_IregXy~3_89 |    .142509   .1360503     1.05   0.300    -.1308944    .4159124
_IregXy~3_90 |   .1386719   .1765914     0.79   0.436    -.2162017    .4935455
_IregXy~3_91 |   .1838537   .2000317     0.92   0.363    -.2181251    .5858325
_IregXy~3_92 |   .1466356   .1798188     0.82   0.419    -.2147239    .5079951
_IregXy~3_93 |  -.0444983   .1246658    -0.36   0.723    -.2950236     .206027
_IregXy~3_94 |  -.0475505   .0905223    -0.53   0.602    -.2294619    .1343609
_IregXy~3_95 |  (dropped)
_IregXy~4_80 |  -.2221562   .2194121    -1.01   0.316    -.6630812    .2187688
_IregXy~4_81 |  -.5944032   .2268311    -2.62   0.012    -1.050237   -.1385689
_IregXy~4_82 |    -.42541   .2091801    -2.03   0.047    -.8457733   -.0050468
_IregXy~4_83 |   -.267813     .16382    -1.63   0.108    -.5970217    .0613957
_IregXy~4_84 |  -.3516696    .169149    -2.08   0.043    -.6915872   -.0117521
_IregXy~4_85 |  -.2857211   .1072517    -2.66   0.010    -.5012515   -.0701906
_IregXy~4_86 |  -.1612477   .1801607    -0.90   0.375    -.5232941    .2007987
_IregXy~4_87 |  -.1889578   .1338403    -1.41   0.164      -.45792    .0800043
_IregXy~4_88 |  (dropped)
_IregXy~4_89 |    .159584   .0911357     1.75   0.086      -.02356     .342728
_IregXy~4_90 |    .042211   .1348366     0.31   0.756    -.2287532    .3131753
_IregXy~4_91 |   .0758736   .2009917     0.38   0.707    -.3280343    .4797815
_IregXy~4_92 |   .0671458   .2053663     0.33   0.745    -.3455532    .4798448
_IregXy~4_93 |  -.1368523   .1576079    -0.87   0.389    -.4535773    .1798726
_IregXy~4_94 |  -.0802346   .1017992    -0.79   0.434    -.2848078    .1243386
_IregXy~4_95 |  (dropped)
_IregXy~5_80 |  -.1414786   .1885066    -0.75   0.457    -.5202968    .2373397
_IregXy~5_81 |   -.147423   .1777324    -0.83   0.411    -.5045895    .2097436
_IregXy~5_82 |  -.1029966   .1783769    -0.58   0.566    -.4614584    .2554652
_IregXy~5_83 |   .0158278   .1500032     0.11   0.916     -.285615    .3172705
_IregXy~5_84 |  -.0331893    .124022    -0.27   0.790    -.2824208    .2160423
_IregXy~5_85 |   .0282623    .112542     0.25   0.803    -.1978994    .2544239
_IregXy~5_86 |   .0065259   .1318575     0.05   0.961    -.2584517    .2715035
_IregXy~5_87 |  (dropped)
_IregXy~5_88 |    .082266    .137937     0.60   0.554    -.1949286    .3594607
_IregXy~5_89 |   .2087703   .1254533     1.66   0.102    -.0433377    .4608782
_IregXy~5_90 |   .2930055   .1062327     2.76   0.008     .0795228    .5064882
_IregXy~5_91 |   .2370367    .122772     1.93   0.059    -.0096829    .4837562
_IregXy~5_92 |    .204381   .1470584     1.39   0.171    -.0911438    .4999059
_IregXy~5_93 |  -.0906718   .1293954    -0.70   0.487    -.3507015    .1693579
_IregXy~5_94 |  -.1373415   .1014037    -1.35   0.182    -.3411199    .0664368
_IregXy~5_95 |  (dropped)
_IregXy~6_80 |  -.0849596   .2335485    -0.36   0.718    -.5542929    .3843737
_IregXy~6_81 |   -.304387   .2117761    -1.44   0.157    -.7299669     .121193
_IregXy~6_82 |  -.0781535   .1946894    -0.40   0.690    -.4693965    .3130895
_IregXy~6_83 |   .1957915   .1693685     1.16   0.253    -.1445672    .5361502
_IregXy~6_84 |   .0270848   .1847715     0.15   0.884    -.3442274    .3983971
_IregXy~6_85 |   -.032881   .1273762    -0.26   0.797    -.2888531    .2230911
_IregXy~6_86 |     .00193   .1671639     0.01   0.991    -.3339984    .3378585
_IregXy~6_87 |  -.1705672   .1355365    -1.26   0.214    -.4429379    .1018036
_IregXy~6_88 |  (dropped)
_IregXy~6_89 |   .0821467   .1062796     0.77   0.443    -.1314302    .2957236
_IregXy~6_90 |   .3103432   .1367511     2.27   0.028     .0355316    .5851549
_IregXy~6_91 |   .3824641   .1630349     2.35   0.023     .0548332     .710095
_IregXy~6_92 |   .3417304    .173971     1.96   0.055    -.0078774    .6913383
_IregXy~6_93 |   .0007979   .1588201     0.01   0.996     -.318363    .3199588
_IregXy~6_94 |  -.1122298   .1232827    -0.91   0.367    -.3599757    .1355161
_IregXy~6_95 |  (dropped)
_IregXy~7_80 |  -.1664022   .2149881    -0.77   0.443    -.5984369    .2656326
_IregXy~7_81 |   .0356967   .2206963     0.16   0.872     -.407809    .4792025
_IregXy~7_82 |  -.0192457   .2155203    -0.09   0.929    -.4523499    .4138586
_IregXy~7_83 |   .2293721   .1738117     1.32   0.193    -.1199156    .5786597
_IregXy~7_84 |  -.0035473    .171112    -0.02   0.984    -.3474098    .3403152
_IregXy~7_85 |  -.0406464   .1439519    -0.28   0.779    -.3299286    .2486357
_IregXy~7_86 |   .0839091   .1304897     0.64   0.523    -.1783198     .346138
_IregXy~7_87 |  (dropped)
_IregXy~7_88 |   .2987438   .1790556     1.67   0.102    -.0610819    .6585695
_IregXy~7_89 |   .5534362   .2250102     2.46   0.017     .1012613    1.005611
_IregXy~7_90 |   .6584397   .1966247     3.35   0.002     .2633075    1.053572
_IregXy~7_91 |   .8598061   .1680563     5.12   0.000     .5220844    1.197528
_IregXy~7_92 |   .6461858   .1595397     4.05   0.000     .3255788    .9667927
_IregXy~7_93 |   .2243322   .1301491     1.72   0.091    -.0372123    .4858766
_IregXy~7_94 |   .0311455   .0934223     0.33   0.740    -.1565936    .2188846
_IregXy~7_95 |  (dropped)
_IregXy~8_80 |  -.0919288   .1863844    -0.49   0.624    -.4664823    .2826247
_IregXy~8_81 |  -.2536555   .1992137    -1.27   0.209    -.6539904    .1466795
_IregXy~8_82 |  -.3221189   .2724686    -1.18   0.243    -.8696651    .2254274
_IregXy~8_83 |  -.0583763   .2087447    -0.28   0.781    -.4778644    .3611119
_IregXy~8_84 |  -.0118922   .1971588    -0.06   0.952    -.4080975    .3843132
_IregXy~8_85 |   -.187725   .2251065    -0.83   0.408    -.6400934    .2646434
_IregXy~8_86 |   -.113534   .2122002    -0.54   0.595    -.5399662    .3128982
_IregXy~8_87 |  (dropped)
_IregXy~8_88 |   .1762824    .193366     0.91   0.366    -.2123012    .5648659
_IregXy~8_89 |    .311723   .1962737     1.59   0.119    -.0827037    .7061497
_IregXy~8_90 |   .3005018   .1635694     1.84   0.072    -.0282032    .6292068
_IregXy~8_91 |   .4321267   .1237351     3.49   0.001     .1834717    .6807818
_IregXy~8_92 |   .2760851   .1284495     2.15   0.037     .0179562    .5342139
_IregXy~8_93 |   .1117416   .1313092     0.85   0.399    -.1521342    .3756173
_IregXy~8_94 |  -.0573559   .0995366    -0.58   0.567    -.2573822    .1426705
_IregXy~8_95 |  (dropped)
_IregXy~9_80 |  -.1120693   .2014355    -0.56   0.581    -.5168691    .2927305
_IregXy~9_81 |   .0545798   .1777676     0.31   0.760    -.3026577    .4118172
_IregXy~9_82 |  -.0769368   .1974009    -0.39   0.698    -.4736287    .3197552
_IregXy~9_83 |   .0864927   .1576511     0.55   0.586    -.2303191    .4033044
_IregXy~9_84 |   .0956823   .1333894     0.72   0.477    -.1723738    .3637384
_IregXy~9_85 |  -.0928174   .1181929    -0.79   0.436    -.3303349       .1447
_IregXy~9_86 |   .0861898   .1356516     0.64   0.528    -.1864124    .3587919
_IregXy~9_87 |  (dropped)
_IregXy~9_88 |   .1969721   .1354602     1.45   0.152    -.0752454    .4691896
_IregXy~9_89 |   .3635013   .1325674     2.74   0.009     .0970972    .6299054
_IregXy~9_90 |   .4771695   .1600949     2.98   0.004     .1554467    .7988922
_IregXy~9_91 |   .4719373   .1773352     2.66   0.010     .1155689    .8283057
_IregXy~9_92 |   .1735216   .1831976     0.95   0.348    -.1946277    .5416709
_IregXy~9_93 |   .0433436   .1549741     0.28   0.781    -.2680885    .3547756
_IregXy~9_94 |  -.0410112   .1281843    -0.32   0.750    -.2986072    .2165848
_IregXy~9_95 |  (dropped)
       _cons |  -12.15599    12.7671    -0.95   0.346    -37.81243    13.50045
------------------------------------------------------------------------------

. 
end of do-file


. exit, clear
