-------------------------------------------------------------------------------
       log:  C:\Documents and Settings\jwang\Desktop\JOLEcluster-runs_table5.lo
> g
  log type:  text
 opened on:  29 May 2008, 16:21:12

. set matsize 450;

Current memory allocation

                    current                                 memory usage
    settable          value     description                 (1M = 1024k)
    --------------------------------------------------------------------
    set maxvar         5000     max. variables allowed           1.909M
    set memory           10M    max. data space                 10.000M
    set matsize         450     max. RHS vars in models          1.583M
                                                            -----------
                                                                13.492M

. use autor-jole-2003.dta;
(EOW SVCs, CPS, rulings research data set)

. * Log total employment - from BLS employment & earnings;
. gen lnemp=ln(annemp);

. * Non-business-service sector employment from CBP;
. gen nonemp= stateemp-svcemp;
(200 missing values generated)

. gen lnnon=ln(nonemp);
(200 missing values generated)

. gen svcfrac= svcemp/nonemp;
(200 missing values generated)

. * Total business services employment from CBP;
. gen bizemp= svcemp+peremp;
(200 missing values generated)

. gen lnbiz = ln(biz);
(200 missing values generated)

. * State dummies, year dummies, and state*time trends;
. gen t=year-78;

. gen t2=t^2;

. drop if state==98;
(0 observations deleted)

. xi i.state i.year i.state*t i.state*t2 i.region*i.year;
i.state           _Istate_11-95       (naturally coded; _Istate_11 omitted)
i.year            _Iyear_74-97        (naturally coded; _Iyear_74 omitted)
i.state*t         _IstaXt_#           (coded as above)
i.state*t2        _IstaXt2_#          (coded as above)
i.region          _Iregion_1-9        (naturally coded; _Iregion_1 omitted)
i.reg~n*i.year    _IregXyea_#_#       (coded as above)

. drop _Iyear_77 - _Iyear_79;

. * Working sample;
. gen year1 = year>=79 & year<=95;

. keep if year1;
(350 observations deleted)

. gen year2 = ((int(year/2)*2 + 1)==year);

. gen year4 = (year==79 | year==83 | year==87 | year==91 | year==95);

. * Generate more aggregate demos;
. gen clp=clg+gtc;

. gen a1624=m1619+m2024+f1619+f2024;

. gen a2554=m2554+f2554;

. gen a55up=m5564+m65up+f5564+f65up;

. gen fem=f1619+f2024+f2554+f5564+f65up;

. gen white=rs_wm+rs_wf;

. gen black=rs_bm+rs_bf;

. gen other=rs_om+rs_of;

. gen married=marfem+marmale;

. * Modify union variable so that:
>   1 - We don't use interpolated data for 1979 & 1981
>   2 - Turn from fraction into percent so that coefficient will be friendly si
> ze;
. replace unmem=. if year==79 | year==81;
(100 real changes made, 100 to missing)

. replace unmem=unmem*100;
(750 real changes made)

. **************************************************;
. ** Table 5: Robustness tests & demographics
> **************************************************;
. reg lnths lnemp mico mppa mgfa _Iyear* _Istate* _IstaXt_* , cluster(state);

Linear regression                                      Number of obs =     850
                                                       F( 18,    49) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.9886
                                                       Root MSE      =    .197

                                 (Std. Err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       lnemp |   1.552175   .4265824     3.64   0.001     .6949259    2.409425
        mico |   .1483885   .0565741     2.62   0.012     .0346985    .2620785
        mppa |  -.0159165   .0584201    -0.27   0.786    -.1333161    .1014832
        mgfa |  -.1215924   .0676944    -1.80   0.079    -.2576295    .0144446
   _Iyear_75 |  (dropped)
   _Iyear_76 |  (dropped)
   _Iyear_80 |   .0272878   .0311347     0.88   0.385    -.0352797    .0898554
   _Iyear_81 |   .0527586   .0507965     1.04   0.304    -.0493207    .1548379
   _Iyear_82 |    .098579    .056933     1.73   0.090    -.0158321    .2129901
   _Iyear_83 |   .1467424   .0457983     3.20   0.002     .0547074    .2387774
   _Iyear_84 |   .4995771   .0500764     9.98   0.000     .3989448    .6002095
   _Iyear_85 |   .7221668   .0626319    11.53   0.000     .5963033    .8480303
   _Iyear_86 |    .848134   .0696016    12.19   0.000     .7082643    .9880036
   _Iyear_87 |    .981738   .0808204    12.15   0.000     .8193233    1.144153
   _Iyear_88 |   1.300224   .0742879    17.50   0.000     1.150937    1.449511
   _Iyear_89 |     1.4083   .0834977    16.87   0.000     1.240505    1.576095
   _Iyear_90 |   1.474514   .0881471    16.73   0.000     1.297376    1.651652
   _Iyear_91 |   1.564349   .0875575    17.87   0.000     1.388395    1.740302
   _Iyear_92 |   1.741926   .0915302    19.03   0.000     1.557989    1.925863
   _Iyear_93 |    2.02847   .0984447    20.61   0.000     1.830638    2.226302
   _Iyear_94 |   2.182846   .1150269    18.98   0.000     1.951691    2.414001
   _Iyear_95 |   2.298477   .1262662    18.20   0.000     2.044736    2.552218
   _Iyear_96 |  (dropped)
   _Iyear_97 |  (dropped)
  _Istate_12 |   1.083457   .1316414     8.23   0.000     .8189139    1.348001
  _Istate_13 |  -.4772617   .3096115    -1.54   0.130    -1.099449    .1449259
  _Istate_14 |   1.134763    .859855     1.32   0.193    -.5931805    2.862706
  _Istate_15 |   1.490099   .0557879    26.71   0.000     1.377989    1.602209
  _Istate_16 |   1.457255   .5895322     2.47   0.017      .272546    2.641965
  _Istate_21 |   .5082817   1.241392     0.41   0.684    -1.986389    3.002952
  _Istate_22 |   .7713858   .8996883     0.86   0.395    -1.036606    2.579377
  _Istate_23 |   .1853136   1.073112     0.17   0.864    -1.971185    2.341812
  _Istate_31 |    .003493   1.002023     0.00   0.997    -2.010148    2.017134
  _Istate_32 |   .1322444   .7227561     0.18   0.856    -1.320188    1.584677
  _Istate_33 |   .0267101   1.055374     0.03   0.980    -2.094143    2.147564
  _Istate_34 |   .1768112   .9148365     0.19   0.848    -1.661622    2.015244
  _Istate_35 |   .7668341   .6697262     1.14   0.258    -.5790312    2.112699
  _Istate_41 |   1.130104   .6041005     1.87   0.067     -.083881     2.34409
  _Istate_42 |   .2615506   .4136853     0.63   0.530    -.5697811    1.092882
  _Istate_43 |   .5145591   .6582109     0.78   0.438    -.8081653    1.837283
  _Istate_44 |  -.6754568   .2302998    -2.93   0.005    -1.138262   -.2126521
  _Istate_45 |   .1271791    .268149     0.47   0.637    -.4116866    .6660448
  _Istate_46 |   .7074624   .1658254     4.27   0.000     .3742238    1.040701
  _Istate_47 |  -.1665215   .3656073    -0.46   0.651    -.9012368    .5681939
  _Istate_51 |    2.29334   .2105234    10.89   0.000     1.870277    2.716403
  _Istate_52 |   .8409329   .6297856     1.34   0.188    -.4246687    2.106534
  _Istate_54 |   .4087296    .699499     0.58   0.562    -.9969662    1.814425
  _Istate_55 |   .2433693   .2294592     1.06   0.294    -.2177463    .7044849
  _Istate_56 |  -.2490392   .7404238    -0.34   0.738    -1.736977    1.238898
  _Istate_57 |   .0240181   .4506173     0.05   0.958    -.8815313    .9295676
  _Istate_58 |   .5005192   .7060692     0.71   0.482    -.9183801    1.919418
  _Istate_59 |   .3795917   .9191456     0.41   0.681    -1.467501    2.226684
  _Istate_61 |   .2306369   .4477076     0.52   0.609    -.6690651    1.130339
  _Istate_62 |   .0381321    .597991     0.06   0.949    -1.163576     1.23984
  _Istate_63 |  -.4054919   .5033639    -0.81   0.424     -1.41704    .6060557
  _Istate_64 |  -1.555093   .2821036    -5.51   0.000    -2.122001   -.9881843
  _Istate_71 |  -.1806665   .2637016    -0.69   0.496    -.7105946    .3492617
  _Istate_72 |   1.065513   .5817186     1.83   0.073    -.1034941    2.234521
  _Istate_73 |   .7316362   .4278855     1.71   0.094    -.1282319    1.591504
  _Istate_74 |   .0417029    1.14321     0.04   0.971    -2.255664     2.33907
  _Istate_81 |  -1.148305   .1775464    -6.47   0.000    -1.505098   -.7915118
  _Istate_82 |  -.0891155   .1313861    -0.68   0.501    -.3531457    .1749147
  _Istate_83 |  -.1513512   .2926497    -0.52   0.607    -.7394527    .4367503
  _Istate_84 |   1.175959   .4715283     2.49   0.016     .2283869     2.12353
  _Istate_85 |    .350707   .0443709     7.90   0.000     .2615403    .4398737
  _Istate_86 |   1.202467    .371372     3.24   0.002     .4561667    1.948766
  _Istate_87 |   .3442116   .1168712     2.95   0.005     .1093501    .5790731
  _Istate_88 |   .8116582   .0778584    10.42   0.000     .6551959    .9681204
  _Istate_91 |   .2779795   .5461137     0.51   0.613     -.819477    1.375436
  _Istate_92 |   .4334513   .3814879     1.14   0.261    -.3331772     1.20008
  _Istate_93 |   .4690474   1.377859     0.34   0.735    -2.299864    3.237959
  _Istate_94 |    .261382   .3497282     0.75   0.458    -.4414231    .9641871
  _Istate_95 |   1.283004   .0741126    17.31   0.000     1.134069    1.431939
  _IstaXt_12 |  -.0417348   .0048692    -8.57   0.000    -.0515198   -.0319498
  _IstaXt_13 |   .0327147   .0057041     5.74   0.000      .021252    .0441775
  _IstaXt_14 |  -.1020852   .0075025   -13.61   0.000    -.1171621   -.0870083
  _IstaXt_15 |  -.0444149   .0051564    -8.61   0.000    -.0547771   -.0340527
  _IstaXt_16 |  -.1148021   .0070468   -16.29   0.000    -.1289631   -.1006412
  _IstaXt_21 |  -.1173449   .0066201   -17.73   0.000    -.1306486   -.1040413
  _IstaXt_22 |  -.1114008   .0058247   -19.13   0.000    -.1231058   -.0996957
  _IstaXt_23 |  -.0804236   .0046884   -17.15   0.000    -.0898453    -.071002
  _IstaXt_31 |  -.0475708   .0046484   -10.23   0.000     -.056912   -.0382296
  _IstaXt_32 |  -.0454914   .0050393    -9.03   0.000    -.0556182   -.0353645
  _IstaXt_33 |  -.0472425   .0034723   -13.61   0.000    -.0542204   -.0402645
  _IstaXt_34 |  -.0463813   .0022564   -20.56   0.000    -.0509157   -.0418469
  _IstaXt_35 |     -.0882   .0042976   -20.52   0.000    -.0968362   -.0795637
  _IstaXt_41 |  -.1021265    .005316   -19.21   0.000    -.1128094   -.0914435
  _IstaXt_42 |  -.0682489   .0056728   -12.03   0.000    -.0796487    -.056849
  _IstaXt_43 |  -.0723698   .0049951   -14.49   0.000    -.0824077   -.0623318
  _IstaXt_44 |  -.0309541   .0056715    -5.46   0.000    -.0423515   -.0195568
  _IstaXt_45 |  -.0490351   .0061834    -7.93   0.000    -.0614611   -.0366091
  _IstaXt_46 |  -.0441898   .0051112    -8.65   0.000    -.0544611   -.0339186
  _IstaXt_47 |  -.0073214   .0041778    -1.75   0.086     -.015717    .0010742
  _IstaXt_51 |  -.0933885   .0053241   -17.54   0.000    -.1040876   -.0826894
  _IstaXt_52 |  -.0935809   .0043597   -21.47   0.000     -.102342   -.0848198
  _IstaXt_54 |   -.078928   .0061548   -12.82   0.000    -.0912966   -.0665594
  _IstaXt_55 |  -.0667619   .0088415    -7.55   0.000    -.0845296   -.0489941
  _IstaXt_56 |  -.0090278   .0064541    -1.40   0.168    -.0219978    .0039423
  _IstaXt_57 |  -.0005196    .006186    -0.08   0.933    -.0129508    .0119116
  _IstaXt_58 |   -.052045   .0046109   -11.29   0.000    -.0613109    -.042779
  _IstaXt_59 |  -.0319332   .0070457    -4.53   0.000    -.0460921   -.0177744
  _IstaXt_61 |  -.0397475   .0045447    -8.75   0.000    -.0488803   -.0306146
  _IstaXt_62 |   -.017452   .0052451    -3.33   0.002    -.0279924   -.0069116
  _IstaXt_63 |   .0048706   .0070337     0.69   0.492    -.0092641    .0190052
  _IstaXt_64 |   .0891768   .0049336    18.08   0.000     .0792624    .0990912
  _IstaXt_71 |   .0341265   .0043519     7.84   0.000     .0253811    .0428719
  _IstaXt_72 |  -.0814843   .0060273   -13.52   0.000    -.0935967   -.0693719
  _IstaXt_73 |  -.0540678   .0057497    -9.40   0.000    -.0656222   -.0425133
  _IstaXt_74 |  -.0538077   .0050856   -10.58   0.000    -.0640276   -.0435879
  _IstaXt_81 |   .0506569   .0060326     8.40   0.000      .038534    .0627799
  _IstaXt_82 |   .0008443   .0064474     0.13   0.896    -.0121121    .0138008
  _IstaXt_83 |  -.0180823   .0089322    -2.02   0.048    -.0360323   -.0001323
  _IstaXt_84 |  -.0945782   .0053276   -17.75   0.000    -.1052843   -.0838721
  _IstaXt_85 |  -.0255644   .0046679    -5.48   0.000    -.0349449   -.0161839
  _IstaXt_86 |  -.0666079   .0116891    -5.70   0.000     -.090098   -.0431178
  _IstaXt_87 |   .0082112   .0083156     0.99   0.328    -.0084996    .0249219
  _IstaXt_88 |  -.0543565   .0149813    -3.63   0.001    -.0844625   -.0242505
  _IstaXt_91 |  -.0698091   .0071529    -9.76   0.000    -.0841835   -.0554348
  _IstaXt_92 |  -.0328201   .0014172   -23.16   0.000     -.035668   -.0299722
  _IstaXt_93 |  -.0969261   .0013311   -72.82   0.000    -.0996011   -.0942512
  _IstaXt_94 |  -.0410979   .0074407    -5.52   0.000    -.0560505   -.0261454
  _IstaXt_95 |  -.1040146   .0053026   -19.62   0.000    -.1146705   -.0933587
       _cons |  -14.01156   5.517487    -2.54   0.014    -25.09936   -2.923754
------------------------------------------------------------------------------

. reg lnths lnemp mico mppa mgfa _Iyear* _Istate* _IstaXt* , cluster(state);

Linear regression                                      Number of obs =     850
                                                       F( 17,    49) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.9904
                                                       Root MSE      =  .18668

                                 (Std. Err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       lnemp |   1.587741   .6416428     2.47   0.017     .2983119    2.877171
        mico |   .1318159   .0627807     2.10   0.041     .0056534    .2579784
        mppa |  -.0042655   .0588444    -0.07   0.943    -.1225177    .1139867
        mgfa |  -.1279354   .0779712    -1.64   0.107    -.2846244    .0287535
   _Iyear_75 |  (dropped)
   _Iyear_76 |  (dropped)
   _Iyear_80 |   .0352451   .0382251     0.92   0.361    -.0415711    .1120614
   _Iyear_81 |   .0676843   .0537764     1.26   0.214    -.0403834     .175752
   _Iyear_82 |   .1208872   .0463886     2.61   0.012     .0276658    .2141085
   _Iyear_83 |   .1767116   .0491564     3.59   0.001     .0779281     .275495
   _Iyear_84 |   .5318194   .0706606     7.53   0.000     .3898215    .6738172
   _Iyear_85 |   .7568026   .0968292     7.82   0.000      .562217    .9513882
   _Iyear_86 |   .8839202    .114458     7.72   0.000     .6539081    1.113932
   _Iyear_87 |   1.018333   .1406488     7.24   0.000     .7356885    1.300977
   _Iyear_88 |   1.334991   .1412368     9.45   0.000     1.051165    1.618816
   _Iyear_89 |   1.438984   .1560714     9.22   0.000     1.125347    1.752622
   _Iyear_90 |   1.501177   .1604384     9.36   0.000     1.178764     1.82359
   _Iyear_91 |   1.586634   .1608923     9.86   0.000     1.263309    1.909959
   _Iyear_92 |   1.758105   .1586099    11.08   0.000     1.439366    2.076843
   _Iyear_93 |   2.036809   .1577527    12.91   0.000     1.719793    2.353825
   _Iyear_94 |   2.181987   .1715297    12.72   0.000     1.837285    2.526689
   _Iyear_95 |   2.287309   .1786029    12.81   0.000     1.928393    2.646225
   _Iyear_96 |  (dropped)
   _Iyear_97 |  (dropped)
  _Istate_12 |   1.602348   .1326374    12.08   0.000     1.335803    1.868893
  _Istate_13 |  -.8264469     .46668    -1.77   0.083    -1.764275    .1113816
  _Istate_14 |   1.043404   1.240491     0.84   0.404    -1.449457    3.536264
  _Istate_15 |    1.67714   .0610383    27.48   0.000     1.554479    1.799801
  _Istate_16 |   1.271239     .83847     1.52   0.136    -.4137291    2.956208
  _Istate_21 |   .4854568   1.866781     0.26   0.796    -3.265979    4.236893
  _Istate_22 |   .7596587   1.324633     0.57   0.569    -1.902291    3.421608
  _Istate_23 |    .114378   1.643928     0.07   0.945     -3.18922    3.417976
  _Istate_31 |    .011011   1.569415     0.01   0.994    -3.142847    3.164869
  _Istate_32 |  -.0812226   1.144169    -0.07   0.944    -2.380516    2.218071
  _Istate_33 |    .111203   1.642552     0.07   0.946    -3.189629    3.412035
  _Istate_34 |    .062608   1.429884     0.04   0.965    -2.810851    2.936067
  _Istate_35 |   .5630609   1.064405     0.53   0.599    -1.575942    2.702063
  _Istate_41 |    1.27216   .9723427     1.31   0.197    -.6818357    3.226156
  _Istate_42 |   .5240384    .699712     0.75   0.457    -.8820855    1.930162
  _Istate_43 |    .605966    1.04087     0.58   0.563    -1.485741    2.697673
  _Istate_44 |  -.3688062   .2750344    -1.34   0.186    -.9215086    .1838962
  _Istate_45 |  -.4205477    .305614    -1.38   0.175    -1.034702    .1936065
  _Istate_46 |   .9353195   .3315266     2.82   0.007     .2690919    1.601547
  _Istate_47 |  -.2730067     .59967    -0.46   0.651    -1.478089    .9320753
  _Istate_51 |   2.093809   .3012081     6.95   0.000     1.488508    2.699109
  _Istate_52 |   .6861281   .9322696     0.74   0.465    -1.187338    2.559594
  _Istate_54 |   .4557258   1.059334     0.43   0.669    -1.673085    2.584536
  _Istate_55 |   .2726284   .4171255     0.65   0.516    -.5656167    1.110874
  _Istate_56 |  -.5263621   1.134928    -0.46   0.645    -2.807085    1.754361
  _Istate_57 |  -.0622803   .6960783    -0.09   0.929    -1.461102    1.336541
  _Istate_58 |   .3799739   1.072671     0.35   0.725    -1.775639    2.535587
  _Istate_59 |    .521659   1.371946     0.38   0.705     -2.23537    3.278688
  _Istate_61 |   .1694017   .7403163     0.23   0.820     -1.31832    1.657123
  _Istate_62 |  -.2596253   .9560271    -0.27   0.787    -2.180834    1.661583
  _Istate_63 |  -.4888853   .8077765    -0.61   0.548    -2.112173    1.134402
  _Istate_64 |  -1.863289   .5054138    -3.69   0.001    -2.878957   -.8476224
  _Istate_71 |  -.0922613    .448945    -0.21   0.838    -.9944499    .8099274
  _Istate_72 |   1.180928   .9493443     1.24   0.219    -.7268504    3.088707
  _Istate_73 |   .7228018   .7149568     1.01   0.317    -.7139577    2.159561
  _Istate_74 |   .3254154   1.750001     0.19   0.853    -3.191343    3.842174
  _Istate_81 |   -1.09787    .165729    -6.62   0.000    -1.430915   -.7648246
  _Istate_82 |   .2343887   .0761419     3.08   0.003     .0813758    .3874016
  _Istate_83 |   -.234567   .3350577    -0.70   0.487    -.9078906    .4387567
  _Istate_84 |    1.37625      .7685     1.79   0.079    -.1681091    2.920608
  _Istate_85 |   .3893406   .1160135     3.36   0.002     .1562028    .6224783
  _Istate_86 |   1.114156   .5681042     1.96   0.056    -.0274919    2.255804
  _Istate_87 |   .1079894   .2552802     0.42   0.674    -.4050153    .6209941
  _Istate_88 |   .8740122   .0861056    10.15   0.000     .7009764    1.047048
  _Istate_91 |   .3756166   .8666507     0.43   0.667    -1.365983    2.117216
  _Istate_92 |   .4401025   .6541915     0.67   0.504    -.8745445     1.75475
  _Istate_93 |   .4249267   2.057882     0.21   0.837    -3.710542    4.560395
  _Istate_94 |   .1474148      .5392     0.27   0.786    -.9361481    1.230978
  _Istate_95 |   1.263222   .0889832    14.20   0.000     1.084403     1.44204
  _IstaXt_12 |  -.2122317   .0114141   -18.59   0.000    -.2351692   -.1892942
  _IstaXt_13 |    .146534   .0158701     9.23   0.000     .1146419    .1784261
  _IstaXt_14 |  -.1005863   .0071993   -13.97   0.000    -.1150538   -.0861189
  _IstaXt_15 |  -.1081716   .0057841   -18.70   0.000    -.1197951   -.0965481
  _IstaXt_16 |  -.0756249   .0144633    -5.23   0.000      -.10469   -.0465599
  _IstaXt_21 |   -.144648   .0168012    -8.61   0.000    -.1784113   -.1108847
  _IstaXt_22 |  -.1375546   .0143392    -9.59   0.000    -.1663703   -.1087388
  _IstaXt_23 |  -.0937815   .0220463    -4.25   0.000    -.1380852   -.0494778
  _IstaXt_31 |  -.0788425   .0300001    -2.63   0.011    -.1391299   -.0185551
  _IstaXt_32 |  -.0047379   .0273509    -0.17   0.863    -.0597017    .0502258
  _IstaXt_33 |  -.1044696   .0262735    -3.98   0.000    -.1572681   -.0516712
  _IstaXt_34 |  -.0381225   .0249057    -1.53   0.132    -.0881724    .0119274
  _IstaXt_35 |  -.0479221   .0273062    -1.75   0.086    -.1027959    .0069517
  _IstaXt_41 |  -.1662607   .0250271    -6.64   0.000    -.2165545   -.1159669
  _IstaXt_42 |  -.1671524   .0320548    -5.21   0.000    -.2315689   -.1027359
  _IstaXt_43 |  -.1217384   .0237721    -5.12   0.000    -.1695103   -.0739665
  _IstaXt_44 |  -.1253008   .0329439    -3.80   0.000    -.1915042   -.0590975
  _IstaXt_45 |   .1277606    .032228     3.96   0.000     .0629961    .1925252
  _IstaXt_46 |  -.1234507   .0295112    -4.18   0.000    -.1827556   -.0641458
  _IstaXt_47 |    .011344   .0279961     0.41   0.687    -.0449163    .0676044
  _IstaXt_51 |  -.0305121   .0090975    -3.35   0.002    -.0487943   -.0122299
  _IstaXt_52 |  -.0672346   .0165211    -4.07   0.000    -.1004349   -.0340342
  _IstaXt_54 |  -.1159931   .0191997    -6.04   0.000    -.1545763   -.0774098
  _IstaXt_55 |  -.0884284   .0454867    -1.94   0.058    -.1798374    .0029805
  _IstaXt_56 |   .0532629   .0113631     4.69   0.000     .0304279    .0760979
  _IstaXt_57 |    .009404   .0141207     0.67   0.509    -.0189725    .0377806
  _IstaXt_58 |  -.0378007   .0018651   -20.27   0.000    -.0415488   -.0340526
  _IstaXt_59 |  -.1064455    .012348    -8.62   0.000    -.1312597   -.0816313
  _IstaXt_61 |  -.0364698   .0284909    -1.28   0.207    -.0937244    .0207848
  _IstaXt_62 |   .0580716   .0220355     2.64   0.011     .0137896    .1023536
  _IstaXt_63 |   .0132541   .0202988     0.65   0.517    -.0275378    .0540461
  _IstaXt_64 |   .1741459   .0267203     6.52   0.000     .1204496    .2278423
  _IstaXt_71 |  -.0067017   .0250292    -0.27   0.790    -.0569996    .0435963
  _IstaXt_72 |  -.1375807   .0344057    -4.00   0.000    -.2067214   -.0684399
  _IstaXt_73 |  -.0614761   .0302263    -2.03   0.047     -.122218   -.0007341
  _IstaXt_74 |  -.1783998   .0212095    -8.41   0.000    -.2210218   -.1357778
  _IstaXt_81 |   .0326729   .0387384     0.84   0.403    -.0451748    .1105206
  _IstaXt_82 |  -.1017447   .0379334    -2.68   0.010    -.1779746   -.0255147
  _IstaXt_83 |   .0123393    .049414     0.25   0.804    -.0869618    .1116405
  _IstaXt_84 |  -.1739066   .0246836    -7.05   0.000    -.2235103    -.124303
  _IstaXt_85 |   -.041161   .0192268    -2.14   0.037    -.0797988   -.0025232
  _IstaXt_86 |   -.052348   .0239303    -2.19   0.034    -.1004377   -.0042583
  _IstaXt_87 |   .0754971   .0227883     3.31   0.002     .0297023     .121292
  _IstaXt_88 |  -.0772952   .0209629    -3.69   0.001    -.1194217   -.0351688
  _IstaXt_91 |   -.116371   .0141139    -8.25   0.000     -.144734   -.0880081
  _IstaXt_92 |  -.0480664   .0276364    -1.74   0.088    -.1036038     .007471
  _IstaXt_93 |  -.1204314   .0087671   -13.74   0.000    -.1380495   -.1028133
  _IstaXt_94 |   .0013081   .0235308     0.06   0.956    -.0459789    .0485951
  _IstaXt_95 |  -.1037487   .0169209    -6.13   0.000    -.1377526   -.0697448
 _IstaXt2_12 |   .0095481   .0005864    16.28   0.000     .0083697    .0107265
 _IstaXt2_13 |   -.006308   .0005061   -12.46   0.000    -.0073249    -.005291
 _IstaXt2_14 |   9.39e-06    .000569     0.02   0.987    -.0011341    .0011528
 _IstaXt2_15 |   .0035659   .0001096    32.55   0.000     .0033458    .0037861
 _IstaXt2_16 |  -.0020837   .0007277    -2.86   0.006    -.0035461   -.0006213
 _IstaXt2_21 |    .001589   .0006064     2.62   0.012     .0003704    .0028075
 _IstaXt2_22 |   .0015304   .0005787     2.64   0.011     .0003675    .0026933
 _IstaXt2_23 |   .0007638    .000833     0.92   0.364    -.0009102    .0024378
 _IstaXt2_31 |   .0018023   .0013456     1.34   0.187    -.0009019    .0045064
 _IstaXt2_32 |  -.0021819   .0013815    -1.58   0.121    -.0049582    .0005944
 _IstaXt2_33 |   .0031954   .0011695     2.73   0.009     .0008452    .0055455
 _IstaXt2_34 |  -.0004327   .0012105    -0.36   0.722    -.0028654    .0019999
 _IstaXt2_35 |  -.0021771   .0013762    -1.58   0.120    -.0049427    .0005886
 _IstaXt2_41 |   .0035625   .0012945     2.75   0.008     .0009611    .0061639
 _IstaXt2_42 |   .0055325   .0015385     3.60   0.001     .0024409    .0086242
 _IstaXt2_43 |   .0026741   .0013041     2.05   0.046     .0000535    .0052948
 _IstaXt2_44 |   .0052663   .0015087     3.49   0.001     .0022346    .0082981
 _IstaXt2_45 |  -.0098314    .001935    -5.08   0.000      -.01372   -.0059428
 _IstaXt2_46 |   .0044069   .0015248     2.89   0.006     .0013427    .0074711
 _IstaXt2_47 |  -.0009876   .0013051    -0.76   0.453    -.0036103    .0016351
 _IstaXt2_51 |  -.0034827   .0008181    -4.26   0.000    -.0051268   -.0018386
 _IstaXt2_52 |   -.001412   .0006383    -2.21   0.032    -.0026946   -.0001293
 _IstaXt2_54 |   .0020522   .0007466     2.75   0.008     .0005519    .0035526
 _IstaXt2_55 |   .0013123   .0018777     0.70   0.488    -.0024611    .0050857
 _IstaXt2_56 |  -.0035265   .0005855    -6.02   0.000    -.0047032   -.0023499
 _IstaXt2_57 |  -.0005318   .0005889    -0.90   0.371    -.0017151    .0006515
 _IstaXt2_58 |  -.0008127   .0002817    -2.89   0.006    -.0013788   -.0002466
 _IstaXt2_59 |   .0041069   .0000972    42.24   0.000     .0039115    .0043023
 _IstaXt2_61 |  -.0001701   .0014957    -0.11   0.910    -.0031758    .0028355
 _IstaXt2_62 |  -.0042201   .0012385    -3.41   0.001     -.006709   -.0017313
 _IstaXt2_63 |  -.0003562   .0010183    -0.35   0.728    -.0024024    .0016901
 _IstaXt2_64 |  -.0047745   .0015051    -3.17   0.003    -.0077991   -.0017499
 _IstaXt2_71 |    .002312   .0013933     1.66   0.103     -.000488     .005112
 _IstaXt2_72 |   .0031444   .0014078     2.23   0.030     .0003154    .0059734
 _IstaXt2_73 |   .0003779   .0014204     0.27   0.791    -.0024766    .0032323
 _IstaXt2_74 |   .0069494   .0009023     7.70   0.000     .0051361    .0087626
 _IstaXt2_81 |   .0010979   .0018413     0.60   0.554    -.0026023    .0047981
 _IstaXt2_82 |   .0057197   .0023525     2.43   0.019     .0009923    .0104472
 _IstaXt2_83 |  -.0016205   .0021485    -0.75   0.454    -.0059381     .002697
 _IstaXt2_84 |   .0044072    .001275     3.46   0.001      .001845    .0069694
 _IstaXt2_85 |   .0008335   .0011077     0.75   0.455    -.0013924    .0030594
 _IstaXt2_86 |  -.0007931   .0008026    -0.99   0.328    -.0024061    .0008198
 _IstaXt2_87 |  -.0037391   .0016547    -2.26   0.028    -.0070643   -.0004139
 _IstaXt2_88 |    .001263   .0016443     0.77   0.446    -.0020414    .0045673
 _IstaXt2_91 |   .0025193    .000932     2.70   0.009     .0006463    .0043923
 _IstaXt2_92 |   .0008405   .0016538     0.51   0.614    -.0024829    .0041638
 _IstaXt2_93 |   .0013145    .000401     3.28   0.002     .0005088    .0021203
 _IstaXt2_94 |  -.0023413   .0008819    -2.65   0.011    -.0041135    -.000569
 _IstaXt2_95 |   .0000205   .0007478     0.03   0.978    -.0014822    .0015232
       _cons |  -14.48029   8.277313    -1.75   0.086    -31.11417    2.153593
------------------------------------------------------------------------------

. reg lnths lnemp mico mppa mgfa _Iyear* _Istate* _IregX* _IstaXt_* , cluster(s
> tate);

Linear regression                                      Number of obs =     850
                                                       F( 44,    49) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.9910
                                                       Root MSE      =  .19133

                                 (Std. Err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       lnemp |   1.440841   .5754604     2.50   0.016     .2844105    2.597272
        mico |   .1740527   .0557389     3.12   0.003     .0620412    .2860642
        mppa |  -.0611463   .0654598    -0.93   0.355    -.1926928    .0704002
        mgfa |   -.064515   .0859911    -0.75   0.457    -.2373205    .1082905
   _Iyear_75 |  (dropped)
   _Iyear_76 |  (dropped)
   _Iyear_80 |   .1766495   .1674555     1.05   0.297    -.1598649     .513164
   _Iyear_81 |    .376478   .2141081     1.76   0.085    -.0537883    .8067444
   _Iyear_82 |   .4108648   .2109304     1.95   0.057    -.0130156    .8347452
   _Iyear_83 |   .3000061    .212038     1.41   0.163    -.1261003    .7261125
   _Iyear_84 |   .6773911   .1517176     4.46   0.000     .3725031     .982279
   _Iyear_85 |   .9978949   .1200389     8.31   0.000     .7566676    1.239122
   _Iyear_86 |   1.120636   .1494783     7.50   0.000     .8202477    1.421024
   _Iyear_87 |   1.298975    .211268     6.15   0.000     .8744164    1.723534
   _Iyear_88 |   1.498592   .2148441     6.98   0.000     1.066846    1.930337
   _Iyear_89 |   1.493287   .2092366     7.14   0.000     1.072811    1.913764
   _Iyear_90 |   1.553773    .204568     7.60   0.000     1.142678    1.964868
   _Iyear_91 |   1.594611   .1980003     8.05   0.000     1.196714    1.992507
   _Iyear_92 |   1.832194   .2056864     8.91   0.000     1.418852    2.245537
   _Iyear_93 |   2.321562   .2285624    10.16   0.000     1.862249    2.780876
   _Iyear_94 |   2.514627   .2135254    11.78   0.000     2.085531    2.943722
   _Iyear_95 |   2.564634    .224794    11.41   0.000     2.112894    3.016375
   _Iyear_96 |  (dropped)
   _Iyear_97 |  (dropped)
  _Istate_12 |   1.099649   .1378455     7.98   0.000     .8226378     1.37666
  _Istate_13 |  -.5396619   .4242839    -1.27   0.209    -1.392292    .3129685
  _Istate_14 |   1.357205   1.113843     1.22   0.229    -.8811465    3.595556
  _Istate_15 |   1.514647   .0552291    27.42   0.000      1.40366    1.625634
  _Istate_16 |   1.617662   .7580414     2.13   0.038     .0943203    3.141003
  _Istate_21 |  (dropped)
  _Istate_22 |   .2130526   .4724441     0.45   0.654    -.7363594    1.162465
  _Istate_23 |  -.3202792   .2430453    -1.32   0.194     -.808697    .1681386
  _Istate_31 |  -.0547489   .0953045    -0.57   0.568    -.2462705    .1367728
  _Istate_32 |   .0456302   .4727312     0.10   0.923    -.9043588    .9956191
  _Istate_33 |  (dropped)
  _Istate_34 |   .1185593   .1928502     0.61   0.542    -.2689877    .5061064
  _Istate_35 |   .6535017   .5381405     1.21   0.230    -.4279321    1.734936
  _Istate_41 |   .6051635   .0802859     7.54   0.000     .4438229    .7665041
  _Istate_42 |  -.2999217   .3473306    -0.86   0.392    -.9979087    .3980653
  _Istate_43 |  (dropped)
  _Istate_44 |  -1.416187   1.195298    -1.18   0.242    -3.818228    .9858553
  _Istate_45 |   -.629598   1.247766    -0.50   0.616    -3.137077    1.877881
  _Istate_46 |   .0638835   .6747802     0.09   0.925    -1.292138    1.419905
  _Istate_47 |  -.7227307   .4102337    -1.76   0.084    -1.547126    .1016647
  _Istate_51 |   1.641442   1.501472     1.09   0.280    -1.375879    4.658763
  _Istate_52 |   .4086253   .3962345     1.03   0.307    -.3876377    1.204888
  _Istate_54 |  -.0355756   .2943888    -0.12   0.904    -.6271722    .5560209
  _Istate_55 |  -.2777974   .9602347    -0.29   0.774    -2.207461    1.651866
  _Istate_56 |  -.6785408   .2415482    -2.81   0.007     -1.16395   -.1931315
  _Istate_57 |  -.4760455   .6394495    -0.74   0.460    -1.761067    .8089765
  _Istate_58 |   .0651857   .2881172     0.23   0.822    -.5138076    .6441789
  _Istate_59 |  (dropped)
  _Istate_61 |   .4180788   .6823662     0.61   0.543    -.9531874    1.789345
  _Istate_62 |   .2514851   .8815082     0.29   0.777    -1.519972    2.022942
  _Istate_63 |  -.1856514   .7572809    -0.25   0.807    -1.707464    1.336162
  _Istate_64 |  -1.425138   .4697118    -3.03   0.004    -2.369059   -.4812164
  _Istate_71 |   .2894524   .3797135     0.76   0.450    -.4736104    1.052515
  _Istate_72 |   1.591743    .801297     1.99   0.053    -.0185232     3.20201
  _Istate_73 |   1.167207    .599912     1.95   0.057    -.0383617    2.372775
  _Istate_74 |   .7182931   1.553279     0.46   0.646    -2.403139    3.839725
  _Istate_81 |  -1.091096   .1324957    -8.23   0.000    -1.357357   -.8248362
  _Istate_82 |  (dropped)
  _Istate_83 |   -.144502   .2623463    -0.55   0.584    -.6717067    .3827028
  _Istate_84 |   1.372495   .7793781     1.76   0.084    -.1937243    2.938713
  _Istate_85 |   .4330535   .2099929     2.06   0.045      .011057    .8550499
  _Istate_86 |   1.377544   .6465475     2.13   0.038     .0782582     2.67683
  _Istate_87 |    .441371   .2934537     1.50   0.139    -.1483462    1.031088
  _Istate_88 |    .889908   .0961295     9.26   0.000     .6967285    1.083088
  _Istate_91 |   .2517842   1.218436     0.21   0.837    -2.196755    2.700323
  _Istate_92 |   .4008908   .9934092     0.40   0.688     -1.59544    2.397221
  _Istate_93 |   .6515446   2.314359     0.28   0.779    -3.999334    5.302424
  _Istate_94 |  (dropped)
  _Istate_95 |   1.150256   .4562197     2.52   0.015      .233448    2.067064
_IregXy~2_75 |  (dropped)
_IregXy~2_76 |  (dropped)
_IregXy~2_77 |  (dropped)
_IregXy~2_78 |  (dropped)
_IregXy~2_79 |   .8823459   1.592526     0.55   0.582    -2.317955    4.082647
_IregXy~2_80 |   .7787778   1.470553     0.53   0.599     -2.17641    3.733966
_IregXy~2_81 |   .5826368   1.384687     0.42   0.676    -2.199995    3.365269
_IregXy~2_82 |   .5680331   1.282298     0.44   0.660    -2.008841    3.144907
_IregXy~2_83 |    .717393   1.186556     0.60   0.548    -1.667081    3.101867
_IregXy~2_84 |   .6343862   1.090467     0.58   0.563    -1.556989    2.825762
_IregXy~2_85 |   .3717702   .9879178     0.38   0.708    -1.613525    2.357065
_IregXy~2_86 |   .2990003     .86995     0.34   0.733     -1.44923     2.04723
_IregXy~2_87 |   .2979124   .7884119     0.38   0.707    -1.286461    1.882285
_IregXy~2_88 |   .2602388   .6844254     0.38   0.705    -1.115165    1.635643
_IregXy~2_89 |   .3103511   .5982096     0.52   0.606    -.8917961    1.512498
_IregXy~2_90 |   .2679596   .5354985     0.50   0.619    -.8081649    1.344084
_IregXy~2_91 |   .2727013   .4593519     0.59   0.555    -.6504008    1.195803
_IregXy~2_92 |    .189525   .3481361     0.54   0.589    -.5100808    .8891307
_IregXy~2_93 |   .0023101   .2183548     0.01   0.992    -.4364903    .4411106
_IregXy~2_94 |  -.0665525   .1148557    -0.58   0.565    -.2973636    .1642586
_IregXy~2_95 |  (dropped)
_IregXy~2_96 |  (dropped)
_IregXy~2_97 |  (dropped)
_IregXy~3_75 |  (dropped)
_IregXy~3_76 |  (dropped)
_IregXy~3_77 |  (dropped)
_IregXy~3_78 |  (dropped)
_IregXy~3_79 |   .5726881   1.409284     0.41   0.686    -2.259375    3.404751
_IregXy~3_80 |   .3415929   1.273886     0.27   0.790    -2.218376    2.901562
_IregXy~3_81 |    .038485   1.196493     0.03   0.974    -2.365958    2.442928
_IregXy~3_82 |   .0683108   1.087465     0.06   0.950    -2.117032    2.253654
_IregXy~3_83 |   .2032466   .9918663     0.20   0.838    -1.789983    2.196477
_IregXy~3_84 |   .2687199   .9025768     0.30   0.767    -1.545076    2.082516
_IregXy~3_85 |   .2240949    .816791     0.27   0.785    -1.417308    1.865498
_IregXy~3_86 |   .2219496   .7099354     0.31   0.756    -1.204719    1.648618
_IregXy~3_87 |   .0999108   .6382098     0.16   0.876     -1.18262    1.382441
_IregXy~3_88 |   .2213917   .5526259     0.40   0.690    -.8891516    1.331935
_IregXy~3_89 |   .2509869   .4829838     0.52   0.606    -.7196054    1.221579
_IregXy~3_90 |   .2109658   .4416327     0.48   0.635    -.6765284     1.09846
_IregXy~3_91 |   .2195027   .3901265     0.56   0.576    -.5644859    1.003491
_IregXy~3_92 |   .1673399   .2970568     0.56   0.576    -.4296181     .764298
_IregXy~3_93 |  -.0441009   .1870947    -0.24   0.815    -.4200817      .33188
_IregXy~3_94 |  -.0606361   .1027939    -0.59   0.558    -.2672082    .1459359
_IregXy~3_95 |  (dropped)
_IregXy~3_96 |  (dropped)
_IregXy~3_97 |  (dropped)
_IregXy~4_75 |  (dropped)
_IregXy~4_76 |  (dropped)
_IregXy~4_77 |  (dropped)
_IregXy~4_78 |  (dropped)
_IregXy~4_79 |   1.017558   .9116163     1.12   0.270    -.8144037    2.849519
_IregXy~4_80 |   .7408438    .810299     0.91   0.365    -.8875131    2.369201
_IregXy~4_81 |   .2627558   .7183827     0.37   0.716    -1.180888      1.7064
_IregXy~4_82 |   .3624381    .668947     0.54   0.590    -.9818613    1.706737
_IregXy~4_83 |   .4341106   .6353645     0.68   0.498    -.8427021    1.710923
_IregXy~4_84 |   .3609344   .5641987     0.64   0.525    -.7728653    1.494734
_IregXy~4_85 |    .344822   .5420123     0.64   0.528    -.7443924    1.434036
_IregXy~4_86 |   .3301676   .4774003     0.69   0.492    -.6292043    1.289539
_IregXy~4_87 |   .2623742   .4134597     0.63   0.529    -.5685041    1.093252
_IregXy~4_88 |   .3530226   .3522059     1.00   0.321    -.3547616    1.060807
_IregXy~4_89 |   .4671735   .3140713     1.49   0.143    -.1639765    1.098323
_IregXy~4_90 |   .2649233   .2881911     0.92   0.362    -.3142185    .8440651
_IregXy~4_91 |   .2803525   .2737324     1.02   0.311    -.2697333    .8304383
_IregXy~4_92 |   .2516714   .2129395     1.18   0.243    -.1762464    .6795893
_IregXy~4_93 |  -.0234235    .129175    -0.18   0.857    -.2830104    .2361633
_IregXy~4_94 |   .0087804   .0856772     0.10   0.919    -.1633943    .1809551
_IregXy~4_95 |  (dropped)
_IregXy~4_96 |  (dropped)
_IregXy~4_97 |  (dropped)
_IregXy~5_75 |  (dropped)
_IregXy~5_76 |  (dropped)
_IregXy~5_77 |  (dropped)
_IregXy~5_78 |  (dropped)
_IregXy~5_79 |   .7190829   1.202388     0.60   0.553    -1.697207    3.135372
_IregXy~5_80 |    .534439   1.088847     0.49   0.626    -1.653681    2.722559
_IregXy~5_81 |   .3985665   1.023779     0.39   0.699    -1.658793    2.455926
_IregXy~5_82 |   .4102649   .9379632     0.44   0.664    -1.474643    2.295173
_IregXy~5_83 |   .5013752   .8742906     0.57   0.569    -1.255578    2.258328
_IregXy~5_84 |   .4479152   .7896431     0.57   0.573    -1.138932    2.034762
_IregXy~5_85 |   .4006441   .7329584     0.55   0.587    -1.072291    1.873579
_IregXy~5_86 |   .2891232   .6427613     0.45   0.655    -1.002554      1.5808
_IregXy~5_87 |   .2414575   .5846659     0.41   0.681    -.9334726    1.416388
_IregXy~5_88 |   .2735659   .4998336     0.55   0.587    -.7308875    1.278019
_IregXy~5_89 |   .3739959   .4275791     0.87   0.386    -.4852566    1.233248
_IregXy~5_90 |   .3719951   .3986765     0.93   0.355    -.4291754    1.173166
_IregXy~5_91 |   .2934008   .3506878     0.84   0.407    -.4113328    .9981344
_IregXy~5_92 |    .254369   .2727443     0.93   0.356    -.2937312    .8024692
_IregXy~5_93 |  -.0466302   .1647753    -0.28   0.778    -.3777585    .2844981
_IregXy~5_94 |  -.1008441   .0986942    -1.02   0.312    -.2991775    .0974893
_IregXy~5_95 |  (dropped)
_IregXy~5_96 |  (dropped)
_IregXy~5_97 |  (dropped)
_IregXy~6_75 |  (dropped)
_IregXy~6_76 |  (dropped)
_IregXy~6_77 |  (dropped)
_IregXy~6_78 |  (dropped)
_IregXy~6_79 |  (dropped)
_IregXy~6_80 |   .0141882    .230059     0.06   0.951    -.4481327    .4765092
_IregXy~6_81 |  -.3234102   .2932748    -1.10   0.276     -.912768    .2659476
_IregXy~6_82 |  -.0923705   .2683743    -0.34   0.732    -.6316889    .4469479
_IregXy~6_83 |   .2028694   .2309901     0.88   0.384    -.2613225    .6670614
_IregXy~6_84 |   .1480319   .1634042     0.91   0.369    -.1803412     .476405
_IregXy~6_85 |   .0888776   .1335488     0.67   0.509    -.1794988    .3572539
_IregXy~6_86 |   .0832039   .1646238     0.51   0.616    -.2476199    .4140277
_IregXy~6_87 |  -.1533089   .1867113    -0.82   0.416    -.5285193    .2219014
_IregXy~6_88 |   .0587585   .2000788     0.29   0.770     -.343315     .460832
_IregXy~6_89 |   .1718972   .1704322     1.01   0.318    -.1705992    .5143936
_IregXy~6_90 |   .3607134   .2233134     1.62   0.113    -.0880518    .8094785
_IregXy~6_91 |   .4416379   .2626116     1.68   0.099    -.0860999    .9693756
_IregXy~6_92 |    .394282   .1855069     2.13   0.039      .021492    .7670721
_IregXy~6_93 |   .0371143   .1007862     0.37   0.714    -.1654232    .2396517
_IregXy~6_94 |  -.0791307   .0730425    -1.08   0.284    -.2259151    .0676538
_IregXy~6_95 |  (dropped)
_IregXy~6_96 |  (dropped)
_IregXy~6_97 |  (dropped)
_IregXy~7_75 |  (dropped)
_IregXy~7_76 |  (dropped)
_IregXy~7_77 |  (dropped)
_IregXy~7_78 |  (dropped)
_IregXy~7_79 |  (dropped)
_IregXy~7_80 |  -.2506666   .1826283    -1.37   0.176    -.6176718    .1163387
_IregXy~7_81 |  -.2261232   .2262885    -1.00   0.323    -.6808669    .2286205
_IregXy~7_82 |   -.339852   .1966356    -1.73   0.090    -.7350062    .0553021
_IregXy~7_83 |  -.1162327    .207451    -0.56   0.578    -.5331211    .3006556
_IregXy~7_84 |  -.3475371   .1259469    -2.76   0.008    -.6006369   -.0944374
_IregXy~7_85 |  -.4392638   .1214203    -3.62   0.001     -.683267   -.1952605
_IregXy~7_86 |  -.3740361   .1647304    -2.27   0.028    -.7050742    -.042998
_IregXy~7_87 |  -.5122743    .194499    -2.63   0.011    -.9031347   -.1214139
_IregXy~7_88 |  -.2235075   .1933336    -1.16   0.253    -.6120258    .1650109
_IregXy~7_89 |   .0605768   .2178602     0.28   0.782    -.3772296    .4983832
_IregXy~7_90 |   .1875335   .2233005     0.84   0.405    -.2612056    .6362727
_IregXy~7_91 |    .449034   .1877058     2.39   0.021     .0718251    .8262428
_IregXy~7_92 |   .3392206   .1573966     2.16   0.036     .0229203    .6555209
_IregXy~7_93 |   .0113504   .0948258     0.12   0.905    -.1792092      .20191
_IregXy~7_94 |  -.0818179   .0586342    -1.40   0.169    -.1996477    .0360119
_IregXy~7_95 |  (dropped)
_IregXy~7_96 |  (dropped)
_IregXy~7_97 |  (dropped)
_IregXy~8_75 |  (dropped)
_IregXy~8_76 |  (dropped)
_IregXy~8_77 |  (dropped)
_IregXy~8_78 |  (dropped)
_IregXy~8_79 |   .1907789   .1586526     1.20   0.235    -.1280455    .5096032
_IregXy~8_80 |   .0583865    .221967     0.26   0.794     -.387673    .5044459
_IregXy~8_81 |  -.1551769   .1625597    -0.95   0.344    -.4818528    .1714989
_IregXy~8_82 |  -.2644465   .2580018    -1.02   0.310    -.7829205    .2540275
_IregXy~8_83 |  -.0055844   .1838465    -0.03   0.976    -.3750379    .3638691
_IregXy~8_84 |   .0476962   .1579476     0.30   0.764    -.2697115    .3651039
_IregXy~8_85 |  -.1887396    .177891    -1.06   0.294     -.546225    .1687457
_IregXy~8_86 |  -.1738165   .1574281    -1.10   0.275    -.4901801     .142547
_IregXy~8_87 |  -.0929479    .200066    -0.46   0.644    -.4949957    .3090998
_IregXy~8_88 |   .0549718   .2021355     0.27   0.787    -.3512347    .4611783
_IregXy~8_89 |   .1991576   .2173091     0.92   0.364    -.2375413    .6358566
_IregXy~8_90 |    .163157   .2046609     0.80   0.429    -.2481244    .5744385
_IregXy~8_91 |   .2968766   .1999631     1.48   0.144    -.1049644    .6987176
_IregXy~8_92 |   .1919912   .1656012     1.16   0.252    -.1407969    .5247793
_IregXy~8_93 |   .0270017    .117962     0.23   0.820    -.2100517    .2640552
_IregXy~8_94 |  -.0905828   .0694161    -1.30   0.198    -.2300797    .0489142
_IregXy~8_95 |  (dropped)
_IregXy~8_96 |  (dropped)
_IregXy~8_97 |  (dropped)
_IregXy~9_75 |  (dropped)
_IregXy~9_76 |  (dropped)
_IregXy~9_77 |  (dropped)
_IregXy~9_78 |  (dropped)
_IregXy~9_79 |    .327455   .4315606     0.76   0.452    -.5397986    1.194709
_IregXy~9_80 |    .114187   .4574995     0.25   0.804    -.8051926    1.033567
_IregXy~9_81 |   .1696509   .4147372     0.41   0.684    -.6637948    1.003097
_IregXy~9_82 |   .0306217   .3859834     0.08   0.937     -.745041    .8062845
_IregXy~9_83 |   .1633863   .3684396     0.44   0.659    -.5770208    .9037935
_IregXy~9_84 |   .1817681   .3297521     0.55   0.584    -.4808936    .8444297
_IregXy~9_85 |  -.0782426   .3147927    -0.25   0.805    -.7108422     .554357
_IregXy~9_86 |   .0335894   .3011089     0.11   0.912    -.5715116    .6386904
_IregXy~9_87 |  -.0760966   .3069332    -0.25   0.805    -.6929019    .5407088
_IregXy~9_88 |   .1214168   .2602074     0.47   0.643    -.4014896    .6443231
_IregXy~9_89 |   .2558506   .2332366     1.10   0.278     -.212856    .7245571
_IregXy~9_90 |    .367236   .2527353     1.45   0.153    -.1406547    .8751266
_IregXy~9_91 |   .3330593   .2085802     1.60   0.117    -.0860982    .7522168
_IregXy~9_92 |   .1114184    .169492     0.66   0.514    -.2291885    .4520252
_IregXy~9_93 |  -.0099274   .1225158    -0.08   0.936    -.2561321    .2362774
_IregXy~9_94 |  -.0396561   .0862712    -0.46   0.648    -.2130247    .1337124
_IregXy~9_95 |  (dropped)
_IregXy~9_96 |  (dropped)
_IregXy~9_97 |  (dropped)
  _IstaXt_12 |  -.0437049   .0049409    -8.85   0.000     -.053634   -.0337759
  _IstaXt_13 |   .0347223   .0070703     4.91   0.000     .0205139    .0489306
  _IstaXt_14 |  -.1048215   .0086451   -12.12   0.000    -.1221945   -.0874485
  _IstaXt_15 |  -.0457607    .006956    -6.58   0.000    -.0597393   -.0317821
  _IstaXt_16 |  -.1184716   .0085027   -13.93   0.000    -.1355584   -.1013848
  _IstaXt_21 |  -.0676321   .0905389    -0.75   0.459    -.2495768    .1143126
  _IstaXt_22 |  -.0610445    .093584    -0.65   0.517    -.2491086    .1270196
  _IstaXt_23 |  -.0292202   .0918147    -0.32   0.752    -.2137287    .1552882
  _IstaXt_31 |  -.0316794   .0807696    -0.39   0.697    -.1939919    .1306332
  _IstaXt_32 |  -.0295417   .0842613    -0.35   0.727    -.1988711    .1397877
  _IstaXt_33 |  -.0298828   .0804039    -0.37   0.712    -.1914604    .1316948
  _IstaXt_34 |  -.0290716   .0825921    -0.35   0.726    -.1950466    .1369034
  _IstaXt_35 |   -.071057   .0855479    -0.83   0.410     -.242972    .1008581
  _IstaXt_41 |  -.0600411   .0572364    -1.05   0.299     -.175062    .0549797
  _IstaXt_42 |  -.0277271   .0532958    -0.52   0.605    -.1348291    .0793749
  _IstaXt_43 |  -.0287407   .0555513    -0.52   0.607    -.1403752    .0828938
  _IstaXt_44 |   .0099813   .0521059     0.19   0.849    -.0947294     .114692
  _IstaXt_45 |  -.0064261   .0594332    -0.11   0.914    -.1258616    .1130093
  _IstaXt_46 |  -.0023073    .055715    -0.04   0.967    -.1142709    .1096562
  _IstaXt_47 |   .0317811   .0529477     0.60   0.551    -.0746213    .1381835
  _IstaXt_51 |  -.0601253    .075576    -0.80   0.430     -.212001    .0917504
  _IstaXt_52 |  -.0578296   .0730974    -0.79   0.433    -.2047244    .0890652
  _IstaXt_54 |  -.0399349   .0788072    -0.51   0.615     -.198304    .1184341
  _IstaXt_55 |  -.0344107   .0636427    -0.54   0.591    -.1623055    .0934842
  _IstaXt_56 |   .0316187   .0794598     0.40   0.692    -.1280618    .1912992
  _IstaXt_57 |   .0376249   .0775051     0.49   0.630    -.1181275    .1933773
  _IstaXt_58 |   -.014619   .0791182    -0.18   0.854     -.173613    .1443751
  _IstaXt_59 |   .0061282   .0823897     0.07   0.941      -.15944    .1716964
  _IstaXt_61 |  -.0521094   .0138413    -3.76   0.000    -.0799244   -.0242943
  _IstaXt_62 |  -.0283868   .0134791    -2.11   0.040    -.0554741   -.0012996
  _IstaXt_63 |  -.0161928   .0162467    -1.00   0.324    -.0488417    .0164562
  _IstaXt_64 |   .0790756   .0128091     6.17   0.000     .0533349    .1048164
  _IstaXt_71 |    .006751   .0106906     0.63   0.531    -.0147326    .0282346
  _IstaXt_72 |  -.1100638   .0104039   -10.58   0.000    -.1309712   -.0891565
  _IstaXt_73 |  -.0781497   .0100111    -7.81   0.000    -.0982677   -.0580317
  _IstaXt_74 |  -.0796049   .0110078    -7.23   0.000     -.101726   -.0574838
  _IstaXt_81 |   .0374064   .0150936     2.48   0.017     .0070746    .0677382
  _IstaXt_82 |  -.0117482    .010519    -1.12   0.270     -.032887    .0093905
  _IstaXt_83 |  -.0287525   .0205128    -1.40   0.167    -.0699745    .0124695
  _IstaXt_84 |  -.1004548   .0126677    -7.93   0.000    -.1259116   -.0749981
  _IstaXt_85 |   -.030887   .0111762    -2.76   0.008    -.0533463   -.0084276
  _IstaXt_86 |  -.0754406   .0114841    -6.57   0.000    -.0985188   -.0523623
  _IstaXt_87 |   .0030138   .0129647     0.23   0.817    -.0230397    .0290673
  _IstaXt_88 |  -.0629354   .0136788    -4.60   0.000     -.090424   -.0354467
  _IstaXt_91 |  -.0595319   .0216385    -2.75   0.008    -.1030161   -.0160478
  _IstaXt_92 |  -.0266195   .0271431    -0.98   0.332    -.0811657    .0279266
  _IstaXt_93 |  -.0923138   .0299803    -3.08   0.003    -.1525616   -.0320661
  _IstaXt_94 |  -.0360414   .0257698    -1.40   0.168    -.0878277    .0157449
  _IstaXt_95 |  -.0974731   .0253316    -3.85   0.000     -.148379   -.0465673
       _cons |  -12.77832   7.412278    -1.72   0.091    -27.67385     2.11721
------------------------------------------------------------------------------

. reg lnths lnemp mico mppa mgfa _Iyear* _Istate* _IregX* _IstaXt* , cluster(st
> ate);

Linear regression                                      Number of obs =     850
                                                       F( 44,    49) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.9926
                                                       Root MSE      =  .18005

                                 (Std. Err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       lnemp |   1.655233   .9144495     1.81   0.076    -.1824218    3.492888
        mico |      .1414    .068133     2.08   0.043     .0044816    .2783184
        mppa |  -.0457375   .0691716    -0.66   0.512    -.1847431    .0932681
        mgfa |  -.0818245   .1023797    -0.80   0.428    -.2875642    .1239153
   _Iyear_75 |  (dropped)
   _Iyear_76 |  (dropped)
   _Iyear_80 |    .180672   .2035497     0.89   0.379    -.2283764    .5897205
   _Iyear_81 |   .3852924   .2058079     1.87   0.067    -.0282941    .7988789
   _Iyear_82 |   .4276066   .2095746     2.04   0.047     .0064507    .8487625
   _Iyear_83 |    .316523   .1898831     1.67   0.102    -.0650614    .6981075
   _Iyear_84 |   .6851443    .164473     4.17   0.000     .3546234    1.015665
   _Iyear_85 |   1.010171   .1631978     6.19   0.000     .6822127    1.338129
   _Iyear_86 |    1.12245   .2200142     5.10   0.000     .6803154    1.564585
   _Iyear_87 |    1.29128   .2177288     5.93   0.000     .8537377    1.728823
   _Iyear_88 |   1.491908   .2736009     5.45   0.000     .9420866     2.04173
   _Iyear_89 |   1.479903   .2694675     5.49   0.000     .9383882    2.021419
   _Iyear_90 |    1.53954   .2342061     6.57   0.000     1.068885    2.010195
   _Iyear_91 |   1.582818   .2048367     7.73   0.000     1.171183    1.994453
   _Iyear_92 |   1.810944   .2346625     7.72   0.000     1.339372    2.282516
   _Iyear_93 |   2.285526   .2846039     8.03   0.000     1.713593    2.857458
   _Iyear_94 |   2.461286   .2820752     8.73   0.000     1.894434    3.028137
   _Iyear_95 |   2.492899   .3027344     8.23   0.000     1.884532    3.101267
   _Iyear_96 |  (dropped)
   _Iyear_97 |  (dropped)
  _Istate_12 |   1.616474   .1728072     9.35   0.000     1.269205    1.963744
  _Istate_13 |  -.7812123   .6924156    -1.13   0.265    -2.172674     .610249
  _Istate_14 |   .9028226   1.692992     0.53   0.596    -2.499372    4.305017
  _Istate_15 |   1.688058   .0703515    23.99   0.000     1.546681    1.829434
  _Istate_16 |   1.199759   1.139751     1.05   0.298    -1.090657    3.490174
  _Istate_21 |   .3059227   .3162385     0.97   0.338    -.3295822    .9414277
  _Istate_22 |   .6611444   .4716913     1.40   0.167    -.2867548    1.609044
  _Istate_23 |  (dropped)
  _Istate_31 |  (dropped)
  _Istate_32 |     .00416   .6113058     0.01   0.995    -1.224305    1.232625
  _Istate_33 |   .1287423   .1771933     0.73   0.471    -.2273411    .4848256
  _Istate_34 |   .1084658   .1998654     0.54   0.590    -.2931788    .5101104
  _Istate_35 |   .6350341   .7273067     0.87   0.387    -.8265434    2.096612
  _Istate_41 |   .6765625   .1008466     6.71   0.000     .4739037    .8792212
  _Istate_42 |  -.0449962    .490822    -0.09   0.927     -1.03134    .9413475
  _Istate_43 |  (dropped)
  _Istate_44 |   -.830437   1.851365    -0.45   0.656    -4.550895    2.890021
  _Istate_45 |  -.8743849   1.897931    -0.46   0.647    -4.688419    2.939649
  _Istate_46 |    .411806   1.024411     0.40   0.689    -1.646826    2.470438
  _Istate_47 |  -.8055102   .6361735    -1.27   0.211    -2.083949    .4729283
  _Istate_51 |   1.736529    2.38288     0.73   0.470    -3.052048    6.525105
  _Istate_52 |   .2196792   .6415015     0.34   0.733    -1.069466    1.508825
  _Istate_54 |  -.0498689   .4607015    -0.11   0.914    -.9756832    .8759454
  _Istate_55 |  -.0985443   1.383105    -0.07   0.943    -2.877998     2.68091
  _Istate_56 |  -1.044356    .341808    -3.06   0.004    -1.731245   -.3574668
  _Istate_57 |  -.5298089   .9792169    -0.54   0.591    -2.497619    1.438001
  _Istate_58 |  -.1101656   .4270581    -0.26   0.798     -.968371    .7480397
  _Istate_59 |  (dropped)
  _Istate_61 |   .6330863   .1260635     5.02   0.000     .3797522    .8864204
  _Istate_62 |   .1720809   .2086239     0.82   0.413    -.2471644    .5913263
  _Istate_63 |  (dropped)
  _Istate_64 |  -1.377976   .4444955    -3.10   0.003    -2.271223   -.4847289
  _Istate_71 |  (dropped)
  _Istate_72 |   1.193819   .7328422     1.63   0.110    -.2788827    2.666521
  _Istate_73 |    .755801    .446252     1.69   0.097    -.1409759    1.652578
  _Istate_74 |   .2388758   1.860966     0.13   0.898    -3.500876    3.978627
  _Istate_81 |  -2.108788   1.015697    -2.08   0.043    -4.149907   -.0676698
  _Istate_82 |   -.782549   .8691198    -0.90   0.372    -2.529111    .9640125
  _Istate_83 |  -1.271938   1.295666    -0.98   0.331    -3.875676      1.3318
  _Istate_84 |    .218932   .2679185     0.82   0.418    -.3194704    .7573343
  _Istate_85 |  -.7041657   .6527336    -1.08   0.286    -2.015883    .6075515
  _Istate_86 |  (dropped)
  _Istate_87 |  -.9767707   .4845866    -2.02   0.049    -1.950584   -.0029576
  _Istate_88 |  -.1849296    .826904    -0.22   0.824    -1.846655    1.476796
  _Istate_91 |   .0325585   1.681961     0.02   0.985    -3.347469    3.412586
  _Istate_92 |   .1842303   1.979833     0.09   0.926    -3.794393    4.162853
  _Istate_93 |  (dropped)
  _Istate_94 |   -.014521   3.685222    -0.00   0.997    -7.420251    7.391209
  _Istate_95 |   1.039083   2.946781     0.35   0.726    -4.882696    6.960862
_IregXy~2_75 |  (dropped)
_IregXy~2_76 |  (dropped)
_IregXy~2_77 |  (dropped)
_IregXy~2_78 |  (dropped)
_IregXy~2_79 |   .0697093   1.966881     0.04   0.972    -3.882887    4.022305
_IregXy~2_80 |   .0353855   1.645877     0.02   0.983    -3.272127    3.342898
_IregXy~2_81 |  -.0924436   1.373481    -0.07   0.947    -2.852558     2.66767
_IregXy~2_82 |  -.0311598   1.105554    -0.03   0.978    -2.252853    2.190534
_IregXy~2_83 |   .1830107   .8654312     0.21   0.833    -1.556138     1.92216
_IregXy~2_84 |   .1623514   .6350722     0.26   0.799    -1.113874    1.438577
_IregXy~2_85 |   -.041085   .4393111    -0.09   0.926    -.9239136    .8417437
_IregXy~2_86 |  -.0540515   .2728972    -0.20   0.844    -.6024589    .4943559
_IregXy~2_87 |  -.0016276   .1552363    -0.01   0.992    -.3135867    .3103315
_IregXy~2_88 |  (dropped)
_IregXy~2_89 |   .0946647   .1135038     0.83   0.408    -.1334298    .3227592
_IregXy~2_90 |    .090296   .1462328     0.62   0.540    -.2035698    .3841617
_IregXy~2_91 |   .1314302   .1558683     0.84   0.403    -.1817988    .4446592
_IregXy~2_92 |   .0878617   .1741095     0.50   0.616    -.2620244    .4377478
_IregXy~2_93 |   -.062638   .1461826    -0.43   0.670    -.3564029    .2311269
_IregXy~2_94 |  -.0977062   .0885036    -1.10   0.275    -.2755609    .0801485
_IregXy~2_95 |  (dropped)
_IregXy~2_96 |  (dropped)
_IregXy~2_97 |  (dropped)
_IregXy~3_75 |  (dropped)
_IregXy~3_76 |  (dropped)
_IregXy~3_77 |  (dropped)
_IregXy~3_78 |  (dropped)
_IregXy~3_79 |    .149641   1.863511     0.08   0.936    -3.595224    3.894506
_IregXy~3_80 |  -.0257753   1.518534    -0.02   0.987    -3.077383    3.025832
_IregXy~3_81 |  -.2841747   1.246721    -0.23   0.821    -2.789555    2.221206
_IregXy~3_82 |  -.2044526   .9637361    -0.21   0.833    -2.141153    1.732248
_IregXy~3_83 |  -.0296553   .7177836    -0.04   0.967    -1.472095    1.412785
_IregXy~3_84 |   .0713047   .4924765     0.14   0.885     -.918364    1.060973
_IregXy~3_85 |   .0518248   .3218774     0.16   0.873    -.5950121    .6986617
_IregXy~3_86 |   .0842207   .1698875     0.50   0.622     -.257181    .4256224
_IregXy~3_87 |  (dropped)
_IregXy~3_88 |   .1349737   .1486574     0.91   0.368    -.1637646    .4337119
_IregXy~3_89 |   .1829597   .1829158     1.00   0.322    -.1846233    .5505427
_IregXy~3_90 |   .1543808   .1972507     0.78   0.438    -.2420094     .550771
_IregXy~3_91 |   .1728899   .1929203     0.90   0.375     -.214798    .5605777
_IregXy~3_92 |   .1345689   .1834192     0.73   0.467    -.2340258    .5031636
_IregXy~3_93 |   -.063211   .1655994    -0.38   0.704    -.3959954    .2695733
_IregXy~3_94 |  -.0693531   .1026291    -0.68   0.502     -.275594    .1368878
_IregXy~3_95 |  (dropped)
_IregXy~3_96 |  (dropped)
_IregXy~3_97 |  (dropped)
_IregXy~4_75 |  (dropped)
_IregXy~4_76 |  (dropped)
_IregXy~4_77 |  (dropped)
_IregXy~4_78 |  (dropped)
_IregXy~4_79 |   .7182488   1.190396     0.60   0.549    -1.673942    3.110439
_IregXy~4_80 |   .4183973   .9371407     0.45   0.657    -1.464857    2.301652
_IregXy~4_81 |  -.0817558   .6839668    -0.12   0.905    -1.456239    1.292727
_IregXy~4_82 |   .0043466   .4877323     0.01   0.993    -.9757881    .9844813
_IregXy~4_83 |    .087897   .3384735     0.26   0.796     -.592291     .768085
_IregXy~4_84 |    .023624   .1614904     0.15   0.884    -.3009032    .3481511
_IregXy~4_85 |  (dropped)
_IregXy~4_86 |   .0010916   .1924803     0.01   0.995    -.3857121    .3878953
_IregXy~4_87 |  -.0477734   .2769216    -0.17   0.864    -.6042682    .5087214
_IregXy~4_88 |    .052462   .3121543     0.17   0.867    -.5748355    .6797596
_IregXy~4_89 |   .1869536   .3344081     0.56   0.579    -.4850647    .8589719
_IregXy~4_90 |   .0096288   .3409875     0.03   0.978    -.6756113    .6948689
_IregXy~4_91 |   .0551192   .3404706     0.16   0.872    -.6290821    .7393205
_IregXy~4_92 |   .0709617   .3089345     0.23   0.819    -.5498654    .6917888
_IregXy~4_93 |  -.1501329   .2412114    -0.62   0.537    -.6348654    .3345996
_IregXy~4_94 |  -.0583388    .105034    -0.56   0.581    -.2694125    .1527349
_IregXy~4_95 |  (dropped)
_IregXy~4_96 |  (dropped)
_IregXy~4_97 |  (dropped)
_IregXy~5_75 |  (dropped)
_IregXy~5_76 |  (dropped)
_IregXy~5_77 |  (dropped)
_IregXy~5_78 |  (dropped)
_IregXy~5_79 |   .4942709   1.600718     0.31   0.759    -2.722493    3.711035
_IregXy~5_80 |   .2854842   1.281393     0.22   0.825    -2.289571    2.860539
_IregXy~5_81 |   .1284125   1.032875     0.12   0.902    -1.947228    2.204053
_IregXy~5_82 |   .1259085   .7721505     0.16   0.871    -1.425786    1.677603
_IregXy~5_83 |   .2119721   .5440782     0.39   0.699     -.881394    1.305338
_IregXy~5_84 |   .1545081   .3341922     0.46   0.646    -.5170763    .8260924
_IregXy~5_85 |   .0964281    .171002     0.56   0.575    -.2472132    .4400694
_IregXy~5_86 |  (dropped)
_IregXy~5_87 |  -.0311106   .1714384    -0.18   0.857     -.375629    .3134078
_IregXy~5_88 |   .0078612   .2355283     0.03   0.974    -.4654506    .4811731
_IregXy~5_89 |   .1288604   .2815477     0.46   0.649     -.436931    .6946517
_IregXy~5_90 |   .1478404   .2776548     0.53   0.597    -.4101277    .7058086
_IregXy~5_91 |   .0986652   .2722314     0.36   0.719    -.4484042    .6457347
_IregXy~5_92 |   .1014414   .2524047     0.40   0.690    -.4057848    .6086677
_IregXy~5_93 |  -.1544893   .1906599    -0.81   0.422    -.5376347     .228656
_IregXy~5_94 |  -.1578514   .1118047    -1.41   0.164    -.3825313    .0668285
_IregXy~5_95 |  (dropped)
_IregXy~5_96 |  (dropped)
_IregXy~5_97 |  (dropped)
_IregXy~6_75 |  (dropped)
_IregXy~6_76 |  (dropped)
_IregXy~6_77 |  (dropped)
_IregXy~6_78 |  (dropped)
_IregXy~6_79 |  -.2980394   .9596821    -0.31   0.757    -2.226593    1.630514
_IregXy~6_80 |  -.2439273   .7626167    -0.32   0.750    -1.776463    1.288608
_IregXy~6_81 |  -.5392994   .6471345    -0.83   0.409    -1.839765     .761166
_IregXy~6_82 |  -.2753326   .4919923    -0.56   0.578    -1.264028     .713363
_IregXy~6_83 |   .0547052   .3606459     0.15   0.880    -.6700399    .7794503
_IregXy~6_84 |   .0229795   .2655191     0.09   0.931    -.5106011      .55656
_IregXy~6_85 |  -.0217532   .1852993    -0.12   0.907     -.394126    .3506197
_IregXy~6_86 |  (dropped)
_IregXy~6_87 |  -.2069428   .1798809    -1.15   0.256     -.568427    .1545414
_IregXy~6_88 |   .0114897   .1829971     0.06   0.950    -.3562568    .3792362
_IregXy~6_89 |   .1368421   .1835517     0.75   0.460    -.2320188    .5057031
_IregXy~6_90 |   .3313296   .2443301     1.36   0.181    -.1596703    .8223294
_IregXy~6_91 |   .4154577   .2546788     1.63   0.109    -.0963384    .9272539
_IregXy~6_92 |   .3751714   .1754026     2.14   0.037     .0226867    .7276561
_IregXy~6_93 |   .0253023   .1300863     0.19   0.847     -.236116    .2867205
_IregXy~6_94 |  -.0851939   .0754017    -1.13   0.264    -.2367193    .0663315
_IregXy~6_95 |  (dropped)
_IregXy~6_96 |  (dropped)
_IregXy~6_97 |  (dropped)
_IregXy~7_75 |  (dropped)
_IregXy~7_76 |  (dropped)
_IregXy~7_77 |  (dropped)
_IregXy~7_78 |  (dropped)
_IregXy~7_79 |    .196185   .4705584     0.42   0.679    -.7494376    1.141808
_IregXy~7_80 |   .0155572   .4320517     0.04   0.971    -.8526831    .8837975
_IregXy~7_81 |   .0991702   .4270013     0.23   0.817    -.7589212    .9572615
_IregXy~7_82 |   .0365576   .3713488     0.10   0.922    -.7096957    .7828109
_IregXy~7_83 |   .3081138   .3024755     1.02   0.313    -.2997334     .915961
_IregXy~7_84 |   .1150846   .2513453     0.46   0.649    -.3900128    .6201819
_IregXy~7_85 |   .0489187   .1961054     0.25   0.804    -.3451698    .4430071
_IregXy~7_86 |   .1347841   .1429746     0.94   0.350    -.1525341    .4221023
_IregXy~7_87 |  (dropped)
_IregXy~7_88 |   .2581946   .1764327     1.46   0.150    -.0963602    .6127493
_IregXy~7_89 |   .5066343   .2158103     2.35   0.023     .0729473    .9403213
_IregXy~7_90 |   .5813973   .1956413     2.97   0.005     .1882413    .9745532
_IregXy~7_91 |   .7785531   .1330956     5.85   0.000     .5110875    1.046019
_IregXy~7_92 |   .6029023   .1131358     5.33   0.000     .3755474    .8302572
_IregXy~7_93 |   .1992563   .1002575     1.99   0.052    -.0022187    .4007314
_IregXy~7_94 |   .0177544   .0641069     0.28   0.783    -.1110732     .146582
_IregXy~7_95 |  (dropped)
_IregXy~7_96 |  (dropped)
_IregXy~7_97 |  (dropped)
_IregXy~8_75 |  (dropped)
_IregXy~8_76 |  (dropped)
_IregXy~8_77 |  (dropped)
_IregXy~8_78 |  (dropped)
_IregXy~8_79 |   1.138449    .656899     1.73   0.089    -.1816391    2.458537
_IregXy~8_80 |   .8577385   .5246384     1.63   0.108    -.1965619    1.912039
_IregXy~8_81 |   .5025209   .4967728     1.01   0.317    -.4957814    1.500823
_IregXy~8_82 |   .2698901   .3270734     0.83   0.413    -.3873885    .9271687
_IregXy~8_83 |   .4285844   .2848925     1.50   0.139    -.1439284    1.001097
_IregXy~8_84 |   .3799602   .1985562     1.91   0.062    -.0190535    .7789739
_IregXy~8_85 |   .0476245     .15692     0.30   0.763     -.267718    .3629671
_IregXy~8_86 |  (dropped)
_IregXy~8_87 |   .0296487   .2154703     0.14   0.891     -.403355    .4626524
_IregXy~8_88 |   .1145548   .2689716     0.43   0.672    -.4259638    .6550734
_IregXy~8_89 |    .212421   .2844229     0.75   0.459    -.3591483    .7839903
_IregXy~8_90 |   .1373769   .2250393     0.61   0.544    -.3148566    .5896104
_IregXy~8_91 |   .2436285   .2136595     1.14   0.260    -.1857364    .6729934
_IregXy~8_92 |   .1323115   .1830251     0.72   0.473    -.2354913    .5001143
_IregXy~8_93 |  -.0255235   .1493086    -0.17   0.865    -.3255704    .2745235
_IregXy~8_94 |  -.1233441   .0846404    -1.46   0.151    -.2934354    .0467472
_IregXy~8_95 |  (dropped)
_IregXy~8_96 |  (dropped)
_IregXy~8_97 |  (dropped)
_IregXy~9_75 |  (dropped)
_IregXy~9_76 |  (dropped)
_IregXy~9_77 |  (dropped)
_IregXy~9_78 |  (dropped)
_IregXy~9_79 |   .3685345   2.401114     0.15   0.879    -4.456686    5.193755
_IregXy~9_80 |   .1406519   1.927388     0.07   0.942    -3.732579    4.013882
_IregXy~9_81 |   .1774243   1.522797     0.12   0.908    -2.882751    3.237599
_IregXy~9_82 |   .0201066   1.162884     0.02   0.986    -2.316796     2.35701
_IregXy~9_83 |   .1502686   .8215718     0.18   0.856    -1.500742    1.801279
_IregXy~9_84 |    .158794   .5178653     0.31   0.760    -.8818952    1.199483
_IregXy~9_85 |  -.1176887   .2623567    -0.45   0.656    -.6449142    .4095368
_IregXy~9_86 |  (dropped)
_IregXy~9_87 |  -.1088938   .2301339    -0.47   0.638    -.5713652    .3535775
_IregXy~9_88 |   .0769374   .3333637     0.23   0.818    -.5929821    .7468569
_IregXy~9_89 |   .2061696   .3914565     0.53   0.601    -.5804916    .9928308
_IregXy~9_90 |   .3096466   .4317318     0.72   0.477    -.5579509    1.177244
_IregXy~9_91 |   .2718028   .3808097     0.71   0.479    -.4934629    1.037068
_IregXy~9_92 |   .0592781    .326949     0.18   0.857    -.5977506    .7163068
_IregXy~9_93 |  -.0467643   .2685289    -0.17   0.862    -.5863934    .4928647
_IregXy~9_94 |  -.0593572   .1696543    -0.35   0.728    -.4002903    .2815758
_IregXy~9_95 |  (dropped)
_IregXy~9_96 |  (dropped)
_IregXy~9_97 |  (dropped)
  _IstaXt_12 |   -.214041   .0171433   -12.49   0.000    -.2484917   -.1795903
  _IstaXt_13 |   .1514369   .0198264     7.64   0.000     .1115943    .1912795
  _IstaXt_14 |   -.096328    .008581   -11.23   0.000    -.1135722   -.0790839
  _IstaXt_15 |  -.1075632   .0082433   -13.05   0.000    -.1241287   -.0909977
  _IstaXt_16 |  -.0780732   .0152369    -5.12   0.000    -.1086929   -.0474534
  _IstaXt_21 |  -.1597379   .3562492    -0.45   0.656    -.8756475    .5561717
  _IstaXt_22 |  -.1482879   .3676908    -0.40   0.688    -.8871903    .5906145
  _IstaXt_23 |  -.1049557   .3334635    -0.31   0.754    -.7750756    .5651642
  _IstaXt_31 |  -.1162965   .3417575    -0.34   0.735    -.8030839    .5704909
  _IstaXt_32 |  -.0449354   .3384088    -0.13   0.895    -.7249934    .6351225
  _IstaXt_33 |  -.1433883   .3364696    -0.43   0.672    -.8195492    .5327726
  _IstaXt_34 |  -.0785402   .3418648    -0.23   0.819    -.7655433    .6084628
  _IstaXt_35 |  -.0845364   .3451976    -0.24   0.808    -.7782369    .6091641
  _IstaXt_41 |  -.0693206   .2814596    -0.25   0.806    -.6349349    .4962936
  _IstaXt_42 |  -.0657543   .2630657    -0.25   0.804    -.5944047    .4628961
  _IstaXt_43 |  -.0232494   .2860809    -0.08   0.936    -.5981504    .5516517
  _IstaXt_44 |   -.029329   .2650952    -0.11   0.912    -.5620577    .5033998
  _IstaXt_45 |    .221128   .2656997     0.83   0.409    -.3128155    .7550716
  _IstaXt_46 |  -.0280303   .2713974    -0.10   0.918    -.5734239    .5173633
  _IstaXt_47 |   .1096942   .2759623     0.40   0.693    -.4448729    .6642613
  _IstaXt_51 |   .0252033   .3595824     0.07   0.944    -.6974047    .7478112
  _IstaXt_52 |  -.0109295   .3594352    -0.03   0.976    -.7332415    .7113825
  _IstaXt_54 |  -.0594408   .3639758    -0.16   0.871    -.7908775     .671996
  _IstaXt_55 |  -.0352195   .2941425    -0.12   0.905     -.626321    .5558821
  _IstaXt_56 |   .1130144   .3525777     0.32   0.750    -.5955169    .8215458
  _IstaXt_57 |   .0681273    .351282     0.19   0.847    -.6378002    .7740549
  _IstaXt_58 |   .0124111   .3565325     0.03   0.972    -.7040679      .72889
  _IstaXt_59 |  -.0573364    .371437    -0.15   0.878     -.803767    .6890943
  _IstaXt_61 |   -.134158   .1881894    -0.71   0.479    -.5123387    .2440227
  _IstaXt_62 |  -.0400501   .1959637    -0.20   0.839     -.433854    .3537537
  _IstaXt_63 |  -.0992402   .1811488    -0.55   0.586    -.4632723     .264792
  _IstaXt_64 |   .0741529   .1742938     0.43   0.672    -.2761036    .4244094
  _IstaXt_71 |  -.0788133   .0736164    -1.07   0.290     -.226751    .0691244
  _IstaXt_72 |  -.2104277   .0513993    -4.09   0.000    -.3137185   -.1071369
  _IstaXt_73 |  -.1415033   .0563086    -2.51   0.015    -.2546597   -.0283469
  _IstaXt_74 |  -.2456848   .0864176    -2.84   0.006    -.4193475   -.0720222
  _IstaXt_81 |   .1928799   .0987881     1.95   0.057    -.0056423     .391402
  _IstaXt_82 |   .0653979   .1021691     0.64   0.525    -.1399185    .2707143
  _IstaXt_83 |   .1835908   .1032932     1.78   0.082    -.0239847    .3911663
  _IstaXt_84 |  -.0024513   .1393874    -0.02   0.986    -.2825609    .2776583
  _IstaXt_85 |   .1329598   .1416637     0.94   0.353    -.1517241    .4176436
  _IstaXt_86 |   .1069107   .1646235     0.65   0.519    -.2239127    .4377341
  _IstaXt_87 |   .2393339   .1297169     1.85   0.071    -.0213421    .5000098
  _IstaXt_88 |   .0892144   .1448874     0.62   0.541    -.2019478    .3803765
  _IstaXt_91 |  -.0794857   .5261773    -0.15   0.881    -1.136879    .9779071
  _IstaXt_92 |  -.0192939   .4941535    -0.04   0.969    -1.012332    .9737448
  _IstaXt_93 |  -.0995536    .526889    -0.19   0.851    -1.158377    .9592696
  _IstaXt_94 |   .0198736   .5396729     0.04   0.971     -1.06464    1.104387
  _IstaXt_95 |  -.0691532   .5321328    -0.13   0.897    -1.138514    1.000208
 _IstaXt2_12 |   .0095917   .0007998    11.99   0.000     .0079843     .011199
 _IstaXt2_13 |  -.0064326   .0006008   -10.71   0.000      -.00764   -.0052252
 _IstaXt2_14 |  -.0001832   .0007475    -0.25   0.807    -.0016854    .0013189
 _IstaXt2_15 |   .0035774   .0001561    22.91   0.000     .0032637    .0038912
 _IstaXt2_16 |  -.0019499   .0008174    -2.39   0.021    -.0035926   -.0003073
 _IstaXt2_21 |   .0025574   .0136508     0.19   0.852     -.024875    .0299898
 _IstaXt2_22 |   .0022691   .0140108     0.16   0.872    -.0258866    .0304249
 _IstaXt2_23 |   .0015364   .0123107     0.12   0.901    -.0232029    .0262757
 _IstaXt2_31 |   .0034693   .0130629     0.27   0.792    -.0227816    .0297202
 _IstaXt2_32 |  -.0003876    .012565    -0.03   0.976     -.025638    .0248627
 _IstaXt2_33 |   .0049944   .0128346     0.39   0.699    -.0207976    .0307864
 _IstaXt2_34 |   .0014238   .0129294     0.11   0.913    -.0245587    .0274064
 _IstaXt2_35 |  -.0005367   .0128391    -0.04   0.967    -.0263378    .0252644
 _IstaXt2_41 |  -.0004533   .0114597    -0.04   0.969    -.0234824    .0225759
 _IstaXt2_42 |   .0012688   .0107833     0.12   0.907    -.0204012    .0229387
 _IstaXt2_43 |  -.0013786   .0119262    -0.12   0.908    -.0253453    .0225881
 _IstaXt2_44 |   .0013388   .0110072     0.12   0.904     -.020781    .0234585
 _IstaXt2_45 |  -.0136569    .010398    -1.31   0.195    -.0345526    .0072387
 _IstaXt2_46 |   .0004917   .0110404     0.04   0.965    -.0216949    .0226783
 _IstaXt2_47 |  -.0051825   .0114988    -0.45   0.654    -.0282903    .0179253
 _IstaXt2_51 |  -.0055008   .0143843    -0.38   0.704    -.0344072    .0234057
 _IstaXt2_52 |  -.0032331   .0144912    -0.22   0.824    -.0323542     .025888
 _IstaXt2_54 |    .000301   .0142794     0.02   0.983    -.0283945    .0289964
 _IstaXt2_55 |  -.0003699   .0116864    -0.03   0.975    -.0238546    .0231149
 _IstaXt2_56 |  -.0054222    .013639    -0.40   0.693    -.0328307    .0219863
 _IstaXt2_57 |  -.0024093   .0136804    -0.18   0.861    -.0299011    .0250825
 _IstaXt2_58 |  -.0023795   .0138326    -0.17   0.864    -.0301771    .0254182
 _IstaXt2_59 |     .00258   .0143698     0.18   0.858    -.0262972    .0314573
 _IstaXt2_61 |   .0036122   .0071842     0.50   0.617    -.0108249    .0180493
 _IstaXt2_62 |  -.0003866   .0074566    -0.05   0.959    -.0153712     .014598
 _IstaXt2_63 |    .003868   .0071986     0.54   0.593    -.0105981    .0183341
 _IstaXt2_64 |  -.0007574   .0065973    -0.11   0.909    -.0140153    .0125004
 _IstaXt2_71 |   .0054591   .0022528     2.42   0.019      .000932    .0099862
 _IstaXt2_72 |   .0064005   .0020238     3.16   0.003     .0023336    .0104674
 _IstaXt2_73 |   .0042427   .0022233     1.91   0.062    -.0002252    .0087106
 _IstaXt2_74 |   .0099712   .0030456     3.27   0.002     .0038508    .0160916
 _IstaXt2_81 |  -.0050734   .0038527    -1.32   0.194    -.0128158    .0026689
 _IstaXt2_82 |  -.0009647   .0037094    -0.26   0.796    -.0084191    .0064896
 _IstaXt2_83 |  -.0081629   .0045752    -1.78   0.081    -.0173571    .0010314
 _IstaXt2_84 |  -.0021379   .0053332    -0.40   0.690    -.0128554    .0085797
 _IstaXt2_85 |  -.0058823   .0054123    -1.09   0.282    -.0167587     .004994
 _IstaXt2_86 |  -.0069237   .0061337    -1.13   0.264    -.0192499    .0054025
 _IstaXt2_87 |  -.0098958   .0043986    -2.25   0.029    -.0187351   -.0010566
 _IstaXt2_88 |  -.0053401   .0047305    -1.13   0.264    -.0148465    .0041662
 _IstaXt2_91 |   .0011239   .0203928     0.06   0.956    -.0398571    .0421048
 _IstaXt2_92 |  -.0002484   .0191193    -0.01   0.990    -.0386702    .0381734
 _IstaXt2_93 |   .0006298   .0211865     0.03   0.976    -.0419461    .0432058
 _IstaXt2_94 |   -.002871   .0214663    -0.13   0.894     -.046009    .0402671
 _IstaXt2_95 |  -.0013261   .0210119    -0.06   0.950    -.0435511    .0408989
       _cons |  -15.54016   11.81835    -1.31   0.195    -39.29003    8.209714
------------------------------------------------------------------------------

. reg lnths lnemp mico mppa mgfa hsg smc clp black other a1624 a55up fem marfem
>  married _Iyear* _Istate* , cluster(state);

Linear regression                                      Number of obs =     850
                                                       F( 29,    49) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.9764
                                                       Root MSE      =   .2759

                                 (Std. Err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       lnemp |   2.007826   .4309195     4.66   0.000     1.141861    2.873791
        mico |   .1338377   .0771809     1.73   0.089    -.0212632    .2889386
        mppa |   .0276836   .0739851     0.37   0.710     -.120995    .1763621
        mgfa |  -.0211836   .0998531    -0.21   0.833    -.2218459    .1794787
         hsg |   5.595139   2.161067     2.59   0.013     1.252312    9.937966
         smc |   6.384513   2.313494     2.76   0.008     1.735374    11.03365
         clp |   .0442744   1.875567     0.02   0.981    -3.724818    3.813367
       black |  -3.191547   1.393308    -2.29   0.026    -5.991505   -.3915893
       other |  -.5239811   3.694917    -0.14   0.888    -7.949195    6.901233
       a1624 |   1.859474   1.791087     1.04   0.304    -1.739849    5.458798
       a55up |   .6571063   2.307306     0.28   0.777    -3.979598    5.293811
         fem |   3.093412   2.080119     1.49   0.143    -1.086744    7.273567
      marfem |  -2.439884   6.074018    -0.40   0.690    -14.64608    9.766312
     married |   1.331312   3.337544     0.40   0.692    -5.375734    8.038358
   _Iyear_75 |  (dropped)
   _Iyear_76 |  (dropped)
   _Iyear_80 |  -.0562511   .0469798    -1.20   0.237    -.1506606    .0381583
   _Iyear_81 |  -.1125205   .0723419    -1.56   0.126     -.257897     .032856
   _Iyear_82 |  -.1365711   .0958119    -1.43   0.160    -.3291123    .0559702
   _Iyear_83 |  -.1439078   .1344455    -1.07   0.290    -.4140862    .1262706
   _Iyear_84 |   .1286514   .1704462     0.75   0.454    -.2138731    .4711759
   _Iyear_85 |   .2715094   .2071813     1.31   0.196    -.1448369    .6878558
   _Iyear_86 |   .3206298   .2296474     1.40   0.169     -.140864    .7821236
   _Iyear_87 |   .4174005   .2572021     1.62   0.111    -.0994665    .9342675
   _Iyear_88 |   .6788516   .2819437     2.41   0.020     .1122644    1.245439
   _Iyear_89 |   .7322759   .3044122     2.41   0.020     .1205368    1.344015
   _Iyear_90 |   .7431342   .3262363     2.28   0.027     .0875377    1.398731
   _Iyear_91 |   .7936768   .3376337     2.35   0.023     .1151764    1.472177
   _Iyear_92 |   .7839997   .3659714     2.14   0.037     .0485525    1.519447
   _Iyear_93 |   1.006324   .3737814     2.69   0.010      .255182    1.757466
   _Iyear_94 |   1.077442   .4008483     2.69   0.010     .2719068    1.882976
   _Iyear_95 |   1.169386   .4060944     2.88   0.006     .3533091    1.985464
   _Iyear_96 |  (dropped)
   _Iyear_97 |  (dropped)
  _Istate_12 |   .7607057   .1515983     5.02   0.000     .4560575    1.065354
  _Istate_13 |   .3190065   .2928764     1.09   0.281    -.2695506    .9075636
  _Istate_14 |  -.2663713   .8373228    -0.32   0.752    -1.949034    1.416292
  _Istate_15 |   1.588793   .1505131    10.56   0.000     1.286326     1.89126
  _Istate_16 |    .340337   .5738138     0.59   0.556    -.8127851    1.493459
  _Istate_21 |  -1.070883   1.221052    -0.88   0.385    -3.524678    1.382912
  _Istate_22 |  -.4523519   .8992446    -0.50   0.617    -2.259451    1.354748
  _Istate_23 |  -1.413892   1.002472    -1.41   0.165    -3.428435    .6006511
  _Istate_31 |   -1.25115   .9428719    -1.33   0.191    -3.145922    .6436217
  _Istate_32 |  -.9674529   .6732001    -1.44   0.157    -2.320299    .3853934
  _Istate_33 |  -.9287667   1.032045    -0.90   0.373    -3.002739    1.145206
  _Istate_34 |  -.9798102   .8714797    -1.12   0.266    -2.731114    .7714939
  _Istate_35 |  -.7822607   .6514427    -1.20   0.236    -2.091384    .5268623
  _Istate_41 |  -.4608587    .635414    -0.73   0.472    -1.737771    .8160537
  _Istate_42 |   -.961374   .3894079    -2.47   0.017    -1.743918   -.1788296
  _Istate_43 |   -.557561   .6591787    -0.85   0.402     -1.88223    .7671081
  _Istate_44 |  -.7450111   .3038385    -2.45   0.018    -1.355597   -.1344248
  _Istate_45 |  -.1396272   .2632583    -0.53   0.598    -.6686646    .3894102
  _Istate_46 |  -.0580866   .1880874    -0.31   0.759    -.4360624    .3198892
  _Istate_47 |  -.5888604   .3746512    -1.57   0.122     -1.34175    .1640294
  _Istate_51 |   2.194755   .3471487     6.32   0.000     1.497133    2.892376
  _Istate_52 |   .3967862   .7209811     0.55   0.585    -1.052079    1.845652
  _Istate_54 |  -.0426558   .7976988    -0.05   0.958    -1.645692     1.56038
  _Istate_55 |  -.4097559   .2951065    -1.39   0.171    -1.002795    .1832829
  _Istate_56 |  -.1925815   .8110512    -0.24   0.813     -1.82245    1.437287
  _Istate_57 |   .6198424   .5831511     1.06   0.293    -.5520436    1.791728
  _Istate_58 |   .3794667   .7971237     0.48   0.636    -1.222413    1.981347
  _Istate_59 |  -.3790853   .9674035    -0.39   0.697    -2.323155    1.564985
  _Istate_61 |    -.22844   .4539013    -0.50   0.617    -1.140589    .6837088
  _Istate_62 |  -.0256278   .6428785    -0.04   0.968     -1.31754    1.266285
  _Istate_63 |  -.0769069   .5507784    -0.14   0.890    -1.183738    1.029924
  _Istate_64 |   .1395886   .5478565     0.25   0.800    -.9613703    1.240548
  _Istate_71 |   .3577119   .3254681     1.10   0.277    -.2963408    1.011765
  _Istate_72 |   .7641722   .6118243     1.25   0.218    -.4653348    1.993679
  _Istate_73 |   .0380305   .4656163     0.08   0.935    -.8976604    .9737215
  _Istate_74 |  -.9547734   1.138028    -0.84   0.406    -3.241726    1.332179
  _Istate_81 |  -.5946049   .2941621    -2.02   0.049    -1.185746   -.0034641
  _Istate_82 |  -.1336519   .2490504    -0.54   0.594    -.6341374    .3668336
  _Istate_83 |  -.0418212   .4367301    -0.10   0.924    -.9194633    .8358208
  _Istate_84 |   .1233409   .5500653     0.22   0.824    -.9820567    1.228738
  _Istate_85 |   .3322694   .3327213     1.00   0.323     -.336359    1.000898
  _Istate_86 |   .1133204   .4771347     0.24   0.813    -.8455178    1.072159
  _Istate_87 |   .0136167   .3536851     0.04   0.969      -.69714    .7243734
  _Istate_88 |   .2322539   .2942419     0.79   0.434    -.3590473     .823555
  _Istate_91 |  -.8717299   .6555477    -1.33   0.190    -2.189102    .4456426
  _Istate_92 |  -.2131515   .4324504    -0.49   0.624    -1.082193    .6558901
  _Istate_93 |  -1.409721   1.440133    -0.98   0.332    -4.303776    1.484334
  _Istate_94 |   .3091026   .6353229     0.49   0.629    -.9676266    1.585832
  _Istate_95 |   .7689021   2.529366     0.30   0.762    -4.314049    5.851853
       _cons |  -25.15749   6.181249    -4.07   0.000    -37.57918   -12.73581
------------------------------------------------------------------------------

. reg lnths lnemp mico mppa mgfa hsg smc clp black other a1624 a55up fem marfem
>  married _Iyear* _Istate* _IstaXt_* , cluster(state);

Linear regression                                      Number of obs =     850
                                                       F( 28,    49) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.9888
                                                       Root MSE      =  .19626

                                 (Std. Err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       lnemp |   1.668445   .4222563     3.95   0.000     .8198896    2.517001
        mico |   .1449653   .0560158     2.59   0.013     .0323974    .2575333
        mppa |  -.0106494   .0570645    -0.19   0.853    -.1253248     .104026
        mgfa |   -.124636   .0665009    -1.87   0.067    -.2582746    .0090027
         hsg |   .0777771   1.227572     0.06   0.950    -2.389121    2.544675
         smc |   .9425506   1.442114     0.65   0.516    -1.955485    3.840587
         clp |  -1.455396   1.568713    -0.93   0.358    -4.607843    1.697051
       black |  -2.007959   1.192168    -1.68   0.098     -4.40371    .3877925
       other |  -.1406428   1.742241    -0.08   0.936    -3.641808    3.360522
       a1624 |  -.8854399   1.063961    -0.83   0.409     -3.02355     1.25267
       a55up |   .6954384   1.306985     0.53   0.597    -1.931046    3.321923
         fem |   2.011219    1.35383     1.49   0.144    -.7094033    4.731842
      marfem |  -3.307389   2.643934    -1.25   0.217    -8.620573    2.005795
     married |   1.571726   1.801554     0.87   0.387    -2.048633    5.192085
   _Iyear_75 |  (dropped)
   _Iyear_76 |  (dropped)
   _Iyear_80 |   .0313316   .0348304     0.90   0.373    -.0386627     .101326
   _Iyear_81 |   .0553398   .0596417     0.93   0.358    -.0645147    .1751944
   _Iyear_82 |   .1014984    .068769     1.48   0.146     -.036698    .2396948
   _Iyear_83 |   .1593348   .0876351     1.82   0.075    -.0167746    .3354442
   _Iyear_84 |   .5052327   .1145115     4.41   0.000     .2751132    .7353522
   _Iyear_85 |   .7177119   .1384581     5.18   0.000       .43947    .9959539
   _Iyear_86 |   .8368382   .1582057     5.29   0.000     .5189119    1.154764
   _Iyear_87 |   .9683425   .1769273     5.47   0.000     .6127938    1.323891
   _Iyear_88 |   1.279168    .183239     6.98   0.000     .9109359    1.647401
   _Iyear_89 |   1.376306   .2133341     6.45   0.000     .9475955    1.805017
   _Iyear_90 |   1.436742   .2299525     6.25   0.000     .9746357    1.898849
   _Iyear_91 |   1.527753   .2383449     6.41   0.000     1.048781    2.006725
   _Iyear_92 |   1.686266    .269225     6.26   0.000     1.145238    2.227294
   _Iyear_93 |   1.964517   .2767719     7.10   0.000     1.408323    2.520711
   _Iyear_94 |   2.112082   .3003014     7.03   0.000     1.508603     2.71556
   _Iyear_95 |   2.229192   .3103242     7.18   0.000     1.605572    2.852811
   _Iyear_96 |  (dropped)
   _Iyear_97 |  (dropped)
  _Istate_12 |   1.102535   .1473066     7.48   0.000     .8065108    1.398558
  _Istate_13 |  -.3499737   .2951816    -1.19   0.241    -.9431634     .243216
  _Istate_14 |    .987275   .8847635     1.12   0.270    -.7907239    2.765274
  _Istate_15 |    1.49406   .0891378    16.76   0.000     1.314931    1.673189
  _Istate_16 |   1.456126   .6322842     2.30   0.026      .185503    2.726748
  _Istate_21 |   .3844695   1.286528     0.30   0.766    -2.200905    2.969844
  _Istate_22 |   .7073597   .9343674     0.76   0.453    -1.170322    2.585041
  _Istate_23 |  -.0035772   1.091356    -0.00   0.997    -2.196739    2.189584
  _Istate_31 |  -.1757386   1.016295    -0.17   0.863    -2.218061    1.866583
  _Istate_32 |   -.000258   .7250047    -0.00   1.000    -1.457209    1.456693
  _Istate_33 |  -.0741111   1.091566    -0.07   0.946    -2.267694    2.119472
  _Istate_34 |   .0665107   .9440007     0.07   0.944     -1.83053    1.963551
  _Istate_35 |   .6490481   .6872156     0.94   0.350    -.7319634     2.03006
  _Istate_41 |   1.020966   .6331136     1.61   0.113    -.2513235    2.293255
  _Istate_42 |   .1352887   .4197364     0.32   0.749    -.7082032    .9787806
  _Istate_43 |   .4737951   .6699245     0.71   0.483    -.8724686    1.820059
  _Istate_44 |  -.6542342   .2376001    -2.75   0.008    -1.131709   -.1767589
  _Istate_45 |   .1448776    .264733     0.55   0.587    -.3871233    .6768784
  _Istate_46 |   .6180901   .1916721     3.22   0.002     .2329107     1.00327
  _Istate_47 |  -.2838105   .3928571    -0.72   0.473    -1.073286    .5056654
  _Istate_51 |    2.59609   .2461501    10.55   0.000     2.101433    3.090747
  _Istate_52 |   1.133934   .7203232     1.57   0.122      -.31361    2.581477
  _Istate_54 |   .5782345   .7456263     0.78   0.442    -.9201576    2.076627
  _Istate_55 |   .0963327   .2518144     0.38   0.704    -.4097072    .6023727
  _Istate_56 |  -.1061499    .773258    -0.14   0.891     -1.66007     1.44777
  _Istate_57 |   .4476851    .575642     0.78   0.440    -.7091109    1.604481
  _Istate_58 |   .6928205   .7533343     0.92   0.362    -.8210615    2.206702
  _Istate_59 |   .3828429   .9615126     0.40   0.692    -1.549389    2.315075
  _Istate_61 |   .1648892   .4392293     0.38   0.709    -.7177751    1.047554
  _Istate_62 |   .1320665   .6137784     0.22   0.831    -1.101367      1.3655
  _Istate_63 |  -.1882721   .5752146    -0.33   0.745    -1.344209    .9676649
  _Istate_64 |  -1.116833   .4499239    -2.48   0.017    -2.020989   -.2126774
  _Istate_71 |  -.0648218   .3100384    -0.21   0.835    -.6878673    .5582237
  _Istate_72 |   1.406283   .6784356     2.07   0.043     .0429158    2.769651
  _Istate_73 |    .656057    .451958     1.45   0.153    -.2521867    1.564301
  _Istate_74 |  -.0771502   1.142529    -0.07   0.946    -2.373148    2.218848
  _Istate_81 |  -1.124728    .202538    -5.55   0.000    -1.531743   -.7177128
  _Istate_82 |  -.1581022   .1657147    -0.95   0.345    -.4911183    .1749139
  _Istate_83 |  -.0622463   .2894737    -0.22   0.831    -.6439656    .5194729
  _Istate_84 |   1.108891   .5332933     2.08   0.043     .0371978    2.180584
  _Istate_85 |   .3743033   .1688444     2.22   0.031     .0349979    .7136088
  _Istate_86 |   1.124534   .4223504     2.66   0.010      .275789    1.973279
  _Istate_87 |   .2442079   .2227707     1.10   0.278    -.2034665    .6918822
  _Istate_88 |    .894637   .1691987     5.29   0.000     .5546195    1.234654
  _Istate_91 |   .1544864   .6103842     0.25   0.801    -1.072127    1.381099
  _Istate_92 |   .3123296   .4431496     0.70   0.484    -.5782129    1.202872
  _Istate_93 |   .2230769   1.457233     0.15   0.879    -2.705343    3.151497
  _Istate_94 |   .5449336   .3839846     1.42   0.162    -.2267124     1.31658
  _Istate_95 |   1.393141    1.39464     1.00   0.323    -1.409493    4.195776
  _IstaXt_12 |  -.0371331   .0059426    -6.25   0.000    -.0490751   -.0251911
  _IstaXt_13 |   .0368119   .0069065     5.33   0.000     .0229327     .050691
  _IstaXt_14 |  -.0880065   .0092253    -9.54   0.000    -.1065454   -.0694677
  _IstaXt_15 |  -.0325151   .0061591    -5.28   0.000    -.0448923   -.0201378
  _IstaXt_16 |   -.105658   .0091997   -11.48   0.000    -.1241454   -.0871706
  _IstaXt_21 |  -.1059677   .0075612   -14.01   0.000    -.1211624   -.0907729
  _IstaXt_22 |  -.0969419   .0076828   -12.62   0.000     -.112381   -.0815028
  _IstaXt_23 |  -.0741376   .0053787   -13.78   0.000    -.0849465   -.0633286
  _IstaXt_31 |  -.0411336   .0052189    -7.88   0.000    -.0516214   -.0306458
  _IstaXt_32 |  -.0430282   .0051677    -8.33   0.000     -.053413   -.0326433
  _IstaXt_33 |  -.0386264   .0052307    -7.38   0.000     -.049138   -.0281149
  _IstaXt_34 |  -.0413968   .0029467   -14.05   0.000    -.0473185   -.0354751
  _IstaXt_35 |  -.0855956   .0067391   -12.70   0.000    -.0991384   -.0720528
  _IstaXt_41 |   -.097848   .0072162   -13.56   0.000    -.1123494   -.0833466
  _IstaXt_42 |  -.0659029   .0073157    -9.01   0.000    -.0806044   -.0512014
  _IstaXt_43 |  -.0702408   .0061848   -11.36   0.000    -.0826696    -.057812
  _IstaXt_44 |  -.0286734   .0068012    -4.22   0.000     -.042341   -.0150059
  _IstaXt_45 |  -.0470004   .0068992    -6.81   0.000    -.0608649   -.0331359
  _IstaXt_46 |  -.0392494   .0060325    -6.51   0.000    -.0513723   -.0271266
  _IstaXt_47 |   .0046319    .006719     0.69   0.494    -.0088704    .0181342
  _IstaXt_51 |  -.0822495   .0088679    -9.27   0.000    -.1000703   -.0644288
  _IstaXt_52 |  -.0821739   .0088396    -9.30   0.000    -.0999377     -.06441
  _IstaXt_54 |  -.0715266   .0081616    -8.76   0.000     -.087928   -.0551252
  _IstaXt_55 |  -.0598646   .0092424    -6.48   0.000    -.0784379   -.0412913
  _IstaXt_56 |   -.005452   .0096945    -0.56   0.576    -.0249339    .0140299
  _IstaXt_57 |  -.0021669   .0071796    -0.30   0.764    -.0165948    .0122611
  _IstaXt_58 |  -.0376015   .0114187    -3.29   0.002    -.0605482   -.0146547
  _IstaXt_59 |  -.0341346   .0083873    -4.07   0.000    -.0509894   -.0172797
  _IstaXt_61 |  -.0388121   .0057286    -6.78   0.000    -.0503241   -.0273001
  _IstaXt_62 |  -.0180105   .0076593    -2.35   0.023    -.0334025   -.0026185
  _IstaXt_63 |    .007515   .0085092     0.88   0.381    -.0095848    .0246149
  _IstaXt_64 |   .0927246   .0077875    11.91   0.000      .077075    .1083742
  _IstaXt_71 |   .0360263   .0063423     5.68   0.000      .023281    .0487715
  _IstaXt_72 |  -.0825084   .0075863   -10.88   0.000    -.0977537   -.0672631
  _IstaXt_73 |  -.0493096   .0073968    -6.67   0.000    -.0641741   -.0344451
  _IstaXt_74 |  -.0507932   .0062508    -8.13   0.000    -.0633547   -.0382317
  _IstaXt_81 |   .0537896   .0088127     6.10   0.000     .0360799    .0714993
  _IstaXt_82 |   .0037643    .008465     0.44   0.658    -.0132467    .0207754
  _IstaXt_83 |  -.0210286   .0131533    -1.60   0.116    -.0474611     .005404
  _IstaXt_84 |  -.0843461   .0088746    -9.50   0.000    -.1021803   -.0665119
  _IstaXt_85 |  -.0246499    .006707    -3.68   0.001    -.0381282   -.0111717
  _IstaXt_86 |  -.0703529   .0126981    -5.54   0.000    -.0958708   -.0448351
  _IstaXt_87 |    .012337   .0093868     1.31   0.195    -.0065264    .0312004
  _IstaXt_88 |  -.0592832   .0147112    -4.03   0.000    -.0888464     -.02972
  _IstaXt_91 |  -.0662787    .008448    -7.85   0.000    -.0832556   -.0493017
  _IstaXt_92 |  -.0298128   .0061498    -4.85   0.000    -.0421714   -.0174542
  _IstaXt_93 |  -.0934664    .010646    -8.78   0.000    -.1148602   -.0720725
  _IstaXt_94 |  -.0447428   .0089082    -5.02   0.000    -.0626446    -.026841
  _IstaXt_95 |  -.0994624    .015365    -6.47   0.000    -.1303396   -.0685852
       _cons |  -16.38559   5.520217    -2.97   0.005    -27.47888   -5.292298
------------------------------------------------------------------------------

. reg lnths lnemp mico mppa mgfa hsg smc clp black other a1624 a55up fem marfem
>  married _Iyear* _Istate* _IregX* _IstaXt* , cluster(state);

Linear regression                                      Number of obs =     850
                                                       F( 48,    49) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.9928
                                                       Root MSE      =  .17866

                                 (Std. Err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       lnemp |   1.767101   .8380826     2.11   0.040     .0829109    3.451291
        mico |   .1411613   .0677553     2.08   0.042     .0050018    .2773207
        mppa |   -.043661   .0649443    -0.67   0.505    -.1741715    .0868496
        mgfa |  -.1019739   .1098212    -0.93   0.358    -.3226678    .1187201
         hsg |   .1238518   1.235082     0.10   0.921    -2.358138    2.605842
         smc |   1.016273    1.25605     0.81   0.422    -1.507853      3.5404
         clp |  -1.415856    1.65081    -0.86   0.395    -4.733283    1.901571
       black |  -1.555982   1.093716    -1.42   0.161    -3.753886    .6419214
       other |   .2851501    2.64649     0.11   0.915    -5.033171    5.603472
       a1624 |  -.2862918   1.393511    -0.21   0.838    -3.086658    2.514074
       a55up |   -2.72789   1.663749    -1.64   0.107    -6.071318    .6155388
         fem |    1.97595   1.359762     1.45   0.153    -.7565948    4.708494
      marfem |  -2.832904   3.152939    -0.90   0.373    -9.168971    3.503164
     married |   2.603632   1.991701     1.31   0.197    -1.398841    6.606105
   _Iyear_75 |  (dropped)
   _Iyear_76 |  (dropped)
   _Iyear_80 |   .2055513   .2143458     0.96   0.342    -.2251928    .6362954
   _Iyear_81 |   .4069652    .234381     1.74   0.089     -.064041    .8779713
   _Iyear_82 |   .4340095   .2455177     1.77   0.083    -.0593768    .9273958
   _Iyear_83 |   .3200297   .2217026     1.44   0.155    -.1254983    .7655577
   _Iyear_84 |   .7011258   .2198483     3.19   0.002     .2593242    1.142927
   _Iyear_85 |   1.007553   .2106457     4.78   0.000     .5842451    1.430862
   _Iyear_86 |   1.092529    .256671     4.26   0.000     .5767293    1.608329
   _Iyear_87 |   1.276689    .267202     4.78   0.000     .7397269    1.813652
   _Iyear_88 |    1.45084   .3330392     4.36   0.000     .7815727    2.120107
   _Iyear_89 |   1.468224   .3392859     4.33   0.000     .7864034    2.150045
   _Iyear_90 |   1.535872   .3218901     4.77   0.000     .8890092    2.182734
   _Iyear_91 |   1.564159   .3199037     4.89   0.000     .9212885     2.20703
   _Iyear_92 |   1.746859   .3306927     5.28   0.000     1.082307    2.411411
   _Iyear_93 |    2.19369   .3756696     5.84   0.000     1.438754    2.948626
   _Iyear_94 |   2.365695   .3955555     5.98   0.000     1.570796    3.160593
   _Iyear_95 |   2.412062   .4201567     5.74   0.000     1.567726    3.256399
   _Iyear_96 |  (dropped)
   _Iyear_97 |  (dropped)
  _Istate_12 |   1.670188   .2173773     7.68   0.000     1.233352    2.107024
  _Istate_13 |  -.6658652   .6151725    -1.08   0.284    -1.902101    .5703702
  _Istate_14 |   .8869031   1.602561     0.55   0.582    -2.333564     4.10737
  _Istate_15 |   1.802662   .1066967    16.90   0.000     1.588247    2.017077
  _Istate_16 |   1.374356   1.131331     1.21   0.230    -.8991374     3.64785
  _Istate_21 |    .370031   .3624808     1.02   0.312    -.3584015    1.098464
  _Istate_22 |   .7335537   .4078195     1.80   0.078    -.0859902    1.553098
  _Istate_23 |  (dropped)
  _Istate_31 |  (dropped)
  _Istate_32 |  -.0240865   .6005776    -0.04   0.968    -1.230992    1.182819
  _Istate_33 |   .2277304   .2326631     0.98   0.332    -.2398236    .6952845
  _Istate_34 |   .1213188   .1898776     0.64   0.526    -.2602546    .5028922
  _Istate_35 |   .6228295   .6802008     0.92   0.364    -.7440852    1.989744
  _Istate_41 |   .5920086   .1624289     3.64   0.001     .2655956    .9184216
  _Istate_42 |  -.1174017   .4979554    -0.24   0.815    -1.118081    .8832772
  _Istate_43 |  (dropped)
  _Istate_44 |  -.6795297    1.69259    -0.40   0.690    -4.080916    2.721856
  _Istate_45 |  -.7814524   1.753956    -0.45   0.658    -4.306159    2.743254
  _Istate_46 |   .4020523   .9672846     0.42   0.679    -1.541779    2.345883
  _Istate_47 |  -.8337044   .6050936    -1.38   0.175    -2.049685    .3822766
  _Istate_51 |   2.021062   2.163953     0.93   0.355    -2.327563    6.369687
  _Istate_52 |   .3778633   .5613982     0.67   0.504    -.7503086    1.506035
  _Istate_54 |   .0229236   .4071391     0.06   0.955    -.7952531    .8411003
  _Istate_55 |  -.2884743    1.36293    -0.21   0.833    -3.027384    2.450435
  _Istate_56 |  -1.098341   .3609964    -3.04   0.004    -1.823791   -.3728921
  _Istate_57 |  -.4151047   .9388988    -0.44   0.660    -2.301892    1.471683
  _Istate_58 |  -.1743544    .413699    -0.42   0.675    -1.005714    .6570048
  _Istate_59 |  (dropped)
  _Istate_61 |   .4192661   .2247617     1.87   0.068    -.0324095    .8709417
  _Istate_62 |   .0440324   .2221637     0.20   0.844    -.4024224    .4904871
  _Istate_63 |  (dropped)
  _Istate_64 |  -1.114957   .3649041    -3.06   0.004    -1.848259   -.3816548
  _Istate_71 |  (dropped)
  _Istate_72 |   1.291492   .7240722     1.78   0.081    -.1635853     2.74657
  _Istate_73 |   .6025298   .4726587     1.27   0.208    -.3473134    1.552373
  _Istate_74 |  -.0327685   1.730161    -0.02   0.985    -3.509657     3.44412
  _Istate_81 |  -2.014997   .9778178    -2.06   0.045    -3.979995   -.0499982
  _Istate_82 |  -.9166953   .8866726    -1.03   0.306     -2.69853    .8651399
  _Istate_83 |   -1.16771   1.232609    -0.95   0.348    -3.644731     1.30931
  _Istate_84 |   .2414538   .2555955     0.94   0.349    -.2721846    .7550923
  _Istate_85 |  -.7020956   .6549822    -1.07   0.289    -2.018332    .6141405
  _Istate_86 |  (dropped)
  _Istate_87 |  -1.078253   .5098673    -2.11   0.040     -2.10287   -.0536362
  _Istate_88 |  -.0252907   .8154455    -0.03   0.975     -1.66399    1.613408
  _Istate_91 |    .152095    1.59403     0.10   0.924    -3.051229    3.355419
  _Istate_92 |   .3577279   1.869195     0.19   0.849    -3.398561    4.114017
  _Istate_93 |  (dropped)
  _Istate_94 |   .2734597   3.399148     0.08   0.936    -6.557384    7.104303
  _Istate_95 |   1.056932   3.081688     0.34   0.733    -5.135951    7.249815
_IregXy~2_75 |  (dropped)
_IregXy~2_76 |  (dropped)
_IregXy~2_77 |  (dropped)
_IregXy~2_78 |  (dropped)
_IregXy~2_79 |  -.0353891   1.817477    -0.02   0.985    -3.687745    3.616967
_IregXy~2_80 |  -.0705505   1.516025    -0.05   0.963    -3.117117    2.976016
_IregXy~2_81 |  -.1782694   1.266475    -0.14   0.889    -2.723347    2.366808
_IregXy~2_82 |  -.0860246   1.017515    -0.08   0.933    -2.130797    1.958748
_IregXy~2_83 |   .1445571   .8028964     0.18   0.858    -1.468924    1.758038
_IregXy~2_84 |    .079655   .5894083     0.14   0.893    -1.104805    1.264115
_IregXy~2_85 |  -.0883688   .4088352    -0.22   0.830    -.9099539    .7332162
_IregXy~2_86 |   -.076263   .2586029    -0.29   0.769    -.5959451    .4434191
_IregXy~2_87 |  -.0598652   .1476147    -0.41   0.687     -.356508    .2367777
_IregXy~2_88 |  (dropped)
_IregXy~2_89 |    .077015   .1039264     0.74   0.462    -.1318329    .2858629
_IregXy~2_90 |   .0420448    .141811     0.30   0.768     -.242935    .3270247
_IregXy~2_91 |   .0897524   .1656425     0.54   0.590    -.2431187    .4226235
_IregXy~2_92 |   .0784322   .1758965     0.45   0.658    -.2750451    .4319095
_IregXy~2_93 |   -.033392   .1366519    -0.24   0.808    -.3080044    .2412203
_IregXy~2_94 |  -.0749343   .0910616    -0.82   0.415    -.2579293    .1080608
_IregXy~2_95 |  (dropped)
_IregXy~2_96 |  (dropped)
_IregXy~2_97 |  (dropped)
_IregXy~3_75 |  (dropped)
_IregXy~3_76 |  (dropped)
_IregXy~3_77 |  (dropped)
_IregXy~3_78 |  (dropped)
_IregXy~3_79 |   .0293641   1.726957     0.02   0.987    -3.441086    3.499814
_IregXy~3_80 |  -.1372257   1.402687    -0.10   0.922    -2.956031     2.68158
_IregXy~3_81 |  -.3895801   1.150709    -0.34   0.736    -2.702017    1.922857
_IregXy~3_82 |  -.2594658   .8914847    -0.29   0.772    -2.050971     1.53204
_IregXy~3_83 |  -.0657906   .6666695    -0.10   0.922    -1.405513    1.273932
_IregXy~3_84 |   .0218753   .4545007     0.05   0.962     -.891478    .9352287
_IregXy~3_85 |   .0516496   .2973082     0.17   0.863    -.5458136    .6491129
_IregXy~3_86 |   .1013037    .159594     0.63   0.529    -.2194125    .4220198
_IregXy~3_87 |  (dropped)
_IregXy~3_88 |   .1703033   .1471867     1.16   0.253    -.1254794     .466086
_IregXy~3_89 |   .2045928   .1779355     1.15   0.256     -.152982    .5621676
_IregXy~3_90 |   .1722433    .195485     0.88   0.383    -.2205986    .5650852
_IregXy~3_91 |   .1876835   .1983201     0.95   0.349    -.2108556    .5862226
_IregXy~3_92 |   .1747259   .1846345     0.95   0.349    -.1963109    .5457628
_IregXy~3_93 |  -.0126427   .1594304    -0.08   0.937      -.33303    .3077446
_IregXy~3_94 |    -.02705    .101489    -0.27   0.791    -.2309998    .1768998
_IregXy~3_95 |  (dropped)
_IregXy~3_96 |  (dropped)
_IregXy~3_97 |  (dropped)
_IregXy~4_75 |  (dropped)
_IregXy~4_76 |  (dropped)
_IregXy~4_77 |  (dropped)
_IregXy~4_78 |  (dropped)
_IregXy~4_79 |    .723186   1.133599     0.64   0.526    -1.554867    3.001239
_IregXy~4_80 |   .4028801   .8826588     0.46   0.650    -1.370889    2.176649
_IregXy~4_81 |  -.1068704    .650317    -0.16   0.870    -1.413731    1.199991
_IregXy~4_82 |    -.00091   .4675893    -0.00   0.998     -.940566     .938746
_IregXy~4_83 |   .1161243   .3390908     0.34   0.733    -.5653041    .7975527
_IregXy~4_84 |   .0114317   .1733536     0.07   0.948    -.3369354    .3597988
_IregXy~4_85 |  (dropped)
_IregXy~4_86 |    .045226   .1859875     0.24   0.809    -.3285298    .4189818
_IregXy~4_87 |  -.0396258   .2618166    -0.15   0.880     -.565766    .4865144
_IregXy~4_88 |   .1094914   .2935211     0.37   0.711    -.4803613    .6993441
_IregXy~4_89 |   .2305071   .3025303     0.76   0.450    -.3774503    .8384646
_IregXy~4_90 |   .0246262   .3085845     0.08   0.937    -.5954975    .6447499
_IregXy~4_91 |   .0706708   .3229878     0.22   0.828    -.5783975    .7197392
_IregXy~4_92 |   .0963429     .28276     0.34   0.735    -.4718847    .6645704
_IregXy~4_93 |  -.1230994   .2194834    -0.56   0.577    -.5641678     .317969
_IregXy~4_94 |  -.0562925   .1125306    -0.50   0.619    -.2824312    .1698462
_IregXy~4_95 |  (dropped)
_IregXy~4_96 |  (dropped)
_IregXy~4_97 |  (dropped)
_IregXy~5_75 |  (dropped)
_IregXy~5_76 |  (dropped)
_IregXy~5_77 |  (dropped)
_IregXy~5_78 |  (dropped)
_IregXy~5_79 |   .5049156   1.501009     0.34   0.738    -2.511476    3.521307
_IregXy~5_80 |   .2720065   1.196014     0.23   0.821    -2.131474    2.675487
_IregXy~5_81 |   .1237097   .9719447     0.13   0.899    -1.829486    2.076906
_IregXy~5_82 |   .1285812   .7250812     0.18   0.860    -1.328524    1.585686
_IregXy~5_83 |   .2142098   .5110719     0.42   0.677    -.8128275    1.241247
_IregXy~5_84 |   .1348424   .3203329     0.42   0.676    -.5088906    .7785754
_IregXy~5_85 |   .0828704   .1592247     0.52   0.605    -.2371036    .4028444
_IregXy~5_86 |  (dropped)
_IregXy~5_87 |  -.0560803   .1603685    -0.35   0.728    -.3783529    .2661923
_IregXy~5_88 |  -.0029867   .2237033    -0.01   0.989    -.4525353    .4465619
_IregXy~5_89 |   .1163657   .2585662     0.45   0.655    -.4032425    .6359739
_IregXy~5_90 |   .1426147   .2577516     0.55   0.583    -.3753565    .6605859
_IregXy~5_91 |   .0991608   .2646293     0.37   0.709    -.4326317    .6309532
_IregXy~5_92 |   .1387789   .2335985     0.59   0.555    -.3306549    .6082128
_IregXy~5_93 |  -.1152525   .1718886    -0.67   0.506    -.4606756    .2301705
_IregXy~5_94 |  -.1361217   .1114481    -1.22   0.228    -.3600851    .0878417
_IregXy~5_95 |  (dropped)
_IregXy~5_96 |  (dropped)
_IregXy~5_97 |  (dropped)
_IregXy~6_75 |  (dropped)
_IregXy~6_76 |  (dropped)
_IregXy~6_77 |  (dropped)
_IregXy~6_78 |  (dropped)
_IregXy~6_79 |  -.2134336   .9046096    -0.24   0.814    -2.031315    1.604447
_IregXy~6_80 |  -.2338389   .7092996    -0.33   0.743     -1.65923    1.191552
_IregXy~6_81 |  -.5055323   .6288924    -0.80   0.425    -1.769339    .7582744
_IregXy~6_82 |  -.2370167   .4723867    -0.50   0.618    -1.186313    .7122798
_IregXy~6_83 |    .087173   .3494922     0.25   0.804    -.6151578    .7895039
_IregXy~6_84 |   .0157183   .2631035     0.06   0.953    -.5130079    .5444446
_IregXy~6_85 |  -.0700593   .1753769    -0.40   0.691    -.4224924    .2823738
_IregXy~6_86 |  (dropped)
_IregXy~6_87 |   -.184636   .1792688    -1.03   0.308    -.5448901    .1756182
_IregXy~6_88 |   .0041538   .1744798     0.02   0.981    -.3464765    .3547842
_IregXy~6_89 |   .1006889   .1865829     0.54   0.592    -.2742635    .4756414
_IregXy~6_90 |   .2941166   .2276921     1.29   0.203    -.1634479     .751681
_IregXy~6_91 |   .3790288   .2337338     1.62   0.111    -.0906769    .8487345
_IregXy~6_92 |   .3863922   .1775478     2.18   0.034     .0295964    .7431879
_IregXy~6_93 |   .0620861   .1339325     0.46   0.645    -.2070613    .3312335
_IregXy~6_94 |  -.0528845   .0844519    -0.63   0.534     -.222597    .1168279
_IregXy~6_95 |  (dropped)
_IregXy~6_96 |  (dropped)
_IregXy~6_97 |  (dropped)
_IregXy~7_75 |  (dropped)
_IregXy~7_76 |  (dropped)
_IregXy~7_77 |  (dropped)
_IregXy~7_78 |  (dropped)
_IregXy~7_79 |   .2650211   .4607847     0.58   0.568    -.6609605    1.191003
_IregXy~7_80 |   .0550472   .4176522     0.13   0.896    -.7842563    .8943507
_IregXy~7_81 |   .1178802   .4241941     0.28   0.782    -.7345699    .9703302
_IregXy~7_82 |   .0874361   .3607368     0.24   0.809    -.6374916    .8123638
_IregXy~7_83 |    .369566   .2934849     1.26   0.214    -.2202141     .959346
_IregXy~7_84 |   .1165463   .2370021     0.49   0.625    -.3597272    .5928198
_IregXy~7_85 |   .0257054   .1810562     0.14   0.888    -.3381406    .3895513
_IregXy~7_86 |   .1221186   .1266364     0.96   0.340    -.1323669     .376604
_IregXy~7_87 |  (dropped)
_IregXy~7_88 |    .247995   .1849465     1.34   0.186    -.1236689    .6196589
_IregXy~7_89 |   .4989818   .2364701     2.11   0.040     .0237773    .9741863
_IregXy~7_90 |   .5479308   .1830005     2.99   0.004     .1801775    .9156841
_IregXy~7_91 |   .7379501   .1297866     5.69   0.000     .4771342    .9987661
_IregXy~7_92 |   .5794741   .1229857     4.71   0.000     .3323251    .8266232
_IregXy~7_93 |   .2119651   .1131335     1.87   0.067    -.0153852    .4393155
_IregXy~7_94 |    .025079   .0739448     0.34   0.736    -.1235185    .1736766
_IregXy~7_95 |  (dropped)
_IregXy~7_96 |  (dropped)
_IregXy~7_97 |  (dropped)
_IregXy~8_75 |  (dropped)
_IregXy~8_76 |  (dropped)
_IregXy~8_77 |  (dropped)
_IregXy~8_78 |  (dropped)
_IregXy~8_79 |   1.060467   .6744252     1.57   0.122    -.2948409    2.415776
_IregXy~8_80 |   .7742389    .549718     1.41   0.165    -.3304608    1.878939
_IregXy~8_81 |    .414046   .5228633     0.79   0.432    -.6366872    1.464779
_IregXy~8_82 |   .2225849   .3291036     0.68   0.502    -.4387734    .8839433
_IregXy~8_83 |   .3737848   .3027049     1.23   0.223    -.2345233     .982093
_IregXy~8_84 |   .3424531   .2200973     1.56   0.126     -.099849    .7847553
_IregXy~8_85 |   .0297141   .1599377     0.19   0.853    -.2916928    .3511209
_IregXy~8_86 |  (dropped)
_IregXy~8_87 |   .0117959   .2074173     0.06   0.955    -.4050247    .4286166
_IregXy~8_88 |   .1249043   .2599888     0.48   0.633    -.3975627    .6473714
_IregXy~8_89 |   .2272797   .2795905     0.81   0.420    -.3345783    .7891378
_IregXy~8_90 |    .126604   .2248212     0.56   0.576    -.3251911    .5783991
_IregXy~8_91 |     .24923   .2219285     1.12   0.267    -.1967521     .695212
_IregXy~8_92 |   .1744125   .1873074     0.93   0.356    -.2019959    .5508209
_IregXy~8_93 |   .0379991   .1382589     0.27   0.785    -.2398426    .3158407
_IregXy~8_94 |  -.0878085   .0888492    -0.99   0.328    -.2663576    .0907406
_IregXy~8_95 |  (dropped)
_IregXy~8_96 |  (dropped)
_IregXy~8_97 |  (dropped)
_IregXy~9_75 |  (dropped)
_IregXy~9_76 |  (dropped)
_IregXy~9_77 |  (dropped)
_IregXy~9_78 |  (dropped)
_IregXy~9_79 |   .1317308   2.294651     0.06   0.954    -4.479544    4.743005
_IregXy~9_80 |  -.0370371   1.851592    -0.02   0.984     -3.75795    3.683876
_IregXy~9_81 |   .0134338   1.463973     0.01   0.993    -2.928531    2.955398
_IregXy~9_82 |  -.0856715   1.110323    -0.08   0.939    -2.316949    2.145606
_IregXy~9_83 |   .0846397   .7856149     0.11   0.915    -1.494113    1.663392
_IregXy~9_84 |   .1026337   .4962498     0.21   0.837    -.8946175    1.099885
_IregXy~9_85 |  -.1416594   .2469013    -0.57   0.569    -.6378262    .3545074
_IregXy~9_86 |  (dropped)
_IregXy~9_87 |  -.1165389   .2226164    -0.52   0.603    -.5639033    .3308255
_IregXy~9_88 |   .1010936   .3217849     0.31   0.755    -.5455574    .7477446
_IregXy~9_89 |   .2524216   .3779961     0.67   0.507      -.50719    1.012033
_IregXy~9_90 |   .3303501   .4216554     0.78   0.437    -.5169981    1.177698
_IregXy~9_91 |   .3512924   .3768251     0.93   0.356     -.405966    1.108551
_IregXy~9_92 |   .1369457   .3098938     0.44   0.660    -.4858091    .7597006
_IregXy~9_93 |   .0395049   .2472951     0.16   0.874    -.4574533    .5364631
_IregXy~9_94 |  -.0181303   .1648742    -0.11   0.913    -.3494574    .3131967
_IregXy~9_95 |  (dropped)
_IregXy~9_96 |  (dropped)
_IregXy~9_97 |  (dropped)
  _IstaXt_12 |  -.2276822   .0265968    -8.56   0.000    -.2811304   -.1742339
  _IstaXt_13 |   .1523699   .0286749     5.31   0.000     .0947454    .2099943
  _IstaXt_14 |  -.0871909   .0160745    -5.42   0.000    -.1194939   -.0548879
  _IstaXt_15 |  -.1028097   .0130577    -7.87   0.000    -.1290501   -.0765692
  _IstaXt_16 |  -.0770113   .0207056    -3.72   0.001    -.1186208   -.0354017
  _IstaXt_21 |  -.1559118   .3341611    -0.47   0.643    -.8274337      .51561
  _IstaXt_22 |  -.1313758   .3463548    -0.38   0.706    -.8274017    .5646501
  _IstaXt_23 |  -.1160727    .306887    -0.38   0.707    -.7327851    .5006397
  _IstaXt_31 |  -.1471407   .3150762    -0.47   0.643      -.78031    .4860285
  _IstaXt_32 |  -.0601024    .315318    -0.19   0.850    -.6937576    .5735528
  _IstaXt_33 |  -.1703058   .3109893    -0.55   0.586    -.7952622    .4546507
  _IstaXt_34 |  -.1106672   .3159925    -0.35   0.728    -.7456779    .5243436
  _IstaXt_35 |  -.0988642    .320201    -0.31   0.759    -.7423321    .5446038
  _IstaXt_41 |  -.0824703   .2613065    -0.32   0.754    -.6075854    .4426447
  _IstaXt_42 |  -.0775183   .2453366    -0.32   0.753    -.5705407     .415504
  _IstaXt_43 |   -.048941   .2648637    -0.18   0.854    -.5812045    .4833226
  _IstaXt_44 |  -.0626781   .2476944    -0.25   0.801    -.5604387    .4350825
  _IstaXt_45 |   .2109048   .2483859     0.85   0.400    -.2882453     .710055
  _IstaXt_46 |  -.0367328   .2547478    -0.14   0.886    -.5486676    .4752021
  _IstaXt_47 |   .1009953   .2621134     0.39   0.702    -.4257412    .6277319
  _IstaXt_51 |   .0218849   .3344376     0.07   0.948    -.6501926    .6939623
  _IstaXt_52 |   .0052072   .3407326     0.02   0.988    -.6795206    .6899351
  _IstaXt_54 |  -.0482049   .3442156    -0.14   0.889    -.7399322    .6435223
  _IstaXt_55 |  -.0320703   .2745315    -0.12   0.907     -.583762    .5196215
  _IstaXt_56 |   .1336775   .3315971     0.40   0.689    -.5326917    .8000468
  _IstaXt_57 |   .0903653   .3283224     0.28   0.784    -.5694233    .7501539
  _IstaXt_58 |    .066559   .3395641     0.20   0.845    -.6158207    .7489387
  _IstaXt_59 |  -.0615508   .3482834    -0.18   0.860    -.7614526    .6383509
  _IstaXt_61 |  -.1248726   .1783636    -0.70   0.487    -.4833076    .2335625
  _IstaXt_62 |  -.0126359   .1822675    -0.07   0.945    -.3789162    .3536444
  _IstaXt_63 |   -.081862   .1696474    -0.48   0.632    -.4227813    .2590573
  _IstaXt_64 |   .0859486   .1634703     0.53   0.601    -.2425573    .4144544
  _IstaXt_71 |  -.0758373   .0717923    -1.06   0.296    -.2201093    .0684348
  _IstaXt_72 |  -.1990786   .0545737    -3.65   0.001    -.3087485   -.0894087
  _IstaXt_73 |  -.1328876   .0632737    -2.10   0.041    -.2600408   -.0057344
  _IstaXt_74 |  -.2318102    .087837    -2.64   0.011    -.4083252   -.0552951
  _IstaXt_81 |   .1823163    .105485     1.73   0.090    -.0296638    .3942963
  _IstaXt_82 |   .0681677     .11069     0.62   0.541    -.1542722    .2906076
  _IstaXt_83 |   .1682578   .1087142     1.55   0.128    -.0502116    .3867271
  _IstaXt_84 |   -.022419   .1412084    -0.16   0.875    -.3061879    .2613499
  _IstaXt_85 |   .1286762   .1480293     0.87   0.389    -.1687998    .4261522
  _IstaXt_86 |   .0762844   .1577132     0.48   0.631    -.2406522     .393221
  _IstaXt_87 |   .2184785   .1371844     1.59   0.118    -.0572039    .4941609
  _IstaXt_88 |   .0715785   .1497605     0.48   0.635    -.2293766    .3725336
  _IstaXt_91 |  -.1264508   .5075805    -0.25   0.804    -1.146472    .8935703
  _IstaXt_92 |  -.0802033   .4730498    -0.17   0.866    -1.030833    .8704258
  _IstaXt_93 |  -.1404508   .5055599    -0.28   0.782    -1.156412    .8755099
  _IstaXt_94 |  -.0315083    .516316    -0.06   0.952    -1.069084    1.006068
  _IstaXt_95 |  -.0678845     .51593    -0.13   0.896    -1.104685    .9689155
 _IstaXt2_12 |   .0107915   .0011994     9.00   0.000     .0083813    .0132018
 _IstaXt2_13 |  -.0059933   .0012765    -4.70   0.000    -.0085585   -.0034281
 _IstaXt2_14 |   .0001439   .0009836     0.15   0.884    -.0018328    .0021205
 _IstaXt2_15 |   .0040228   .0005839     6.89   0.000     .0028494    .0051963
 _IstaXt2_16 |  -.0017378   .0011561    -1.50   0.139    -.0040611    .0005854
 _IstaXt2_21 |   .0025769   .0127589     0.20   0.841    -.0230631    .0282169
 _IstaXt2_22 |   .0018204   .0131164     0.14   0.890     -.024538    .0281789
 _IstaXt2_23 |   .0022093     .01127     0.20   0.845    -.0204386    .0248572
 _IstaXt2_31 |   .0049706   .0120144     0.41   0.681    -.0191732    .0291145
 _IstaXt2_32 |   .0001102   .0117452     0.01   0.993    -.0234927    .0237132
 _IstaXt2_33 |   .0064894   .0118032     0.55   0.585    -.0172299    .0302087
 _IstaXt2_34 |   .0031488    .011869     0.27   0.792    -.0207029    .0270004
 _IstaXt2_35 |   .0000365   .0118591     0.00   0.998    -.0237952    .0238682
 _IstaXt2_41 |   .0006058   .0105074     0.06   0.954    -.0205097    .0217213
 _IstaXt2_42 |   .0021414   .0099555     0.22   0.831    -.0178649    .0221477
 _IstaXt2_43 |   .0003715   .0109661     0.03   0.973    -.0216657    .0224087
 _IstaXt2_44 |   .0031906   .0102508     0.31   0.757    -.0174091    .0237902
 _IstaXt2_45 |  -.0129765   .0096976    -1.34   0.187    -.0324645    .0065115
 _IstaXt2_46 |   .0010605   .0103127     0.10   0.919    -.0196636    .0217847
 _IstaXt2_47 |  -.0041176   .0108427    -0.38   0.706    -.0259068    .0176716
 _IstaXt2_51 |  -.0046173   .0133373    -0.35   0.731    -.0314197     .022185
 _IstaXt2_52 |  -.0031564   .0136418    -0.23   0.818    -.0305706    .0242578
 _IstaXt2_54 |   .0001612   .0134924     0.01   0.991    -.0269528    .0272752
 _IstaXt2_55 |   -.000095   .0108743    -0.01   0.993    -.0219477    .0217577
 _IstaXt2_56 |  -.0058792   .0127367    -0.46   0.646    -.0314745    .0197161
 _IstaXt2_57 |  -.0031929   .0126784    -0.25   0.802     -.028671    .0222852
 _IstaXt2_58 |  -.0044255   .0130891    -0.34   0.737     -.030729    .0218779
 _IstaXt2_59 |   .0030022     .01341     0.22   0.824    -.0239463    .0299507
 _IstaXt2_61 |   .0035344   .0068665     0.51   0.609    -.0102645    .0173332
 _IstaXt2_62 |  -.0014124   .0068819    -0.21   0.838    -.0152421    .0124172
 _IstaXt2_63 |   .0035602   .0066487     0.54   0.595    -.0098008    .0169212
 _IstaXt2_64 |  -.0012184   .0061809    -0.20   0.845    -.0136393    .0112026
 _IstaXt2_71 |   .0056517   .0024255     2.33   0.024     .0007775    .0105258
 _IstaXt2_72 |   .0065021   .0022157     2.93   0.005     .0020494    .0109548
 _IstaXt2_73 |   .0042442   .0025553     1.66   0.103    -.0008909    .0093793
 _IstaXt2_74 |   .0096724   .0031765     3.04   0.004      .003289    .0160558
 _IstaXt2_81 |   -.004469   .0040708    -1.10   0.278    -.0126495    .0037115
 _IstaXt2_82 |  -.0008878   .0041302    -0.21   0.831    -.0091877    .0074121
 _IstaXt2_83 |  -.0075915   .0048473    -1.57   0.124    -.0173325    .0021496
 _IstaXt2_84 |  -.0007003   .0052959    -0.13   0.895    -.0113429    .0099422
 _IstaXt2_85 |    -.00555   .0056853    -0.98   0.334    -.0169751    .0058751
 _IstaXt2_86 |  -.0053692   .0058288    -0.92   0.361    -.0170826    .0063443
 _IstaXt2_87 |  -.0090229   .0048637    -1.86   0.070    -.0187968    .0007511
 _IstaXt2_88 |  -.0046502   .0051088    -0.91   0.367    -.0149167    .0056162
 _IstaXt2_91 |   .0030994   .0197381     0.16   0.876    -.0365659    .0427647
 _IstaXt2_92 |   .0024701   .0183523     0.13   0.893    -.0344102    .0393503
 _IstaXt2_93 |   .0023529   .0203787     0.12   0.909    -.0385997    .0433055
 _IstaXt2_94 |  -.0004597   .0205644    -0.02   0.982    -.0417855     .040866
 _IstaXt2_95 |  -.0016532   .0206931    -0.08   0.937    -.0432374    .0399311
       _cons |  -18.35644   10.85091    -1.69   0.097    -40.16216     3.44929
------------------------------------------------------------------------------

. 
end of do-file


. exit, clear
