--------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\chadi\OneDrive - Handelshögskolan i Stockholm\Econometrics\Econometrics\reso
> urces\textbook\AngristPischke2009\DataArchive\Autor2003\tables2-9\JOLE-speccheck_table4.log
  log type:  text
 opened on:   1 Sep 2024, 12:34:07

. set matsize 450;
set matsize ignored.
    Matrix sizes are no longer limited by c(matsize) in modern Statas.  Matrix sizes are now
    limited by edition of Stata.  See limits for more details.

. use eow-svcs.dta;
(EOW SVCs, CPS, rulings research data set)

. * Weights;
. egen empwt=mean(annemp) if year>=79 & year<=95, by(state);
(350 missing values generated)

. if "`1'"!="wt" {;
.  replace empwt=1;
(1,200 real changes made)
.  };

. * Log total employment - from BLS employment & earnings;
. gen lnemp=ln(annemp);

. * Non-business-service sector employment from CBP;
. gen nonemp= stateemp-svcemp;
(200 missing values generated)

. gen lnnon=ln(nonemp);
(200 missing values generated)

. gen svcfrac= svcemp/nonemp;
(200 missing values generated)

. * Total business services employment from CBP;
. gen bizemp= svcemp+peremp;
(200 missing values generated)

. gen lnbiz = ln(biz);
biz not found
r(111);

end of do-file

r(111);

. do "C:\Users\chadi\OneDrive - Handelshögskolan i Stockholm\Econometrics\Econometrics\resources\t
> extbook\AngristPischke2009\DataArchive\Autor2003\tables2-9\JOLE-speccheck_table4.do"

. # delimit ;
delimiter now ;
. set more 1;

. set logtype text;

. log using JOLE-speccheck_table4, replace;
log file already open
r(604);

end of do-file

r(604);

. do "C:\Users\chadi\OneDrive - Handelshögskolan i Stockholm\Econometrics\Econometrics\resources\t
> extbook\AngristPischke2009\DataArchive\Autor2003\tables2-9\JOLE-speccheck_table4.do"

. # delimit ;
delimiter now ;
. set more 1;

. set logtype text;

. cap log using JOLE-speccheck_table4, replace;

. set matsize 450;
set matsize ignored.
    Matrix sizes are no longer limited by c(matsize) in modern Statas.  Matrix sizes are now
    limited by edition of Stata.  See limits for more details.

. use eow-svcs.dta;
no; dataset in memory has changed since last saved
r(4);

end of do-file

r(4);

. do "C:\Users\chadi\OneDrive - Handelshögskolan i Stockholm\Econometrics\Econometrics\resources\t
> extbook\AngristPischke2009\DataArchive\Autor2003\tables2-9\JOLE-speccheck_table4.do"

. # delimit ;
delimiter now ;
. set more 1;

. set logtype text;

. cap log using JOLE-speccheck_table4, replace;

. set matsize 450;
set matsize ignored.
    Matrix sizes are no longer limited by c(matsize) in modern Statas.  Matrix sizes are now
    limited by edition of Stata.  See limits for more details.

. use eow-svcs.dta, clear;
(EOW SVCs, CPS, rulings research data set)

. * Weights;
. egen empwt=mean(annemp) if year>=79 & year<=95, by(state);
(350 missing values generated)

. if "`1'"!="wt" {;
.  replace empwt=1;
(1,200 real changes made)
.  };

. * Log total employment - from BLS employment & earnings;
. gen lnemp=ln(annemp);

. * Non-business-service sector employment from CBP;
. gen nonemp= stateemp-svcemp;
(200 missing values generated)

. gen lnnon=ln(nonemp);
(200 missing values generated)

. gen svcfrac= svcemp/nonemp;
(200 missing values generated)

. * Total business services employment from CBP;
. gen bizemp= svcemp+peremp;
(200 missing values generated)

. gen lnbiz = ln(bizemp);
(200 missing values generated)

. * State dummies, year dummies, and state*time trends;
. gen t=year-78;

. gen t2=t^2;

. drop if state==98;
(0 observations deleted)

. xi i.state i.year i.state*t i.state*t2 i.region*i.year;
i.state           _Istate_11-95       (naturally coded; _Istate_11 omitted)
i.year            _Iyear_74-97        (naturally coded; _Iyear_74 omitted)
i.state*t         _IstaXt_#           (coded as above)
i.state*t2        _IstaXt2_#          (coded as above)
i.region          _Iregion_1-9        (naturally coded; _Iregion_1 omitted)
i.reg~n*i.year    _IregXyea_#_#       (coded as above)

. drop _Iyear_77 - _Iyear_79;

. * Working sample;
. gen year1 = year>=79 & year<=95;

. keep if year1;
(350 observations deleted)

. gen year2 = ((int(year/2)*2 + 1)==year);

. gen year4 = (year==79 | year==83 | year==87 | year==91 | year==95);

. * Generate more aggregate demos;
. gen clp=clg+gtc;

. gen a1624=m1619+m2024+f1619+f2024;

. gen a2554=m2554+f2554;

. gen a55up=m5564+m65up+f5564+f65up;

. gen fem=f1619+f2024+f2554+f5564+f65up;

. gen white=rs_wm+rs_wf;

. gen black=rs_bm+rs_bf;

. gen other=rs_om+rs_of;

. gen married=marfem+marmale;

. * Modify union variable so that:
>   1 - We don't use interpolated data for 1979 & 1981
>   2 - Turn from fraction into percent so that coefficient will be friendly size;
. replace unmem=. if year==79 | year==81;
(100 real changes made, 100 to missing)

. replace unmem=unmem*100;
(750 real changes made)

. * Alternative legal characterizations;
. gen mcount = mico+mppa+mgfa;

. gen many = min(mcount,1);

. gen mone = mcount==1;

. gen mtwo = mcount==2;

. gen mthree = mcount==3;

. ****************;
. ** Table 4
> ****************;
. reg lnths mico mppa mgfa _Iyear* _Istate* _IstaXt_* [aw=empwt], cluster(state);
(sum of wgt is 850)
note: _Iyear_75 omitted because of collinearity.
note: _Iyear_76 omitted because of collinearity.
note: _Iyear_96 omitted because of collinearity.
note: _Iyear_97 omitted because of collinearity.

Linear regression                               Number of obs     =        850
                                                F(17, 49)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.9878
                                                Root MSE          =     .20363

                                 (Std. err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        mico |   .1374282   .0617569     2.23   0.031     .0133231    .2615333
        mppa |  -.0225254   .0582912    -0.39   0.701    -.1396659     .094615
        mgfa |  -.0787631   .0927979    -0.85   0.400    -.2652476    .1077213
   _Iyear_75 |          0  (omitted)
   _Iyear_76 |          0  (omitted)
   _Iyear_80 |   .0335385   .0312465     1.07   0.288    -.0292538    .0963307
   _Iyear_81 |   .0722644    .054269     1.33   0.189    -.0367932    .1813221
   _Iyear_82 |   .0904163    .057519     1.57   0.122    -.0251725     .206005
   _Iyear_83 |   .1539363    .050889     3.02   0.004     .0516711    .2562015
   _Iyear_84 |   .5774657   .0502711    11.49   0.000     .4764421    .6784892
   _Iyear_85 |   .8411854     .05796    14.51   0.000     .7247105    .9576603
   _Iyear_86 |   .9923652   .0581129    17.08   0.000      .875583    1.109148
   _Iyear_87 |   1.162606   .0612425    18.98   0.000     1.039535    1.285677
   _Iyear_88 |   1.532503   .0449303    34.11   0.000     1.442213    1.622794
   _Iyear_89 |   1.683325   .0409703    41.09   0.000     1.600992    1.765658
   _Iyear_90 |    1.77749   .0480664    36.98   0.000     1.680897    1.874083
   _Iyear_91 |    1.85856    .043357    42.87   0.000     1.771431    1.945689
   _Iyear_92 |    2.05528   .0373913    54.97   0.000     1.980139     2.13042
   _Iyear_93 |   2.379629   .0350995    67.80   0.000     2.309094    2.450164
   _Iyear_94 |   2.583523   .0345223    74.84   0.000     2.514148    2.652898
   _Iyear_95 |   2.740245    .034752    78.85   0.000     2.670408    2.810082
   _Iyear_96 |          0  (omitted)
   _Iyear_97 |          0  (omitted)
  _Istate_12 |   .9500805   .1510251     6.29   0.000     .6465842    1.253577
  _Istate_13 |   -1.63111   .0645135   -25.28   0.000    -1.760755   -1.501466
  _Istate_14 |   4.023674   .1440251    27.94   0.000     3.734245    4.313103
  _Istate_15 |   1.463578   .0617569    23.70   0.000     1.339473    1.587683
  _Istate_16 |   3.393604   .1185249    28.63   0.000     3.155419    3.631789
  _Istate_21 |    4.98739   .0395062   126.24   0.000     4.907999    5.066781
  _Istate_22 |   3.912854   .0902373    43.36   0.000     3.731515    4.094192
  _Istate_23 |   3.945078   .0962728    40.98   0.000     3.751611    4.138546
  _Istate_31 |   3.596754   .0437882    82.14   0.000     3.508758     3.68475
  _Istate_32 |   2.590203   .1099965    23.55   0.000     2.369157    2.811249
  _Istate_33 |   3.786204   .0582912    64.95   0.000     3.669064    3.903345
  _Istate_34 |   3.409795    .063976    53.30   0.000      3.28123     3.53836
  _Istate_35 |   3.066902   .0902373    33.99   0.000     2.885563     3.24824
  _Istate_41 |   3.290997   .0480008    68.56   0.000     3.194536    3.387458
  _Istate_42 |   1.680789   .0768903    21.86   0.000     1.526272    1.835306
  _Istate_43 |    2.88882   .0267375   108.04   0.000     2.835089    2.942551
  _Istate_44 |  -1.526778   .0565907   -26.98   0.000    -1.640501   -1.413054
  _Istate_45 |  -.8569325   .0480886   -17.82   0.000    -.9535702   -.7602948
  _Istate_46 |   1.264813   .0478831    26.41   0.000     1.168589    1.361038
  _Istate_47 |   1.045407   .0748487    13.97   0.000     .8949933    1.195821
  _Istate_51 |   1.524352   .0667642    22.83   0.000     1.390184    1.658519
  _Istate_52 |   3.014136   .0819458    36.78   0.000      2.84946    3.178812
  _Istate_54 |   2.909558   .0488132    59.61   0.000     2.811465    3.007652
  _Istate_55 |   .8599015    .105724     8.13   0.000     .6474412    1.072362
  _Istate_56 |   2.387677   .0605788    39.41   0.000      2.26594    2.509415
  _Istate_57 |   1.579372   .0768903    20.54   0.000     1.424856    1.733889
  _Istate_58 |   3.005462   .0617569    48.67   0.000     2.881357    3.129567
  _Istate_59 |   3.661666   .0617569    59.29   0.000     3.537561    3.785771
  _Istate_61 |   1.790057   .0541964    33.03   0.000     1.681145    1.898969
  _Istate_62 |   2.183418    .028541    76.50   0.000     2.126063    2.240773
  _Istate_63 |   1.357491   .0797844    17.01   0.000     1.197158    1.517824
  _Istate_64 |  -.5831722   .0592248    -9.85   0.000    -.7021889   -.4641554
  _Istate_71 |    .626959   .0835174     7.51   0.000     .4591244    .7947936
  _Istate_72 |   3.116304   .0617569    50.46   0.000     2.992199    3.240409
  _Istate_73 |   2.294751   .0307068    74.73   0.000     2.233043    2.356459
  _Istate_74 |   4.131405   .0675315    61.18   0.000     3.995695    4.267114
  _Istate_81 |  -1.846293   .1080316   -17.09   0.000    -2.063391   -1.629195
  _Istate_82 |  -.5652552   .0670396    -8.43   0.000    -.6999763    -.430534
  _Istate_83 |    -1.2135   .0652632   -18.59   0.000    -1.344652   -1.082349
  _Istate_84 |   2.844885   .0488132    58.28   0.000     2.746791    2.942979
  _Istate_85 |   .4693829   .0206846    22.69   0.000     .4278156    .5109501
  _Istate_86 |   2.511326   .0487173    51.55   0.000     2.413425    2.609227
  _Istate_87 |   .6637228    .070063     9.47   0.000      .522926    .8045196
  _Istate_88 |    .554182   .0544197    10.18   0.000     .4448215    .6635424
  _Istate_91 |    2.26173   .0025717   879.48   0.000     2.256562    2.266898
  _Istate_92 |   1.732019   .0582912    29.71   0.000     1.614879     1.84916
  _Istate_93 |   5.341638    .092082    58.01   0.000     5.156592    5.526683
  _Istate_94 |  -1.045848   .0526583   -19.86   0.000    -1.151669   -.9400276
  _Istate_95 |   1.147398   .0816288    14.06   0.000     .9833588    1.311437
  _IstaXt_12 |  -.0366638   .0054491    -6.73   0.000    -.0476142   -.0257133
  _IstaXt_13 |   .0370024   .0059737     6.19   0.000     .0249978     .049007
  _IstaXt_14 |  -.1199306   .0052384   -22.89   0.000    -.1304576   -.1094035
  _IstaXt_15 |  -.0631772          .        .       .            .           .
  _IstaXt_16 |  -.1336062   .0049726   -26.87   0.000     -.143599   -.1236134
  _IstaXt_21 |  -.1362045   .0031787   -42.85   0.000    -.1425922   -.1298167
  _IstaXt_22 |  -.1226786   .0047953   -25.58   0.000    -.1323152   -.1130421
  _IstaXt_23 |  -.0974829          .        .       .            .           .
  _IstaXt_31 |  -.0571067   .0033266   -17.17   0.000    -.0637916   -.0504217
  _IstaXt_32 |  -.0452463   .0054491    -8.30   0.000    -.0561967   -.0342958
  _IstaXt_33 |   -.059877          .        .       .            .           .
  _IstaXt_34 |  -.0524816   .0012109   -43.34   0.000     -.054915   -.0500482
  _IstaXt_35 |  -.0862637   .0047953   -17.99   0.000    -.0959002   -.0766271
  _IstaXt_41 |  -.0980004   .0054083   -18.12   0.000    -.1088687    -.087132
  _IstaXt_42 |  -.0738249   .0061028   -12.10   0.000    -.0860889    -.061561
  _IstaXt_43 |  -.0752967   .0052682   -14.29   0.000    -.0858836   -.0647099
  _IstaXt_44 |  -.0407735   .0058078    -7.02   0.000    -.0524447   -.0291023
  _IstaXt_45 |  -.0391381   .0055116    -7.10   0.000    -.0502141   -.0280621
  _IstaXt_46 |  -.0444211   .0055116    -8.06   0.000     -.055497   -.0333451
  _IstaXt_47 |  -.0105788   .0044332    -2.39   0.021    -.0194876     -.00167
  _IstaXt_51 |  -.0866661   .0059136   -14.66   0.000      -.09855   -.0747823
  _IstaXt_52 |  -.0932653   .0048402   -19.27   0.000     -.102992   -.0835386
  _IstaXt_54 |  -.0672718   .0052073   -12.92   0.000    -.0777362   -.0568073
  _IstaXt_55 |  -.0891017   .0052978   -16.82   0.000    -.0997479   -.0784554
  _IstaXt_56 |   .0021807   .0047147     0.46   0.646    -.0072939    .0116553
  _IstaXt_57 |   .0083442   .0061028     1.37   0.178    -.0039198    .0206082
  _IstaXt_58 |  -.0352676          .        .       .            .           .
  _IstaXt_59 |  -.0062965          .        .       .            .           .
  _IstaXt_61 |  -.0343387   .0045754    -7.51   0.000    -.0435334   -.0251441
  _IstaXt_62 |  -.0082071   .0042386    -1.94   0.059    -.0167249    .0003108
  _IstaXt_63 |    .004203   .0094273     0.45   0.658    -.0147419    .0231478
  _IstaXt_64 |   .0873112   .0051433    16.98   0.000     .0769753    .0976471
  _IstaXt_71 |   .0438618   .0043545    10.07   0.000     .0351112    .0526124
  _IstaXt_72 |  -.1034155          .        .       .            .           .
  _IstaXt_73 |  -.0723585   .0050431   -14.35   0.000     -.082493    -.062224
  _IstaXt_74 |   -.053002   .0055758    -9.51   0.000     -.064207    -.041797
  _IstaXt_81 |   .0400339   .0067622     5.92   0.000     .0264447    .0536231
  _IstaXt_82 |   .0049268   .0079606     0.62   0.539    -.0110707    .0209242
  _IstaXt_83 |  -.0478072   .0066715    -7.17   0.000    -.0612141   -.0344004
  _IstaXt_84 |   -.088422   .0052073   -16.98   0.000    -.0988865   -.0779576
  _IstaXt_85 |  -.0172473    .003563    -4.84   0.000    -.0244074   -.0100872
  _IstaXt_86 |  -.0407655   .0088676    -4.60   0.000    -.0585856   -.0229453
  _IstaXt_87 |    .028913   .0061592     4.69   0.000     .0165356    .0412904
  _IstaXt_88 |  -.0148517   .0092721    -1.60   0.116    -.0334848    .0037813
  _IstaXt_91 |  -.0536976   .0042861   -12.53   0.000    -.0623109   -.0450843
  _IstaXt_92 |  -.0276636          .        .       .            .           .
  _IstaXt_93 |  -.0991496   .0018196   -54.49   0.000    -.1028062    -.095493
  _IstaXt_94 |  -.0339381   .0077745    -4.37   0.000    -.0495616   -.0183145
  _IstaXt_95 |  -.0945871   .0052903   -17.88   0.000    -.1052184   -.0839559
       _cons |   6.117107   .0678351    90.18   0.000     5.980788    6.253427
------------------------------------------------------------------------------

. reg lnths many _Iyear* _Istate* _IstaXt_* [aw=empwt], cluster(state);
(sum of wgt is 850)
note: _Iyear_75 omitted because of collinearity.
note: _Iyear_76 omitted because of collinearity.
note: _Iyear_96 omitted because of collinearity.
note: _Iyear_97 omitted because of collinearity.

Linear regression                               Number of obs     =        850
                                                F(16, 49)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.9875
                                                Root MSE          =     .20527

                                 (Std. err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        many |   .0712801   .0650938     1.10   0.279    -.0595307     .202091
   _Iyear_75 |          0  (omitted)
   _Iyear_76 |          0  (omitted)
   _Iyear_80 |   .0226302   .0339809     0.67   0.509    -.0456569    .0909173
   _Iyear_81 |   .0569287   .0531395     1.07   0.289    -.0498591    .1637166
   _Iyear_82 |   .0722769   .0580976     1.24   0.219    -.0444747    .1890285
   _Iyear_83 |   .1445521   .0533945     2.71   0.009     .0372519    .2518524
   _Iyear_84 |   .5696757   .0522996    10.89   0.000     .4645759    .6747756
   _Iyear_85 |   .8367546   .0613738    13.63   0.000     .7134194    .9600898
   _Iyear_86 |   .9914049   .0575934    17.21   0.000     .8756666    1.107143
   _Iyear_87 |   1.166487   .0606304    19.24   0.000     1.044646    1.288329
   _Iyear_88 |   1.541008   .0467328    32.97   0.000     1.447095    1.634922
   _Iyear_89 |   1.684157   .0422353    39.88   0.000     1.599282    1.769032
   _Iyear_90 |   1.776323   .0499916    35.53   0.000     1.675861    1.876785
   _Iyear_91 |   1.855395   .0464468    39.95   0.000     1.762057    1.948733
   _Iyear_92 |   2.047116   .0396101    51.68   0.000     1.967516    2.126715
   _Iyear_93 |   2.369467   .0363063    65.26   0.000     2.296507    2.442428
   _Iyear_94 |   2.569788   .0342763    74.97   0.000     2.500907    2.638669
   _Iyear_95 |   2.724511   .0346964    78.52   0.000     2.654786    2.794236
   _Iyear_96 |          0  (omitted)
   _Iyear_97 |          0  (omitted)
  _Istate_12 |   .6669017   1.38e-08  4.8e+07   0.000     .6669017    .6669017
  _Istate_13 |  -1.698468   .0703587   -24.14   0.000    -1.839859   -1.557077
  _Istate_14 |   3.745795   1.34e-08  2.8e+08   0.000     3.745795    3.745795
  _Istate_15 |    1.39743   .0650938    21.47   0.000     1.266619     1.52824
  _Istate_16 |   3.184376   .0153162   207.91   0.000     3.153597    3.215155
  _Istate_21 |   4.945075   .0416409   118.76   0.000     4.861394    5.028755
  _Istate_22 |   3.763856   .0153162   245.74   0.000     3.733077    3.794635
  _Istate_23 |   3.785124   1.24e-08  3.1e+08   0.000     3.785124    3.785125
  _Istate_31 |   3.550298   .0416409    85.26   0.000     3.466617    3.633978
  _Istate_32 |   2.393871   1.52e-09  1.6e+09   0.000     2.393871    2.393871
  _Istate_33 |   3.763679   8.44e-09  4.5e+08   0.000     3.763679    3.763679
  _Istate_34 |   3.354933   1.06e-08  3.2e+08   0.000     3.354933    3.354933
  _Istate_35 |   2.917905   .0153162   190.51   0.000     2.887126    2.948684
  _Istate_41 |   3.241636   .0526494    61.57   0.000     3.135833    3.347439
  _Istate_42 |    1.58585   .0703587    22.54   0.000     1.444459    1.727242
  _Istate_43 |   2.886655   .0526494    54.83   0.000     2.780852    2.992458
  _Istate_44 |  -1.584045    .062222   -25.46   0.000    -1.709084   -1.459005
  _Istate_45 |   -.903147   .0526494   -17.15   0.000     -1.00895   -.7973441
  _Istate_46 |   1.217274   .0526494    23.12   0.000     1.111471    1.323077
  _Istate_47 |   .9335913   .0291965    31.98   0.000     .8749188    .9922638
  _Istate_51 |   1.508954   .0871108    17.32   0.000     1.333898    1.684009
  _Istate_52 |   2.885141   .0291965    98.82   0.000     2.826469    2.943814
  _Istate_54 |   2.857878   .0526494    54.28   0.000     2.752075    2.963681
  _Istate_55 |   .6746854   2.85e-09  2.4e+08   0.000     .6746853    .6746854
  _Istate_56 |   2.329116   .0703587    33.10   0.000     2.187725    2.470508
  _Istate_57 |   1.484434   .0703587    21.10   0.000     1.343042    1.625825
  _Istate_58 |   2.939314   .0650938    45.16   0.000     2.808503    3.070125
  _Istate_59 |   3.595518   .0650938    55.24   0.000     3.464707    3.726329
  _Istate_61 |   1.732248   .0526494    32.90   0.000     1.626446    1.838051
  _Istate_62 |   2.152755   .0291965    73.73   0.000     2.094083    2.211428
  _Istate_63 |   1.294682   .0823245    15.73   0.000     1.129245    1.460119
  _Istate_64 |  -.6244893   .0823245    -7.59   0.000    -.7899266   -.4590521
  _Istate_71 |   .4951403   .0153162    32.33   0.000     .4643613    .5259193
  _Istate_72 |   3.050156   .0650938    46.86   0.000     2.919345    3.180966
  _Istate_73 |   2.283755   7.72e-09  3.0e+08   0.000     2.283755    2.283755
  _Istate_74 |   4.050003    .062222    65.09   0.000     3.924963    4.175042
  _Istate_81 |  -2.048931   .0153162  -133.78   0.000     -2.07971   -2.018152
  _Istate_82 |  -.5594027   8.48e-09 -6.6e+07   0.000    -.5594027   -.5594027
  _Istate_83 |  -1.260088   .0703587   -17.91   0.000    -1.401479   -1.118696
  _Istate_84 |   2.793205   .0526494    53.05   0.000     2.687402    2.899008
  _Istate_85 |   .4495123   .0153162    29.35   0.000     .4187333    .4802913
  _Istate_86 |   2.466016   .0526494    46.84   0.000     2.360213    2.571819
  _Istate_87 |    .593531   .0770595     7.70   0.000      .438674    .7483879
  _Istate_88 |   .5205351   .0526494     9.89   0.000     .4147323     .626338
  _Istate_91 |   2.260736   1.22e-08  1.9e+08   0.000     2.260736    2.260736
  _Istate_92 |   1.709494   1.20e-08  1.4e+08   0.000     1.709494    1.709494
  _Istate_93 |   5.258882   1.07e-08  4.9e+08   0.000     5.258882    5.258882
  _Istate_94 |  -1.110267   .0526494   -21.09   0.000     -1.21607   -1.004465
  _Istate_95 |    1.02219   .0416409    24.55   0.000     .9385094     1.10587
  _IstaXt_12 |  -.0245377   1.48e-09 -1.7e+07   0.000    -.0245378   -.0245377
  _IstaXt_13 |   .0404203   .0052649     7.68   0.000       .02984    .0510006
  _IstaXt_14 |  -.1082462   1.63e-09 -6.6e+07   0.000    -.1082462   -.1082462
  _IstaXt_15 |  -.0631772   6.03e-10 -1.0e+08   0.000    -.0631772   -.0631772
  _IstaXt_16 |  -.1258744   .0012763   -98.62   0.000    -.1284393   -.1233095
  _IstaXt_21 |  -.1327998   .0033504   -39.64   0.000    -.1395327   -.1260669
  _IstaXt_22 |  -.1134024   .0012763   -88.85   0.000    -.1159674   -.1108375
  _IstaXt_23 |  -.0974829   1.38e-09 -7.1e+07   0.000     -.097483   -.0974829
  _IstaXt_31 |  -.0535363   .0033504   -15.98   0.000    -.0602693   -.0468034
  _IstaXt_32 |  -.0331202   1.49e-09 -2.2e+07   0.000    -.0331202   -.0331202
  _IstaXt_33 |   -.059877   1.40e-09 -4.3e+07   0.000     -.059877    -.059877
  _IstaXt_34 |  -.0497869   1.70e-09 -2.9e+07   0.000    -.0497869   -.0497869
  _IstaXt_35 |  -.0769875   .0012763   -60.32   0.000    -.0795524   -.0744226
  _IstaXt_41 |  -.0957174   .0041481   -23.07   0.000    -.1040534   -.0873814
  _IstaXt_42 |  -.0692861   .0052649   -13.16   0.000    -.0798664   -.0587059
  _IstaXt_43 |  -.0846925   .0041481   -20.42   0.000    -.0930285   -.0763565
  _IstaXt_44 |  -.0378972   .0047863    -7.92   0.000    -.0475157   -.0282788
  _IstaXt_45 |  -.0369103   .0041481    -8.90   0.000    -.0452463   -.0285743
  _IstaXt_46 |  -.0421933   .0041481   -10.17   0.000    -.0505293   -.0338573
  _IstaXt_47 |  -.0039225   .0023932    -1.64   0.108    -.0087317    .0008867
  _IstaXt_51 |  -.0962277   .0041481   -23.20   0.000    -.1045637   -.0878917
  _IstaXt_52 |  -.0855985   .0023932   -35.77   0.000    -.0904077   -.0807893
  _IstaXt_54 |  -.0648784   .0041481   -15.64   0.000    -.0732144   -.0565424
  _IstaXt_55 |  -.0773125   9.49e-10 -8.1e+07   0.000    -.0773125   -.0773125
  _IstaXt_56 |  -.0054065   .0052649    -1.03   0.310    -.0159868    .0051737
  _IstaXt_57 |    .012883   .0052649     2.45   0.018     .0023027    .0234633
  _IstaXt_58 |  -.0352676   1.11e-09 -3.2e+07   0.000    -.0352676   -.0352676
  _IstaXt_59 |  -.0062965   1.40e-09 -4.5e+06   0.000    -.0062965   -.0062965
  _IstaXt_61 |  -.0315589   .0041481    -7.61   0.000    -.0398949   -.0232229
  _IstaXt_62 |  -.0074314   .0023932    -3.11   0.003    -.0122407   -.0026222
  _IstaXt_63 |   .0030899   .0057436     0.54   0.593    -.0084522     .014632
  _IstaXt_64 |   .0790342   .0057436    13.76   0.000     .0674921    .0905763
  _IstaXt_71 |   .0521275   .0012763    40.84   0.000     .0495625    .0546924
  _IstaXt_72 |  -.1034155   1.12e-09 -9.2e+07   0.000    -.1034155   -.1034155
  _IstaXt_73 |  -.0737117          .        .       .            .           .
  _IstaXt_74 |   -.048784   .0047863   -10.19   0.000    -.0584024   -.0391655
  _IstaXt_81 |   .0462666   .0012763    36.25   0.000     .0437017    .0488315
  _IstaXt_82 |  -.0018299   9.05e-10 -2.0e+06   0.000    -.0018299   -.0018299
  _IstaXt_83 |   -.047285   .0052649    -8.98   0.000    -.0578653   -.0367047
  _IstaXt_84 |  -.0860286   .0041481   -20.74   0.000    -.0943646   -.0776927
  _IstaXt_85 |  -.0173857   .0012763   -13.62   0.000    -.0199507   -.0148208
  _IstaXt_86 |  -.0447426   .0041481   -10.79   0.000    -.0530786   -.0364066
  _IstaXt_87 |   .0326551    .005584     5.85   0.000     .0214336    .0438767
  _IstaXt_88 |  -.0192424   .0041481    -4.64   0.000    -.0275784   -.0109064
  _IstaXt_91 |  -.0553539   1.03e-09 -5.4e+07   0.000    -.0553539   -.0553539
  _IstaXt_92 |  -.0276636   1.20e-09 -2.3e+07   0.000    -.0276636   -.0276636
  _IstaXt_93 |   -.100694          .        .       .            .           .
  _IstaXt_94 |  -.0366743   .0041481    -8.84   0.000    -.0450103   -.0283383
  _IstaXt_95 |  -.0876262   .0033504   -26.15   0.000    -.0943591   -.0808933
       _cons |   6.189482   .0590181   104.87   0.000     6.070881    6.308083
------------------------------------------------------------------------------

. reg lnths mcount _Iyear* _Istate* _IstaXt_* [aw=empwt], cluster(state);
(sum of wgt is 850)
note: _Iyear_75 omitted because of collinearity.
note: _Iyear_76 omitted because of collinearity.
note: _Iyear_96 omitted because of collinearity.
note: _Iyear_97 omitted because of collinearity.

Linear regression                               Number of obs     =        850
                                                F(16, 49)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.9875
                                                Root MSE          =     .20546

                                 (Std. err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      mcount |   .0342485   .0315429     1.09   0.283    -.0291394    .0976364
   _Iyear_75 |          0  (omitted)
   _Iyear_76 |          0  (omitted)
   _Iyear_80 |   .0251049   .0322651     0.78   0.440    -.0397342     .089944
   _Iyear_81 |   .0623961    .052343     1.19   0.239     -.042791    .1675832
   _Iyear_82 |    .080052   .0563424     1.42   0.162    -.0331724    .1932763
   _Iyear_83 |   .1584493   .0512159     3.09   0.003     .0555271    .2613716
   _Iyear_84 |   .5824001   .0494332    11.78   0.000     .4830603    .6817399
   _Iyear_85 |   .8457333   .0600615    14.08   0.000     .7250353    .9664314
   _Iyear_86 |   .9984701   .0581083    17.18   0.000      .881697    1.115243
   _Iyear_87 |    1.17101   .0625318    18.73   0.000     1.045348    1.296672
   _Iyear_88 |   1.544932    .044683    34.58   0.000     1.455138    1.634726
   _Iyear_89 |   1.686796   .0411008    41.04   0.000     1.604201    1.769391
   _Iyear_90 |   1.779733   .0476971    37.31   0.000     1.683882    1.875584
   _Iyear_91 |   1.859576   .0437579    42.50   0.000     1.771641    1.947511
   _Iyear_92 |   2.052808   .0370304    55.44   0.000     1.978393    2.127223
   _Iyear_93 |    2.37593   .0339641    69.95   0.000     2.307677    2.444184
   _Iyear_94 |   2.576336   .0344119    74.87   0.000     2.507183    2.645489
   _Iyear_95 |   2.731831   .0345584    79.05   0.000     2.662383    2.801278
   _Iyear_96 |          0  (omitted)
   _Iyear_97 |          0  (omitted)
  _Istate_12 |   .6437336   .0213379    30.17   0.000     .6008536    .6866137
  _Istate_13 |  -1.732199   .0398925   -43.42   0.000    -1.812366   -1.652032
  _Istate_14 |   3.730686    .013916   268.09   0.000      3.70272    3.758651
  _Istate_15 |   1.360398   .0315429    43.13   0.000      1.29701    1.423786
  _Istate_16 |   3.152243   .0141479   222.81   0.000     3.123812    3.180674
  _Istate_21 |   4.921385   .0201782   243.90   0.000     4.880836    4.961935
  _Istate_22 |   3.757913   .0099731   376.80   0.000     3.737871    3.777955
  _Istate_23 |   3.785124          .        .       .            .           .
  _Istate_31 |   3.520313   .0143799   244.81   0.000     3.491415     3.54921
  _Istate_32 |   2.402937   .0083496   287.79   0.000     2.386158    2.419716
  _Istate_33 |   3.729431   .0315429   118.23   0.000     3.666043    3.792818
  _Istate_34 |   3.328743   .0241211   138.00   0.000      3.28027    3.377216
  _Istate_35 |   2.911961   .0099731   291.98   0.000      2.89192    2.932003
  _Istate_41 |   3.217979    .031311   102.77   0.000     3.155058    3.280901
  _Istate_42 |   1.554889   .0424438    36.63   0.000     1.469595    1.640183
  _Istate_43 |   2.847133   .0166992   170.50   0.000     2.813575    2.880692
  _Istate_44 |  -1.610377   .0385009   -41.83   0.000    -1.687747   -1.533006
  _Istate_45 |  -.9220187   .0357177   -25.81   0.000    -.9937961   -.8502412
  _Istate_46 |   1.196387   .0338623    35.33   0.000     1.128339    1.264436
  _Istate_47 |   .9154706   .0127563    71.77   0.000     .8898358    .9411054
  _Istate_51 |   1.459396   .0422119    34.57   0.000     1.374569    1.544224
  _Istate_52 |   2.871302   .0166992   171.94   0.000     2.837743     2.90486
  _Istate_54 |   2.830696   .0280639   100.87   0.000       2.7743    2.887093
  _Istate_55 |    .680981   .0057983   117.44   0.000     .6693289    .6926332
  _Istate_56 |    2.28909   .0340942    67.14   0.000     2.220575    2.357604
  _Istate_57 |   1.453472   .0424438    34.24   0.000     1.368178    1.538766
  _Istate_58 |   2.902283   .0315429    92.01   0.000     2.838895     2.96567
  _Istate_59 |   3.558487   .0315429   112.81   0.000     3.495099    3.621874
  _Istate_61 |   1.695749   .0194824    87.04   0.000     1.656598      1.7349
  _Istate_62 |   2.134634   .0127563   167.34   0.000        2.109    2.160269
  _Istate_63 |   1.256914   .0482421    26.05   0.000     1.159968     1.35386
  _Istate_64 |  -.6713235   .0398925   -16.83   0.000    -.7514905   -.5911565
  _Istate_71 |    .484916   .0060303    80.41   0.000     .4727977    .4970343
  _Istate_72 |   3.013124   .0315429    95.52   0.000     2.949736    3.076512
  _Istate_73 |   2.287784   .0037109   616.50   0.000     2.280327    2.295242
  _Istate_74 |   4.017375   .0327026   122.85   0.000     3.951657    4.083093
  _Istate_81 |  -2.060918   .0044067  -467.67   0.000    -2.069773   -2.052062
  _Istate_82 |  -.5813117   .0201782   -28.81   0.000    -.6218613   -.5407621
  _Istate_83 |  -1.280472    .052185   -24.54   0.000    -1.385342   -1.175602
  _Istate_84 |   2.766023   .0280639    98.56   0.000     2.709626    2.822419
  _Istate_85 |   .4342514   .0013916   312.05   0.000     .4314549     .437048
  _Istate_86 |   2.441604   .0306152    79.75   0.000     2.380081    2.503128
  _Istate_87 |   .5620316    .048706    11.54   0.000     .4641532    .6599099
  _Istate_88 |   .4981379   .0324707    15.34   0.000     .4328857    .5633901
  _Istate_91 |   2.259225   .0013916  1623.47   0.000     2.256429    2.262022
  _Istate_92 |   1.675246   .0315429    53.11   0.000     1.611858    1.738633
  _Istate_93 |   5.198443    .055664    93.39   0.000     5.086582    5.310304
  _Istate_94 |  -1.140471   .0252807   -45.11   0.000    -1.191275   -1.089668
  _Istate_95 |   1.004796   .0259765    38.68   0.000     .9525944    1.056998
  _IstaXt_12 |  -.0275597   .0027832    -9.90   0.000    -.0331527   -.0219666
  _IstaXt_13 |   .0404775   .0052572     7.70   0.000     .0299129    .0510422
  _IstaXt_14 |  -.1119397   .0034017   -32.91   0.000    -.1187756   -.1051037
  _IstaXt_15 |  -.0631772          .        .       .            .           .
  _IstaXt_16 |  -.1285899   .0037882   -33.94   0.000    -.1362027   -.1209771
  _IstaXt_21 |  -.1308938   .0016235   -80.62   0.000    -.1341564   -.1276311
  _IstaXt_22 |  -.1154464   .0031698   -36.42   0.000    -.1218163   -.1090766
  _IstaXt_23 |  -.0974829   2.22e-10 -4.4e+08   0.000    -.0974829   -.0974829
  _IstaXt_31 |  -.0513785   .0013916   -36.92   0.000     -.054175    -.048582
  _IstaXt_32 |  -.0361422   .0027832   -12.99   0.000    -.0417352   -.0305491
  _IstaXt_33 |   -.059877   8.18e-10 -7.3e+07   0.000     -.059877    -.059877
  _IstaXt_34 |  -.0504585   .0006185   -81.58   0.000    -.0517014   -.0492156
  _IstaXt_35 |  -.0790315   .0031698   -24.93   0.000    -.0854013   -.0726616
  _IstaXt_41 |  -.0962955    .004716   -20.42   0.000    -.1057726   -.0868184
  _IstaXt_42 |  -.0693129   .0053345   -12.99   0.000    -.0800329   -.0585929
  _IstaXt_43 |  -.0821648   .0018555   -44.28   0.000    -.0858935   -.0784361
  _IstaXt_44 |  -.0381962   .0051025    -7.49   0.000    -.0484502   -.0279423
  _IstaXt_45 |  -.0375724   .0047933    -7.84   0.000    -.0472049   -.0279399
  _IstaXt_46 |  -.0428554   .0047933    -8.94   0.000    -.0524878   -.0332229
  _IstaXt_47 |  -.0050793    .003479    -1.46   0.151    -.0120706     .001912
  _IstaXt_51 |  -.0938679   .0020101   -46.70   0.000    -.0979073   -.0898284
  _IstaXt_52 |  -.0870071   .0037109   -23.45   0.000    -.0944645   -.0795497
  _IstaXt_54 |  -.0652886   .0045614   -14.31   0.000     -.074455   -.0561222
  _IstaXt_55 |  -.0802505   .0027059   -29.66   0.000    -.0856882   -.0748128
  _IstaXt_56 |  -.0024113   .0025513    -0.95   0.349    -.0075383    .0027156
  _IstaXt_57 |   .0128563   .0053345     2.41   0.020     .0021363    .0235763
  _IstaXt_58 |  -.0352676   8.84e-10 -4.0e+07   0.000    -.0352676   -.0352676
  _IstaXt_59 |  -.0062965          .        .       .            .           .
  _IstaXt_61 |  -.0313815   .0040202    -7.81   0.000    -.0394604   -.0233027
  _IstaXt_62 |  -.0085882    .003479    -2.47   0.017    -.0155796   -.0015969
  _IstaXt_63 |   .0033355   .0055664     0.60   0.552    -.0078506    .0145216
  _IstaXt_64 |   .0823017   .0027832    29.57   0.000     .0767087    .0878948
  _IstaXt_71 |   .0503353   .0029378    17.13   0.000     .0444315    .0562391
  _IstaXt_72 |  -.1034155          .        .       .            .           .
  _IstaXt_73 |  -.0763979    .002474   -30.88   0.000    -.0813695   -.0714263
  _IstaXt_74 |  -.0488312   .0048706   -10.03   0.000     -.058619   -.0390433
  _IstaXt_81 |    .042208   .0050252     8.40   0.000     .0321095    .0523066
  _IstaXt_82 |  -.0047678   .0027059    -1.76   0.084    -.0102055    .0006698
  _IstaXt_83 |  -.0484869   .0064168    -7.56   0.000     -.061382   -.0355919
  _IstaXt_84 |  -.0864389   .0045614   -18.95   0.000    -.0956053   -.0772725
  _IstaXt_85 |  -.0188421   .0026286    -7.17   0.000    -.0241245   -.0135598
  _IstaXt_86 |   -.047923   .0071126    -6.74   0.000    -.0622163   -.0336296
  _IstaXt_87 |   .0328939   .0054118     6.08   0.000     .0220185    .0437693
  _IstaXt_88 |  -.0224227   .0071126    -3.15   0.003    -.0367161   -.0081294
  _IstaXt_91 |  -.0578722   .0023193   -24.95   0.000     -.062533   -.0532113
  _IstaXt_92 |  -.0276636          .        .       .            .           .
  _IstaXt_93 |  -.1013655   .0006185  -163.89   0.000    -.1026084   -.1001226
  _IstaXt_94 |  -.0394349   .0067261    -5.86   0.000    -.0529514   -.0259184
  _IstaXt_95 |  -.0886581   .0043294   -20.48   0.000    -.0973584   -.0799578
       _cons |    6.22045   .0387074   160.70   0.000     6.142665    6.298236
------------------------------------------------------------------------------

. reg lnths mone mtwo mthree _Iyear* _Istate* _IstaXt_* [aw=empwt], cluster(state);
(sum of wgt is 850)
note: _Iyear_75 omitted because of collinearity.
note: _Iyear_76 omitted because of collinearity.
note: _Iyear_96 omitted because of collinearity.
note: _Iyear_97 omitted because of collinearity.

Linear regression                               Number of obs     =        850
                                                F(18, 49)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.9876
                                                Root MSE          =     .20519

                                 (Std. err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        mone |   .0745716   .0675697     1.10   0.275    -.0612147    .2103579
        mtwo |   .0572944   .0723717     0.79   0.432     -.088142    .2027309
      mthree |   .1527636   .1263492     1.21   0.232    -.1011446    .4066718
   _Iyear_75 |          0  (omitted)
   _Iyear_76 |          0  (omitted)
   _Iyear_80 |   .0220644   .0343751     0.64   0.524     -.047015    .0911437
   _Iyear_81 |   .0568673   .0538142     1.06   0.296    -.0512764     .165011
   _Iyear_82 |   .0730654   .0593134     1.23   0.224    -.0461294    .1922602
   _Iyear_83 |   .1464208   .0537096     2.73   0.009     .0384874    .2543542
   _Iyear_84 |   .5738424   .0524061    10.95   0.000     .4685285    .6791563
   _Iyear_85 |   .8409307   .0601522    13.98   0.000     .7200503    .9618111
   _Iyear_86 |   .9956898   .0571582    17.42   0.000     .8808261    1.110553
   _Iyear_87 |   1.169252   .0627036    18.65   0.000     1.043244    1.295259
   _Iyear_88 |   1.540656    .046601    33.06   0.000     1.447007    1.634304
   _Iyear_89 |   1.683288   .0424584    39.65   0.000     1.597964    1.768611
   _Iyear_90 |   1.776156   .0493075    36.02   0.000     1.677069    1.875243
   _Iyear_91 |    1.85593   .0462135    40.16   0.000      1.76306    1.948799
   _Iyear_92 |   2.048286   .0396306    51.68   0.000     1.968646    2.127927
   _Iyear_93 |    2.37134   .0370315    64.04   0.000     2.296922    2.445757
   _Iyear_94 |   2.570453   .0356327    72.14   0.000     2.498846    2.642059
   _Iyear_95 |   2.725878   .0362191    75.26   0.000     2.653093    2.798663
   _Iyear_96 |          0  (omitted)
   _Iyear_97 |          0  (omitted)
  _Istate_12 |   .7150659    .082122     8.71   0.000     .5500355    .8800963
  _Istate_13 |  -1.698086   .0694594   -24.45   0.000     -1.83767   -1.558502
  _Istate_14 |   3.789894   .0694467    54.57   0.000     3.650336    3.929453
  _Istate_15 |   1.400721   .0675697    20.73   0.000     1.264935    1.536507
  _Istate_16 |   3.206084   .0587586    54.56   0.000     3.088005    3.324164
  _Istate_21 |    4.94718   .0432247   114.45   0.000     4.860317    5.034044
  _Istate_22 |   3.763233   .0147262   255.55   0.000      3.73364    3.792827
  _Istate_23 |   3.785124   1.61e-08  2.4e+08   0.000     3.785124    3.785125
  _Istate_31 |   3.555579   .0487817    72.89   0.000     3.457549     3.65361
  _Istate_32 |   2.389298   .0165295   144.55   0.000     2.356081    2.422515
  _Istate_33 |   3.780956   .0624447    60.55   0.000     3.655469    3.906444
  _Istate_34 |   3.368145   .0477519    70.53   0.000     3.272184    3.464106
  _Istate_35 |   2.917282   .0147262   198.10   0.000     2.887688    2.946875
  _Istate_41 |   3.241122   .0513688    63.10   0.000     3.137893    3.344352
  _Istate_42 |   1.584835   .0684392    23.16   0.000     1.447301    1.722368
  _Istate_43 |   2.894144   .0634084    45.64   0.000     2.766721    3.021568
  _Istate_44 |  -1.585472   .0602355   -26.32   0.000     -1.70652   -1.464424
  _Istate_45 |  -.9060744   .0505021   -17.94   0.000    -1.007562   -.8045867
  _Istate_46 |   1.215363   .0506861    23.98   0.000     1.113505     1.31722
  _Istate_47 |   .9358299   .0314637    29.74   0.000     .8726012    .9990586
  _Istate_51 |   1.513358   .0904241    16.74   0.000     1.331644    1.695072
  _Istate_52 |    2.88522   .0287566   100.33   0.000     2.827432    2.943009
  _Istate_54 |   2.859143   .0529265    54.02   0.000     2.752783    2.965503
  _Istate_55 |   .6715094   .0114788    58.50   0.000     .6484419    .6945769
  _Istate_56 |   2.332674   .0730349    31.94   0.000     2.185905    2.479443
  _Istate_57 |   1.483418   .0684392    21.67   0.000     1.345884    1.620952
  _Istate_58 |   2.942606   .0675697    43.55   0.000     2.806819    3.078392
  _Istate_59 |    3.59881   .0675697    53.26   0.000     3.463023    3.734596
  _Istate_61 |   1.738214   .0602361    28.86   0.000     1.617165    1.859263
  _Istate_62 |   2.154994   .0314637    68.49   0.000     2.091765    2.218222
  _Istate_63 |   1.294272   .0805945    16.06   0.000     1.132311    1.456232
  _Istate_64 |  -.6203266   .0854558    -7.26   0.000    -.7920564   -.4485968
  _Istate_71 |    .496677   .0171424    28.97   0.000      .462228    .5311259
  _Istate_72 |   3.053447   .0675697    45.19   0.000     2.917661    3.189233
  _Istate_73 |   2.281723   .0073464   310.59   0.000     2.266959    2.296486
  _Istate_74 |   4.051752   .0628306    64.49   0.000     3.925489    4.178014
  _Istate_81 |   -2.01666   .0494201   -40.81   0.000    -2.115974   -1.917347
  _Istate_82 |  -.5077286   .0852339    -5.96   0.000    -.6790124   -.3364447
  _Istate_83 |  -1.242397   .0700469   -17.74   0.000    -1.383162   -1.101633
  _Istate_84 |    2.79447   .0529265    52.80   0.000      2.68811    2.900829
  _Istate_85 |   .4535897   .0232478    19.51   0.000     .4068715    .5003079
  _Istate_86 |   2.475003   .0534659    46.29   0.000     2.367559    2.582446
  _Istate_87 |   .5912026   .0743514     7.95   0.000     .4417879    .7406174
  _Istate_88 |   .5492308    .064454     8.52   0.000     .4197057    .6787559
  _Istate_91 |   2.261499   .0027549   820.90   0.000     2.255962    2.267035
  _Istate_92 |   1.726771   .0624447    27.65   0.000     1.601284    1.852259
  _Istate_93 |   5.203153   .0979021    53.15   0.000     5.006411    5.399895
  _Istate_94 |  -1.086753   .0651111   -16.69   0.000    -1.217598   -.9559072
  _Istate_95 |    1.02112    .040257    25.37   0.000       .94022    1.102019
  _IstaXt_12 |  -.0329615   .0107747    -3.06   0.004    -.0546142   -.0113088
  _IstaXt_13 |   .0416362   .0060142     6.92   0.000     .0295502    .0537222
  _IstaXt_14 |  -.1163312   .0105228   -11.06   0.000    -.1374775   -.0951849
  _IstaXt_15 |  -.0631772   2.02e-09 -3.1e+07   0.000    -.0631772   -.0631772
  _IstaXt_16 |  -.1333219   .0096399   -13.83   0.000    -.1526941   -.1139498
  _IstaXt_21 |  -.1329692   .0034779   -38.23   0.000    -.1399582   -.1259802
  _IstaXt_22 |  -.1120696    .004706   -23.81   0.000    -.1215266   -.1026125
  _IstaXt_23 |  -.0974829   1.22e-09 -8.0e+07   0.000     -.097483   -.0974829
  _IstaXt_31 |  -.0538328    .003678   -14.64   0.000     -.061224   -.0464416
  _IstaXt_32 |  -.0315958   .0055098    -5.73   0.000    -.0426682   -.0205234
  _IstaXt_33 |   -.059877   1.61e-09 -3.7e+07   0.000     -.059877    -.059877
  _IstaXt_34 |  -.0494482   .0012244   -40.39   0.000    -.0519087   -.0469876
  _IstaXt_35 |  -.0756546    .004706   -16.08   0.000    -.0851117   -.0661976
  _IstaXt_41 |   -.094445     .00544   -17.36   0.000     -.105377    -.083513
  _IstaXt_42 |  -.0680279   .0060987   -11.15   0.000    -.0802837   -.0557721
  _IstaXt_43 |  -.0849869    .004432   -19.18   0.000    -.0938934   -.0760805
  _IstaXt_44 |  -.0366148   .0058399    -6.27   0.000    -.0483505   -.0248791
  _IstaXt_45 |  -.0355956   .0055455    -6.42   0.000    -.0467397   -.0244516
  _IstaXt_46 |  -.0408786   .0055455    -7.37   0.000    -.0520226   -.0297346
  _IstaXt_47 |  -.0027731   .0043045    -0.64   0.522    -.0114234    .0058771
  _IstaXt_51 |  -.0964375   .0043059   -22.40   0.000    -.1050905   -.0877844
  _IstaXt_52 |  -.0843221   .0046993   -17.94   0.000    -.0937657   -.0748784
  _IstaXt_54 |  -.0636907    .005236   -12.16   0.000    -.0742128   -.0531686
  _IstaXt_55 |  -.0758304   .0053568   -14.16   0.000    -.0865952   -.0650655
  _IstaXt_56 |  -.0056728   .0054652    -1.04   0.304    -.0166555    .0053099
  _IstaXt_57 |   .0141413   .0060987     2.32   0.025     .0018855    .0263971
  _IstaXt_58 |  -.0352676   1.80e-09 -2.0e+07   0.000    -.0352676   -.0352676
  _IstaXt_59 |  -.0062965   1.96e-09 -3.2e+06   0.000    -.0062966   -.0062965
  _IstaXt_61 |  -.0306676   .0046119    -6.65   0.000    -.0399356   -.0213996
  _IstaXt_62 |  -.0062821   .0043045    -1.46   0.151    -.0149323    .0023682
  _IstaXt_63 |   .0043239   .0063857     0.68   0.502    -.0085087    .0171565
  _IstaXt_64 |   .0787438    .005962    13.21   0.000     .0667626    .0907249
  _IstaXt_71 |   .0533333   .0042643    12.51   0.000     .0447638    .0619028
  _IstaXt_72 |  -.1034155   1.77e-09 -5.8e+07   0.000    -.1034155   -.1034155
  _IstaXt_73 |  -.0723566   .0048976   -14.77   0.000    -.0821988   -.0625145
  _IstaXt_74 |  -.0476286   .0055678    -8.55   0.000    -.0588175   -.0364397
  _IstaXt_81 |   .0386676   .0103211     3.75   0.000     .0179265    .0594087
  _IstaXt_82 |  -.0100196   .0104754    -0.96   0.344    -.0310708    .0110316
  _IstaXt_83 |   -.049579     .00657    -7.55   0.000     -.062782    -.036376
  _IstaXt_84 |   -.084841    .005236   -16.20   0.000    -.0953631   -.0743188
  _IstaXt_85 |  -.0163493   .0036821    -4.44   0.000    -.0237487   -.0089499
  _IstaXt_86 |  -.0512767   .0098939    -5.18   0.000    -.0711592   -.0313942
  _IstaXt_87 |   .0338549   .0062084     5.45   0.000     .0213787    .0463311
  _IstaXt_88 |  -.0266055   .0106597    -2.50   0.016     -.048027    -.005184
  _IstaXt_91 |  -.0540835   .0045915   -11.78   0.000    -.0633105   -.0448565
  _IstaXt_92 |  -.0276636   1.81e-09 -1.5e+07   0.000    -.0276636   -.0276636
  _IstaXt_93 |  -.1025659   .0023944   -42.84   0.000    -.1073776   -.0977542
  _IstaXt_94 |  -.0439728   .0103983    -4.23   0.000     -.064869   -.0230766
  _IstaXt_95 |  -.0863135   .0051518   -16.75   0.000    -.0966663   -.0759606
       _cons |   6.184918   .0617078   100.23   0.000     6.060911    6.308924
------------------------------------------------------------------------------

. reg lnths mico mppa mgfa many _Iyear* _Istate* _IstaXt_* [aw=empwt], cluster(state);
(sum of wgt is 850)
note: _Iyear_75 omitted because of collinearity.
note: _Iyear_76 omitted because of collinearity.
note: _Iyear_96 omitted because of collinearity.
note: _Iyear_97 omitted because of collinearity.

Linear regression                               Number of obs     =        850
                                                F(19, 49)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.9878
                                                Root MSE          =     .20375

                                 (Std. err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        mico |    .126333   .0668153     1.89   0.065    -.0079374    .2606033
        mppa |  -.0311637    .082366    -0.38   0.707    -.1966843    .1343569
        mgfa |  -.0836027   .0897022    -0.93   0.356     -.263866    .0966605
        many |   .0215855   .0908627     0.24   0.813    -.1610099    .2041808
   _Iyear_75 |          0  (omitted)
   _Iyear_76 |          0  (omitted)
   _Iyear_80 |    .032492   .0325631     1.00   0.323     -.032946    .0979299
   _Iyear_81 |     .07036   .0551733     1.28   0.208    -.0405148    .1812349
   _Iyear_82 |   .0877999   .0596595     1.47   0.148    -.0320904    .2076902
   _Iyear_83 |   .1495339   .0533018     2.81   0.007     .0424199     .256648
   _Iyear_84 |   .5734264   .0525873    10.90   0.000     .4677482    .6791046
   _Iyear_85 |   .8379864   .0580512    14.44   0.000     .7213281    .9546448
   _Iyear_86 |   .9897884   .0572248    17.30   0.000     .8747909    1.104786
   _Iyear_87 |   1.160684   .0611458    18.98   0.000     1.037807    1.283561
   _Iyear_88 |   1.530971   .0454979    33.65   0.000      1.43954    1.622402
   _Iyear_89 |   1.682056   .0412136    40.81   0.000     1.599234    1.764878
   _Iyear_90 |    1.77609   .0487022    36.47   0.000      1.67822    1.873961
   _Iyear_91 |    1.85703   .0450289    41.24   0.000     1.766541    1.947519
   _Iyear_92 |   2.053285   .0396244    51.82   0.000     1.973656    2.132913
   _Iyear_93 |   2.377504   .0376514    63.15   0.000     2.301841    2.453167
   _Iyear_94 |   2.581364   .0345453    74.72   0.000     2.511943    2.650786
   _Iyear_95 |   2.737956   .0356861    76.72   0.000     2.666242     2.80967
   _Iyear_96 |          0  (omitted)
   _Iyear_97 |          0  (omitted)
  _Istate_12 |   .9488735   .1506541     6.30   0.000     .6461228    1.251624
  _Istate_13 |   -1.62136   .0827801   -19.59   0.000    -1.787712   -1.455007
  _Istate_14 |   4.020434   .1436127    27.99   0.000     3.731834    4.309035
  _Istate_15 |   1.474068   .0848094    17.38   0.000     1.303637    1.644499
  _Istate_16 |   3.396997   .1215501    27.95   0.000     3.152733    3.641261
  _Istate_21 |   4.994101   .0542531    92.05   0.000     4.885075    5.103126
  _Istate_22 |   3.912546   .0894075    43.76   0.000     3.732875    4.092217
  _Istate_23 |   3.942621   .0915639    43.06   0.000     3.758617    4.126626
  _Istate_31 |   3.605053   .0650081    55.46   0.000     3.474414    3.735691
  _Istate_32 |   2.584809   .1014986    25.47   0.000      2.38084    2.788778
  _Istate_33 |   3.794843    .082366    46.07   0.000     3.629322    3.960363
  _Istate_34 |   3.415822   .0797328    42.84   0.000     3.255594    3.576051
  _Istate_35 |   3.066594   .0894075    34.30   0.000     2.886923    3.246265
  _Istate_41 |   3.297894   .0600228    54.94   0.000     3.177274    3.418514
  _Istate_42 |    1.68939   .0923775    18.29   0.000      1.50375    1.875029
  _Istate_43 |   2.900604   .0605698    47.89   0.000     2.778884    3.022324
  _Istate_44 |  -1.519037   .0691426   -21.97   0.000    -1.657984   -1.380089
  _Istate_45 |  -.8512425   .0554198   -15.36   0.000    -.9626127   -.7398723
  _Istate_46 |   1.271011    .057121    22.25   0.000     1.156222      1.3858
  _Istate_47 |   1.049247   .0827502    12.68   0.000     .8829543     1.21554
  _Istate_51 |   1.540506   .1126811    13.67   0.000     1.314065    1.766947
  _Istate_52 |   3.016589   .0864686    34.89   0.000     2.842824    3.190354
  _Istate_54 |   2.917344    .064527    45.21   0.000     2.787673    3.047016
  _Istate_55 |   .8554049    .098232     8.71   0.000     .6580004     1.05281
  _Istate_56 |   2.399215   .0858928    27.93   0.000     2.226607    2.571823
  _Istate_57 |   1.587973   .0923775    17.19   0.000     1.402333    1.773612
  _Istate_58 |   3.015952   .0848094    35.56   0.000     2.845522    3.186383
  _Istate_59 |   3.672157   .0848094    43.30   0.000     3.501726    3.842587
  _Istate_61 |   1.800193   .0796148    22.61   0.000     1.640201    1.960185
  _Istate_62 |   2.188504   .0404657    54.08   0.000     2.107186    2.269823
  _Istate_63 |   1.369477   .1086591    12.60   0.000     1.151118    1.587836
  _Istate_64 |  -.5692547   .0891877    -6.38   0.000    -.7484841   -.3900253
  _Istate_71 |   .6280379    .085402     7.35   0.000     .4564161    .7996597
  _Istate_72 |   3.126794   .0848094    36.87   0.000     2.956363    3.297225
  _Istate_73 |   2.292813   .0360521    63.60   0.000     2.220364    2.365262
  _Istate_74 |   4.140426   .0861585    48.06   0.000     3.967284    4.313568
  _Istate_81 |  -1.846897   .1070509   -17.25   0.000    -2.062024    -1.63177
  _Istate_82 |  -.5583606   .0871974    -6.40   0.000    -.7335903   -.3831309
  _Istate_83 |  -1.206306   .0776475   -15.54   0.000    -1.362344   -1.050267
  _Istate_84 |   2.852671    .064527    44.21   0.000     2.722999    2.982343
  _Istate_85 |   .4735026   .0323901    14.62   0.000     .4084122    .5385929
  _Istate_86 |    2.51872   .0645706    39.01   0.000     2.388961     2.64848
  _Istate_87 |   .6730291   .0844976     7.97   0.000     .5032249    .8428333
  _Istate_88 |   .5617667   .0736717     7.63   0.000     .4137179    .7098155
  _Istate_91 |   2.262111   .0036338   622.52   0.000     2.254809    2.269414
  _Istate_92 |   1.740658    .082366    21.13   0.000     1.575137    1.906178
  _Istate_93 |   5.353977    .109397    48.94   0.000     5.134135    5.573818
  _Istate_94 |  -1.038026    .063211   -16.42   0.000    -1.165054   -.9109991
  _Istate_95 |   1.151184   .0885024    13.01   0.000     .9733318    1.329036
  _IstaXt_12 |  -.0356848   .0058955    -6.05   0.000    -.0475322   -.0238374
  _IstaXt_13 |    .036895   .0059011     6.25   0.000     .0250363    .0487536
  _IstaXt_14 |  -.1187822   .0065054   -18.26   0.000    -.1318553    -.105709
  _IstaXt_15 |  -.0631772   1.32e-09 -4.8e+07   0.000    -.0631772   -.0631772
  _IstaXt_16 |  -.1328678   .0051319   -25.89   0.000    -.1431808   -.1225547
  _IstaXt_21 |  -.1367444   .0043652   -31.33   0.000    -.1455166   -.1279722
  _IstaXt_22 |  -.1220351   .0051204   -23.83   0.000    -.1323249   -.1117452
  _IstaXt_23 |  -.0974829   1.59e-09 -6.1e+07   0.000     -.097483   -.0974829
  _IstaXt_31 |  -.0577101   .0047762   -12.08   0.000    -.0673082    -.048112
  _IstaXt_32 |  -.0442673   .0058955    -7.51   0.000    -.0561147   -.0324199
  _IstaXt_33 |   -.059877   1.59e-09 -3.8e+07   0.000     -.059877    -.059877
  _IstaXt_34 |   -.052264   .0013101   -39.89   0.000    -.0548968   -.0496313
  _IstaXt_35 |  -.0856201   .0051204   -16.72   0.000      -.09591   -.0753303
  _IstaXt_41 |  -.0979278    .005492   -17.83   0.000    -.1089645   -.0868912
  _IstaXt_42 |  -.0738932   .0060663   -12.18   0.000    -.0860837   -.0617026
  _IstaXt_43 |  -.0762183   .0046695   -16.32   0.000     -.085602   -.0668347
  _IstaXt_44 |  -.0407827   .0057953    -7.04   0.000    -.0524288   -.0291365
  _IstaXt_45 |  -.0390444   .0056264    -6.94   0.000    -.0503511   -.0277377
  _IstaXt_46 |  -.0443274   .0056264    -7.88   0.000    -.0556341   -.0330207
  _IstaXt_47 |   -.010239   .0046137    -2.22   0.031    -.0195105   -.0009674
  _IstaXt_51 |  -.0877333   .0085373   -10.28   0.000    -.1048896   -.0705769
  _IstaXt_52 |  -.0928439   .0050631   -18.34   0.000    -.1030185   -.0826692
  _IstaXt_54 |  -.0672416   .0052362   -12.84   0.000    -.0777641    -.056719
  _IstaXt_55 |  -.0881499   .0057317   -15.38   0.000    -.0996682   -.0766316
  _IstaXt_56 |   .0011335   .0045879     0.25   0.806    -.0080863    .0103533
  _IstaXt_57 |    .008276   .0060663     1.36   0.179    -.0039146    .0204666
  _IstaXt_58 |  -.0352676   1.31e-09 -2.7e+07   0.000    -.0352676   -.0352676
  _IstaXt_59 |  -.0062965   1.74e-09 -3.6e+06   0.000    -.0062966   -.0062965
  _IstaXt_61 |  -.0344568   .0045145    -7.63   0.000    -.0435289   -.0253846
  _IstaXt_62 |  -.0079576     .00471    -1.69   0.097    -.0174228    .0015076
  _IstaXt_63 |   .0037044   .0106095     0.35   0.728    -.0176163     .025025
  _IstaXt_64 |   .0861688    .005005    17.22   0.000     .0761108    .0962267
  _IstaXt_71 |   .0444237   .0046405     9.57   0.000     .0350984    .0537491
  _IstaXt_72 |  -.1034155   1.65e-09 -6.3e+07   0.000    -.1034155   -.1034155
  _IstaXt_73 |  -.0716531   .0070686   -10.14   0.000    -.0858579   -.0574482
  _IstaXt_74 |  -.0530566   .0055464    -9.57   0.000    -.0642025   -.0419107
  _IstaXt_81 |   .0410081   .0066313     6.18   0.000     .0276821    .0543342
  _IstaXt_82 |   .0053419    .007695     0.69   0.491    -.0101218    .0208057
  _IstaXt_83 |  -.0477367   .0067341    -7.09   0.000    -.0612694   -.0342041
  _IstaXt_84 |  -.0883919   .0052362   -16.88   0.000    -.0989144   -.0778693
  _IstaXt_85 |  -.0169025   .0043729    -3.87   0.000    -.0256901   -.0081149
  _IstaXt_86 |  -.0403439   .0089511    -4.51   0.000    -.0583318   -.0223559
  _IstaXt_87 |   .0287541   .0060772     4.73   0.000     .0165416    .0409667
  _IstaXt_88 |   -.014458   .0092856    -1.56   0.126    -.0331182    .0042022
  _IstaXt_91 |  -.0530624   .0060563    -8.76   0.000    -.0652331   -.0408918
  _IstaXt_92 |  -.0276636   1.80e-09 -1.5e+07   0.000    -.0276636   -.0276636
  _IstaXt_93 |  -.0990547   .0017589   -56.32   0.000    -.1025893   -.0955201
  _IstaXt_94 |  -.0335571   .0079426    -4.22   0.000    -.0495183   -.0175959
  _IstaXt_95 |  -.0943017   .0054422   -17.33   0.000    -.1052383   -.0833652
       _cons |   6.108735   .0835851    73.08   0.000     5.940764    6.276706
------------------------------------------------------------------------------

. reg lnths mico mppa mcount _Iyear* _Istate* _IstaXt_* [aw=empwt], cluster(state);
(sum of wgt is 850)
note: _Iyear_75 omitted because of collinearity.
note: _Iyear_76 omitted because of collinearity.
note: _Iyear_96 omitted because of collinearity.
note: _Iyear_97 omitted because of collinearity.

Linear regression                               Number of obs     =        850
                                                F(18, 49)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.9878
                                                Root MSE          =     .20363

                                 (Std. err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        mico |   .2161913   .1159112     1.87   0.068    -.0167409    .4491235
        mppa |   .0562377   .1093154     0.51   0.609    -.1634399    .2759153
      mcount |  -.0787631   .0927979    -0.85   0.400    -.2652476    .1077213
   _Iyear_75 |          0  (omitted)
   _Iyear_76 |          0  (omitted)
   _Iyear_80 |   .0335385   .0312465     1.07   0.288    -.0292538    .0963307
   _Iyear_81 |   .0722644    .054269     1.33   0.189    -.0367932    .1813221
   _Iyear_82 |   .0904163    .057519     1.57   0.122    -.0251725     .206005
   _Iyear_83 |   .1539363    .050889     3.02   0.004     .0516711    .2562015
   _Iyear_84 |   .5774657   .0502711    11.49   0.000     .4764421    .6784892
   _Iyear_85 |   .8411854     .05796    14.51   0.000     .7247105    .9576603
   _Iyear_86 |   .9923652   .0581129    17.08   0.000      .875583    1.109148
   _Iyear_87 |   1.162606   .0612425    18.98   0.000     1.039535    1.285677
   _Iyear_88 |   1.532503   .0449303    34.11   0.000     1.442213    1.622794
   _Iyear_89 |   1.683325   .0409703    41.09   0.000     1.600992    1.765658
   _Iyear_90 |    1.77749   .0480664    36.98   0.000     1.680897    1.874083
   _Iyear_91 |    1.85856    .043357    42.87   0.000     1.771431    1.945689
   _Iyear_92 |    2.05528   .0373913    54.97   0.000     1.980139     2.13042
   _Iyear_93 |   2.379629   .0350995    67.80   0.000     2.309094    2.450164
   _Iyear_94 |   2.583523   .0345223    74.84   0.000     2.514148    2.652898
   _Iyear_95 |   2.740245    .034752    78.85   0.000     2.670408    2.810082
   _Iyear_96 |          0  (omitted)
   _Iyear_97 |          0  (omitted)
  _Istate_12 |   .9500805   .1510251     6.29   0.000     .6465842    1.253577
  _Istate_13 |   -1.63111   .0645135   -25.28   0.000    -1.760755   -1.501466
  _Istate_14 |   4.023674   .1440251    27.94   0.000     3.734245    4.313103
  _Istate_15 |   1.463578   .0617569    23.70   0.000     1.339473    1.587683
  _Istate_16 |   3.393604   .1185249    28.63   0.000     3.155419    3.631789
  _Istate_21 |    4.98739   .0395062   126.24   0.000     4.907999    5.066781
  _Istate_22 |   3.912854   .0902373    43.36   0.000     3.731515    4.094192
  _Istate_23 |   3.945078   .0962728    40.98   0.000     3.751611    4.138546
  _Istate_31 |   3.596754   .0437882    82.14   0.000     3.508758     3.68475
  _Istate_32 |   2.590203   .1099965    23.55   0.000     2.369157    2.811249
  _Istate_33 |   3.786204   .0582912    64.95   0.000     3.669064    3.903345
  _Istate_34 |   3.409795    .063976    53.30   0.000      3.28123     3.53836
  _Istate_35 |   3.066902   .0902373    33.99   0.000     2.885563     3.24824
  _Istate_41 |   3.290997   .0480008    68.56   0.000     3.194536    3.387458
  _Istate_42 |   1.680789   .0768903    21.86   0.000     1.526272    1.835306
  _Istate_43 |    2.88882   .0267375   108.04   0.000     2.835089    2.942551
  _Istate_44 |  -1.526778   .0565907   -26.98   0.000    -1.640501   -1.413054
  _Istate_45 |  -.8569325   .0480886   -17.82   0.000    -.9535702   -.7602948
  _Istate_46 |   1.264813   .0478831    26.41   0.000     1.168589    1.361038
  _Istate_47 |   1.045407   .0748487    13.97   0.000     .8949933    1.195821
  _Istate_51 |   1.524352   .0667642    22.83   0.000     1.390184    1.658519
  _Istate_52 |   3.014136   .0819458    36.78   0.000      2.84946    3.178812
  _Istate_54 |   2.909558   .0488132    59.61   0.000     2.811465    3.007652
  _Istate_55 |   .8599015    .105724     8.13   0.000     .6474412    1.072362
  _Istate_56 |   2.387677   .0605788    39.41   0.000      2.26594    2.509415
  _Istate_57 |   1.579372   .0768903    20.54   0.000     1.424856    1.733889
  _Istate_58 |   3.005462   .0617569    48.67   0.000     2.881357    3.129567
  _Istate_59 |   3.661666   .0617569    59.29   0.000     3.537561    3.785771
  _Istate_61 |   1.790057   .0541964    33.03   0.000     1.681145    1.898969
  _Istate_62 |   2.183418    .028541    76.50   0.000     2.126063    2.240773
  _Istate_63 |   1.357491   .0797844    17.01   0.000     1.197158    1.517824
  _Istate_64 |  -.5831722   .0592248    -9.85   0.000    -.7021889   -.4641554
  _Istate_71 |    .626959   .0835174     7.51   0.000     .4591244    .7947936
  _Istate_72 |   3.116304   .0617569    50.46   0.000     2.992199    3.240409
  _Istate_73 |   2.294751   .0307068    74.73   0.000     2.233043    2.356459
  _Istate_74 |   4.131405   .0675315    61.18   0.000     3.995695    4.267114
  _Istate_81 |  -1.846293   .1080316   -17.09   0.000    -2.063391   -1.629195
  _Istate_82 |  -.5652552   .0670396    -8.43   0.000    -.6999763    -.430534
  _Istate_83 |    -1.2135   .0652632   -18.59   0.000    -1.344652   -1.082349
  _Istate_84 |   2.844885   .0488132    58.28   0.000     2.746791    2.942979
  _Istate_85 |   .4693829   .0206846    22.69   0.000     .4278156    .5109501
  _Istate_86 |   2.511326   .0487173    51.55   0.000     2.413425    2.609227
  _Istate_87 |   .6637228    .070063     9.47   0.000      .522926    .8045196
  _Istate_88 |    .554182   .0544197    10.18   0.000     .4448215    .6635424
  _Istate_91 |    2.26173   .0025717   879.48   0.000     2.256562    2.266898
  _Istate_92 |   1.732019   .0582912    29.71   0.000     1.614879     1.84916
  _Istate_93 |   5.341638    .092082    58.01   0.000     5.156592    5.526683
  _Istate_94 |  -1.045848   .0526583   -19.86   0.000    -1.151669   -.9400276
  _Istate_95 |   1.147398   .0816288    14.06   0.000     .9833588    1.311437
  _IstaXt_12 |  -.0366638   .0054491    -6.73   0.000    -.0476142   -.0257133
  _IstaXt_13 |   .0370024   .0059737     6.19   0.000     .0249978     .049007
  _IstaXt_14 |  -.1199306   .0052384   -22.89   0.000    -.1304576   -.1094035
  _IstaXt_15 |  -.0631772   1.08e-09 -5.8e+07   0.000    -.0631772   -.0631772
  _IstaXt_16 |  -.1336062   .0049726   -26.87   0.000     -.143599   -.1236134
  _IstaXt_21 |  -.1362045   .0031787   -42.85   0.000    -.1425922   -.1298167
  _IstaXt_22 |  -.1226786   .0047953   -25.58   0.000    -.1323152   -.1130421
  _IstaXt_23 |  -.0974829   1.03e-09 -9.4e+07   0.000     -.097483   -.0974829
  _IstaXt_31 |  -.0571067   .0033266   -17.17   0.000    -.0637916   -.0504217
  _IstaXt_32 |  -.0452463   .0054491    -8.30   0.000    -.0561967   -.0342958
  _IstaXt_33 |   -.059877   1.55e-09 -3.9e+07   0.000     -.059877    -.059877
  _IstaXt_34 |  -.0524816   .0012109   -43.34   0.000     -.054915   -.0500482
  _IstaXt_35 |  -.0862637   .0047953   -17.99   0.000    -.0959002   -.0766271
  _IstaXt_41 |  -.0980004   .0054083   -18.12   0.000    -.1088687    -.087132
  _IstaXt_42 |  -.0738249   .0061028   -12.10   0.000    -.0860889    -.061561
  _IstaXt_43 |  -.0752967   .0052682   -14.29   0.000    -.0858836   -.0647099
  _IstaXt_44 |  -.0407735   .0058078    -7.02   0.000    -.0524447   -.0291023
  _IstaXt_45 |  -.0391381   .0055116    -7.10   0.000    -.0502141   -.0280621
  _IstaXt_46 |  -.0444211   .0055116    -8.06   0.000     -.055497   -.0333451
  _IstaXt_47 |  -.0105788   .0044332    -2.39   0.021    -.0194876     -.00167
  _IstaXt_51 |  -.0866661   .0059136   -14.66   0.000      -.09855   -.0747823
  _IstaXt_52 |  -.0932653   .0048402   -19.27   0.000     -.102992   -.0835386
  _IstaXt_54 |  -.0672718   .0052073   -12.92   0.000    -.0777362   -.0568073
  _IstaXt_55 |  -.0891017   .0052978   -16.82   0.000    -.0997479   -.0784554
  _IstaXt_56 |   .0021807   .0047147     0.46   0.646    -.0072939    .0116553
  _IstaXt_57 |   .0083442   .0061028     1.37   0.178    -.0039198    .0206082
  _IstaXt_58 |  -.0352676   1.63e-09 -2.2e+07   0.000    -.0352676   -.0352676
  _IstaXt_59 |  -.0062965   4.56e-10 -1.4e+07   0.000    -.0062965   -.0062965
  _IstaXt_61 |  -.0343387   .0045754    -7.51   0.000    -.0435334   -.0251441
  _IstaXt_62 |  -.0082071   .0042386    -1.94   0.059    -.0167249    .0003108
  _IstaXt_63 |    .004203   .0094273     0.45   0.658    -.0147419    .0231478
  _IstaXt_64 |   .0873112   .0051433    16.98   0.000     .0769753    .0976471
  _IstaXt_71 |   .0438618   .0043545    10.07   0.000     .0351112    .0526124
  _IstaXt_72 |  -.1034155   6.25e-10 -1.7e+08   0.000    -.1034155   -.1034155
  _IstaXt_73 |  -.0723585   .0050431   -14.35   0.000     -.082493    -.062224
  _IstaXt_74 |   -.053002   .0055758    -9.51   0.000     -.064207    -.041797
  _IstaXt_81 |   .0400339   .0067622     5.92   0.000     .0264447    .0536231
  _IstaXt_82 |   .0049268   .0079606     0.62   0.539    -.0110707    .0209242
  _IstaXt_83 |  -.0478072   .0066715    -7.17   0.000    -.0612141   -.0344004
  _IstaXt_84 |   -.088422   .0052073   -16.98   0.000    -.0988865   -.0779576
  _IstaXt_85 |  -.0172473    .003563    -4.84   0.000    -.0244074   -.0100872
  _IstaXt_86 |  -.0407655   .0088676    -4.60   0.000    -.0585856   -.0229453
  _IstaXt_87 |    .028913   .0061592     4.69   0.000     .0165356    .0412904
  _IstaXt_88 |  -.0148517   .0092721    -1.60   0.116    -.0334848    .0037813
  _IstaXt_91 |  -.0536976   .0042861   -12.53   0.000    -.0623109   -.0450843
  _IstaXt_92 |  -.0276636   1.33e-09 -2.1e+07   0.000    -.0276636   -.0276636
  _IstaXt_93 |  -.0991496   .0018196   -54.49   0.000    -.1028062    -.095493
  _IstaXt_94 |  -.0339381   .0077745    -4.37   0.000    -.0495616   -.0183145
  _IstaXt_95 |  -.0945871   .0052903   -17.88   0.000    -.1052184   -.0839559
       _cons |   6.117107   .0678351    90.18   0.000     5.980788    6.253427
------------------------------------------------------------------------------

. reg lnths mico mppa mgfa mtwo mthree _Iyear* _Istate* _IstaXt_* [aw=empwt], cluster(state);
(sum of wgt is 850)
note: _Iyear_75 omitted because of collinearity.
note: _Iyear_76 omitted because of collinearity.
note: _Iyear_96 omitted because of collinearity.
note: _Iyear_97 omitted because of collinearity.

Linear regression                               Number of obs     =        850
                                                F(20, 49)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.9878
                                                Root MSE          =     .20341

                                 (Std. err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        mico |   .1511514   .0851902     1.77   0.082    -.0200448    .3223475
        mppa |   .0069088   .0567103     0.12   0.904    -.1070549    .1208724
        mgfa |  -.0876635    .144878    -0.61   0.548    -.3788068    .2034798
        mtwo |   -.055082   .0921164    -0.60   0.553    -.2401968    .1300329
      mthree |    .028938   .2122986     0.14   0.892    -.3976919    .4555679
   _Iyear_75 |          0  (omitted)
   _Iyear_76 |          0  (omitted)
   _Iyear_80 |   .0317869    .032603     0.97   0.334    -.0337313     .097305
   _Iyear_81 |   .0694099   .0551414     1.26   0.214    -.0414008    .1802207
   _Iyear_82 |   .0880527   .0594373     1.48   0.145    -.0313911    .2074965
   _Iyear_83 |   .1514826   .0526284     2.88   0.006     .0457218    .2572434
   _Iyear_84 |   .5776909   .0521657    11.07   0.000     .4728601    .6825218
   _Iyear_85 |   .8431405   .0559874    15.06   0.000     .7306296    .9556513
   _Iyear_86 |    .994806   .0552564    18.00   0.000     .8837641    1.105848
   _Iyear_87 |   1.165349   .0609993    19.10   0.000     1.042767    1.287932
   _Iyear_88 |   1.530919    .044982    34.03   0.000     1.440524    1.621314
   _Iyear_89 |   1.681299   .0406425    41.37   0.000     1.599625    1.762973
   _Iyear_90 |   1.775813   .0483698    36.71   0.000      1.67861    1.873016
   _Iyear_91 |   1.857232   .0449093    41.36   0.000     1.766983     1.94748
   _Iyear_92 |   2.054478   .0395597    51.93   0.000      1.97498    2.133977
   _Iyear_93 |   2.379177   .0373739    63.66   0.000     2.304071    2.454283
   _Iyear_94 |   2.581917    .034757    74.28   0.000     2.512071    2.651764
   _Iyear_95 |   2.738988    .035762    76.59   0.000     2.667122    2.810854
   _Iyear_96 |          0  (omitted)
   _Iyear_97 |          0  (omitted)
  _Istate_12 |   1.029975   .2150075     4.79   0.000     .5979008    1.462048
  _Istate_13 |  -1.620992   .0818714   -19.80   0.000    -1.785519   -1.456465
  _Istate_14 |   4.097533    .206129    19.88   0.000     3.683302    4.511765
  _Istate_15 |   1.477301   .0851902    17.34   0.000     1.306105    1.648497
  _Istate_16 |   3.441652   .1524889    22.57   0.000     3.135214     3.74809
  _Istate_21 |   4.996169   .0544967    91.68   0.000     4.886654    5.105684
  _Istate_22 |   3.900723   .0876436    44.51   0.000     3.724597     4.07685
  _Istate_23 |   3.929367   .0902211    43.55   0.000     3.748061    4.110673
  _Istate_31 |   3.610247   .0663455    54.42   0.000     3.476921    3.743574
  _Istate_32 |   2.563544   .0975418    26.28   0.000     2.367527    2.759562
  _Istate_33 |   3.811852   .0841381    45.30   0.000      3.64277    3.980934
  _Istate_34 |   3.425711    .082103    41.72   0.000     3.260719    3.590703
  _Istate_35 |   3.054771   .0876436    34.85   0.000     2.878645    3.230898
  _Istate_41 |   3.297382   .0589834    55.90   0.000     3.178851    3.415914
  _Istate_42 |   1.685945   .0904814    18.63   0.000     1.504116    1.867774
  _Istate_43 |   2.912747   .0624191    46.66   0.000     2.787311    3.038183
  _Istate_44 |  -1.520449    .067535   -22.51   0.000    -1.656166   -1.384732
  _Istate_45 |  -.8541307   .0532429   -16.04   0.000    -.9611263   -.7471351
  _Istate_46 |   1.269124   .0554291    22.90   0.000     1.157735    1.380513
  _Istate_47 |   1.044723   .0825182    12.66   0.000     .8788967     1.21055
  _Istate_51 |   1.535064   .1125083    13.64   0.000     1.308971    1.761158
  _Istate_52 |   3.008282   .0850702    35.36   0.000     2.837327    3.179237
  _Istate_54 |   2.918584   .0642695    45.41   0.000     2.789429    3.047738
  _Istate_55 |   .8365878   .0951095     8.80   0.000      .645458    1.027718
  _Istate_56 |   2.403781   .0864127    27.82   0.000     2.230128    2.577434
  _Istate_57 |   1.584528   .0904814    17.51   0.000     1.402699    1.766358
  _Istate_58 |   3.019185   .0851902    35.44   0.000     2.847989    3.190381
  _Istate_59 |   3.675389   .0851902    43.14   0.000     3.504193    3.846586
  _Istate_61 |    1.80606   .0810845    22.27   0.000     1.643114    1.969005
  _Istate_62 |   2.190705   .0409206    53.54   0.000     2.108472    2.272938
  _Istate_63 |    1.35791   .1084244    12.52   0.000     1.140023    1.575797
  _Istate_64 |  -.5616576   .0900024    -6.24   0.000    -.7425242    -.380791
  _Istate_71 |   .6199983   .0848099     7.31   0.000     .4495665    .7904302
  _Istate_72 |   3.130027   .0851902    36.74   0.000     2.958831    3.301223
  _Istate_73 |   2.301035   .0405367    56.76   0.000     2.219574    2.382497
  _Istate_74 |   4.140484   .0857622    48.28   0.000     3.968139     4.31283
  _Istate_81 |  -1.806153   .1340314   -13.48   0.000    -2.075499   -1.536806
  _Istate_82 |  -.5125422     .08969    -5.71   0.000     -.692781   -.3323035
  _Istate_83 |   -1.19189   .0791965   -15.05   0.000    -1.351041   -1.032738
  _Istate_84 |    2.85391   .0642695    44.41   0.000     2.724756    2.983065
  _Istate_85 |   .4775151   .0334176    14.29   0.000     .4103598    .5446704
  _Istate_86 |   2.526427   .0657354    38.43   0.000     2.394326    2.658527
  _Istate_87 |   .6707279   .0822431     8.16   0.000     .5054541    .8360017
  _Istate_88 |   .5862977   .0780794     7.51   0.000     .4293913    .7432041
  _Istate_91 |   2.262862    .003712   609.61   0.000     2.255402    2.270321
  _Istate_92 |   1.757667   .0841381    20.89   0.000     1.588585    1.926749
  _Istate_93 |   5.309841   .1055227    50.32   0.000     5.097785    5.521897
  _Istate_94 |  -1.001661   .0876371   -11.43   0.000    -1.177775    -.825548
  _Istate_95 |   1.142914   .0864345    13.22   0.000      .969217     1.31661
  _IstaXt_12 |  -.0452882   .0150137    -3.02   0.004    -.0754593   -.0151171
  _IstaXt_13 |   .0380926   .0054041     7.05   0.000     .0272328    .0489525
  _IstaXt_14 |  -.1280521   .0149509    -8.56   0.000    -.1580971    -.098007
  _IstaXt_15 |  -.0631772   9.88e-10 -6.4e+07   0.000    -.0631772   -.0631772
  _IstaXt_16 |  -.1408345   .0118376   -11.90   0.000     -.164623    -.117046
  _IstaXt_21 |  -.1369108   .0043848   -31.22   0.000    -.1457224   -.1280992
  _IstaXt_22 |  -.1199106   .0043567   -27.52   0.000    -.1286658   -.1111554
  _IstaXt_23 |  -.0974829   2.01e-10 -4.9e+08   0.000    -.0974829   -.0974829
  _IstaXt_31 |  -.0580016   .0048423   -11.98   0.000    -.0677325   -.0482707
  _IstaXt_32 |   -.041597   .0050435    -8.25   0.000    -.0517323   -.0314616
  _IstaXt_33 |   -.059877   1.08e-09 -5.5e+07   0.000     -.059877    -.059877
  _IstaXt_34 |  -.0516706   .0011208   -46.10   0.000    -.0539229   -.0494183
  _IstaXt_35 |  -.0834956   .0043567   -19.16   0.000    -.0922508   -.0747404
  _IstaXt_41 |  -.0966747   .0051113   -18.91   0.000    -.1069462   -.0864033
  _IstaXt_42 |  -.0725563   .0054903   -13.22   0.000    -.0835894   -.0615233
  _IstaXt_43 |  -.0776447   .0045929   -16.91   0.000    -.0868745   -.0684149
  _IstaXt_44 |  -.0395195   .0053435    -7.40   0.000    -.0502576   -.0287814
  _IstaXt_45 |  -.0377496   .0052498    -7.19   0.000    -.0482994   -.0271997
  _IstaXt_46 |  -.0430326   .0052498    -8.20   0.000    -.0535824   -.0324827
  _IstaXt_47 |  -.0086199    .003978    -2.17   0.035     -.016614   -.0006257
  _IstaXt_51 |   -.086099   .0092324    -9.33   0.000    -.1046522   -.0675457
  _IstaXt_52 |  -.0910022   .0043492   -20.92   0.000    -.0997423   -.0822621
  _IstaXt_54 |  -.0660718   .0048486   -13.63   0.000    -.0758156   -.0563281
  _IstaXt_55 |  -.0855537   .0049034   -17.45   0.000    -.0954076   -.0756999
  _IstaXt_56 |     -.0002   .0045869    -0.04   0.965    -.0094177    .0090176
  _IstaXt_57 |   .0096128   .0054903     1.75   0.086    -.0014203    .0206459
  _IstaXt_58 |  -.0352676   8.68e-10 -4.1e+07   0.000    -.0352676   -.0352676
  _IstaXt_59 |  -.0062965   7.13e-10 -8.8e+06   0.000    -.0062965   -.0062965
  _IstaXt_61 |  -.0335788   .0041273    -8.14   0.000    -.0418729   -.0252848
  _IstaXt_62 |  -.0068257   .0045461    -1.50   0.140    -.0159615      .00231
  _IstaXt_63 |   .0086376   .0133803     0.65   0.522     -.018251    .0355263
  _IstaXt_64 |    .084714   .0050039    16.93   0.000     .0746584    .0947697
  _IstaXt_71 |   .0463257   .0039499    11.73   0.000     .0383882    .0542633
  _IstaXt_72 |  -.1034155          .        .       .            .           .
  _IstaXt_73 |  -.0706288   .0070816    -9.97   0.000    -.0848598   -.0563978
  _IstaXt_74 |  -.0518211   .0050151   -10.33   0.000    -.0618993    -.041743
  _IstaXt_81 |   .0341256   .0103777     3.29   0.002     .0132708    .0549804
  _IstaXt_82 |  -.0015173    .007226    -0.21   0.835    -.0160384    .0130038
  _IstaXt_83 |  -.0494787    .006708    -7.38   0.000     -.062959   -.0359985
  _IstaXt_84 |  -.0872221   .0048486   -17.99   0.000    -.0969658   -.0774784
  _IstaXt_85 |   -.015882   .0043435    -3.66   0.001    -.0246106   -.0071534
  _IstaXt_86 |  -.0456414   .0089749    -5.09   0.000    -.0636771   -.0276057
  _IstaXt_87 |   .0299359   .0055559     5.39   0.000     .0187709     .041101
  _IstaXt_88 |  -.0204686   .0093344    -2.19   0.033    -.0392268   -.0017104
  _IstaXt_91 |  -.0518117   .0061866    -8.37   0.000    -.0642442   -.0393792
  _IstaXt_92 |  -.0276636   6.52e-10 -4.2e+07   0.000    -.0276636   -.0276636
  _IstaXt_93 |  -.1006225   .0016517   -60.92   0.000    -.1039416   -.0973034
  _IstaXt_94 |  -.0404679   .0099567    -4.06   0.000    -.0604767    -.020459
  _IstaXt_95 |  -.0925542    .004739   -19.53   0.000    -.1020776   -.0830308
       _cons |   6.104136   .0847241    72.05   0.000     5.933877    6.274396
------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\chadi\AppData\Local\Temp\STD2bf8_000000.tmp"

. xi i.state i.year i.state*t i.state*t2 i.region*i.year;
i.state           _Istate_11-95       (naturally coded; _Istate_11 omitted)
i.year            _Iyear_79-95        (naturally coded; _Iyear_79 omitted)
i.state*t         _IstaXt_#           (coded as above)
i.state*t2        _IstaXt2_#          (coded as above)
i.region          _Iregion_1-9        (naturally coded; _Iregion_1 omitted)
; invalid name
r(198);

end of do-file

r(198);

. do "C:\Users\chadi\AppData\Local\Temp\STD2bf8_000001.tmp"

. # delimit ;
delimiter now ;
. set more 1;

. set logtype text;

. cap log using JOLE-speccheck_table4, replace;

. set matsize 450;
set matsize ignored.
    Matrix sizes are no longer limited by c(matsize) in modern Statas.  Matrix sizes are now
    limited by edition of Stata.  See limits for more details.

. use eow-svcs.dta, clear;
(EOW SVCs, CPS, rulings research data set)

. * Weights;
. egen empwt=mean(annemp) if year>=79 & year<=95, by(state);
(350 missing values generated)

. if "`1'"!="wt" {;
.  replace empwt=1;
(1,200 real changes made)
.  };

. * Log total employment - from BLS employment & earnings;
. gen lnemp=ln(annemp);

. * Non-business-service sector employment from CBP;
. gen nonemp= stateemp-svcemp;
(200 missing values generated)

. gen lnnon=ln(nonemp);
(200 missing values generated)

. gen svcfrac= svcemp/nonemp;
(200 missing values generated)

. * Total business services employment from CBP;
. gen bizemp= svcemp+peremp;
(200 missing values generated)

. gen lnbiz = ln(bizemp);
(200 missing values generated)

. * State dummies, year dummies, and state*time trends;
. gen t=year-78;

. gen t2=t^2;

. drop if state==98;
(0 observations deleted)

. xi i.state i.year i.state*t i.state*t2 i.region*i.year;
i.state           _Istate_11-95       (naturally coded; _Istate_11 omitted)
i.year            _Iyear_74-97        (naturally coded; _Iyear_74 omitted)
i.state*t         _IstaXt_#           (coded as above)
i.state*t2        _IstaXt2_#          (coded as above)
i.region          _Iregion_1-9        (naturally coded; _Iregion_1 omitted)
i.reg~n*i.year    _IregXyea_#_#       (coded as above)

. drop _Iyear_77 - _Iyear_79;

. 
end of do-file

. do "C:\Users\chadi\AppData\Local\Temp\STD2bf8_000002.tmp"

. reg lnths mico mppa mgfa _Iyear* _Istate* _IstaXt_* [aw=empwt], cluster(state);
option ; not allowed
r(198);

end of do-file

r(198);

. do "C:\Users\chadi\AppData\Local\Temp\STD2bf8_000003.tmp"

. ****************;
. 
. reg lnths mico mppa mgfa _Iyear* _Istate* _IstaXt_* [aw=empwt], cluster(state);
option ; not allowed
r(198);

end of do-file

r(198);

. do "C:\Users\chadi\OneDrive - Handelshögskolan i Stockholm\Econometrics\Econometrics\resources\t
> extbook\AngristPischke2009\DataArchive\Autor2003\tables2-9\JOLE-speccheck_table4.do"

. # delimit ;
delimiter now ;
. set more 1;

. set logtype text;

. cap log using JOLE-speccheck_table4, replace;

. set matsize 450;
set matsize ignored.
    Matrix sizes are no longer limited by c(matsize) in modern Statas.  Matrix sizes are now
    limited by edition of Stata.  See limits for more details.

. use eow-svcs.dta, clear;
(EOW SVCs, CPS, rulings research data set)

. * Weights;
. egen empwt=mean(annemp) if year>=79 & year<=95, by(state);
(350 missing values generated)

. if "`1'"!="wt" {;
.  replace empwt=1;
(1,200 real changes made)
.  };

. * Log total employment - from BLS employment & earnings;
. gen lnemp=ln(annemp);

. * Non-business-service sector employment from CBP;
. gen nonemp= stateemp-svcemp;
(200 missing values generated)

. gen lnnon=ln(nonemp);
(200 missing values generated)

. gen svcfrac= svcemp/nonemp;
(200 missing values generated)

. * Total business services employment from CBP;
. gen bizemp= svcemp+peremp;
(200 missing values generated)

. gen lnbiz = ln(bizemp);
(200 missing values generated)

. * State dummies, year dummies, and state*time trends;
. gen t=year-78;

. gen t2=t^2;

. drop if state==98;
(0 observations deleted)

. xi i.state i.year i.state*t i.state*t2 i.region*i.year;
i.state           _Istate_11-95       (naturally coded; _Istate_11 omitted)
i.year            _Iyear_74-97        (naturally coded; _Iyear_74 omitted)
i.state*t         _IstaXt_#           (coded as above)
i.state*t2        _IstaXt2_#          (coded as above)
i.region          _Iregion_1-9        (naturally coded; _Iregion_1 omitted)
i.reg~n*i.year    _IregXyea_#_#       (coded as above)

. drop _Iyear_77 - _Iyear_79;

. * Working sample;
. gen year1 = year>=79 & year<=95;

. keep if year1;
(350 observations deleted)

. gen year2 = ((int(year/2)*2 + 1)==year);

. gen year4 = (year==79 | year==83 | year==87 | year==91 | year==95);

. * Generate more aggregate demos;
. gen clp=clg+gtc;

. gen a1624=m1619+m2024+f1619+f2024;

. gen a2554=m2554+f2554;

. gen a55up=m5564+m65up+f5564+f65up;

. gen fem=f1619+f2024+f2554+f5564+f65up;

. gen white=rs_wm+rs_wf;

. gen black=rs_bm+rs_bf;

. gen other=rs_om+rs_of;

. gen married=marfem+marmale;

. * Modify union variable so that:
>   1 - We don't use interpolated data for 1979 & 1981
>   2 - Turn from fraction into percent so that coefficient will be friendly size;
. replace unmem=. if year==79 | year==81;
(100 real changes made, 100 to missing)

. replace unmem=unmem*100;
(750 real changes made)

. * Alternative legal characterizations;
. gen mcount = mico+mppa+mgfa;

. gen many = min(mcount,1);

. gen mone = mcount==1;

. gen mtwo = mcount==2;

. gen mthree = mcount==3;

. ****************;
. ** Table 4
> ****************;
. reg lnths mico mppa mgfa _Iyear* _Istate* _IstaXt_* [aw=empwt], cluster(state);
(sum of wgt is 850)
note: _Iyear_75 omitted because of collinearity.
note: _Iyear_76 omitted because of collinearity.
note: _Iyear_96 omitted because of collinearity.
note: _Iyear_97 omitted because of collinearity.

Linear regression                               Number of obs     =        850
                                                F(17, 49)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.9878
                                                Root MSE          =     .20363

                                 (Std. err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        mico |   .1374282   .0617569     2.23   0.031     .0133231    .2615333
        mppa |  -.0225254   .0582912    -0.39   0.701    -.1396659     .094615
        mgfa |  -.0787631   .0927979    -0.85   0.400    -.2652476    .1077213
   _Iyear_75 |          0  (omitted)
   _Iyear_76 |          0  (omitted)
   _Iyear_80 |   .0335385   .0312465     1.07   0.288    -.0292538    .0963307
   _Iyear_81 |   .0722644    .054269     1.33   0.189    -.0367932    .1813221
   _Iyear_82 |   .0904163    .057519     1.57   0.122    -.0251725     .206005
   _Iyear_83 |   .1539363    .050889     3.02   0.004     .0516711    .2562015
   _Iyear_84 |   .5774657   .0502711    11.49   0.000     .4764421    .6784892
   _Iyear_85 |   .8411854     .05796    14.51   0.000     .7247105    .9576603
   _Iyear_86 |   .9923652   .0581129    17.08   0.000      .875583    1.109148
   _Iyear_87 |   1.162606   .0612425    18.98   0.000     1.039535    1.285677
   _Iyear_88 |   1.532503   .0449303    34.11   0.000     1.442213    1.622794
   _Iyear_89 |   1.683325   .0409703    41.09   0.000     1.600992    1.765658
   _Iyear_90 |    1.77749   .0480664    36.98   0.000     1.680897    1.874083
   _Iyear_91 |    1.85856    .043357    42.87   0.000     1.771431    1.945689
   _Iyear_92 |    2.05528   .0373913    54.97   0.000     1.980139     2.13042
   _Iyear_93 |   2.379629   .0350995    67.80   0.000     2.309094    2.450164
   _Iyear_94 |   2.583523   .0345223    74.84   0.000     2.514148    2.652898
   _Iyear_95 |   2.740245    .034752    78.85   0.000     2.670408    2.810082
   _Iyear_96 |          0  (omitted)
   _Iyear_97 |          0  (omitted)
  _Istate_12 |   .9500805   .1510251     6.29   0.000     .6465842    1.253577
  _Istate_13 |   -1.63111   .0645135   -25.28   0.000    -1.760755   -1.501466
  _Istate_14 |   4.023674   .1440251    27.94   0.000     3.734245    4.313103
  _Istate_15 |   1.463578   .0617569    23.70   0.000     1.339473    1.587683
  _Istate_16 |   3.393604   .1185249    28.63   0.000     3.155419    3.631789
  _Istate_21 |    4.98739   .0395062   126.24   0.000     4.907999    5.066781
  _Istate_22 |   3.912854   .0902373    43.36   0.000     3.731515    4.094192
  _Istate_23 |   3.945078   .0962728    40.98   0.000     3.751611    4.138546
  _Istate_31 |   3.596754   .0437882    82.14   0.000     3.508758     3.68475
  _Istate_32 |   2.590203   .1099965    23.55   0.000     2.369157    2.811249
  _Istate_33 |   3.786204   .0582912    64.95   0.000     3.669064    3.903345
  _Istate_34 |   3.409795    .063976    53.30   0.000      3.28123     3.53836
  _Istate_35 |   3.066902   .0902373    33.99   0.000     2.885563     3.24824
  _Istate_41 |   3.290997   .0480008    68.56   0.000     3.194536    3.387458
  _Istate_42 |   1.680789   .0768903    21.86   0.000     1.526272    1.835306
  _Istate_43 |    2.88882   .0267375   108.04   0.000     2.835089    2.942551
  _Istate_44 |  -1.526778   .0565907   -26.98   0.000    -1.640501   -1.413054
  _Istate_45 |  -.8569325   .0480886   -17.82   0.000    -.9535702   -.7602948
  _Istate_46 |   1.264813   .0478831    26.41   0.000     1.168589    1.361038
  _Istate_47 |   1.045407   .0748487    13.97   0.000     .8949933    1.195821
  _Istate_51 |   1.524352   .0667642    22.83   0.000     1.390184    1.658519
  _Istate_52 |   3.014136   .0819458    36.78   0.000      2.84946    3.178812
  _Istate_54 |   2.909558   .0488132    59.61   0.000     2.811465    3.007652
  _Istate_55 |   .8599015    .105724     8.13   0.000     .6474412    1.072362
  _Istate_56 |   2.387677   .0605788    39.41   0.000      2.26594    2.509415
  _Istate_57 |   1.579372   .0768903    20.54   0.000     1.424856    1.733889
  _Istate_58 |   3.005462   .0617569    48.67   0.000     2.881357    3.129567
  _Istate_59 |   3.661666   .0617569    59.29   0.000     3.537561    3.785771
  _Istate_61 |   1.790057   .0541964    33.03   0.000     1.681145    1.898969
  _Istate_62 |   2.183418    .028541    76.50   0.000     2.126063    2.240773
  _Istate_63 |   1.357491   .0797844    17.01   0.000     1.197158    1.517824
  _Istate_64 |  -.5831722   .0592248    -9.85   0.000    -.7021889   -.4641554
  _Istate_71 |    .626959   .0835174     7.51   0.000     .4591244    .7947936
  _Istate_72 |   3.116304   .0617569    50.46   0.000     2.992199    3.240409
  _Istate_73 |   2.294751   .0307068    74.73   0.000     2.233043    2.356459
  _Istate_74 |   4.131405   .0675315    61.18   0.000     3.995695    4.267114
  _Istate_81 |  -1.846293   .1080316   -17.09   0.000    -2.063391   -1.629195
  _Istate_82 |  -.5652552   .0670396    -8.43   0.000    -.6999763    -.430534
  _Istate_83 |    -1.2135   .0652632   -18.59   0.000    -1.344652   -1.082349
  _Istate_84 |   2.844885   .0488132    58.28   0.000     2.746791    2.942979
  _Istate_85 |   .4693829   .0206846    22.69   0.000     .4278156    .5109501
  _Istate_86 |   2.511326   .0487173    51.55   0.000     2.413425    2.609227
  _Istate_87 |   .6637228    .070063     9.47   0.000      .522926    .8045196
  _Istate_88 |    .554182   .0544197    10.18   0.000     .4448215    .6635424
  _Istate_91 |    2.26173   .0025717   879.48   0.000     2.256562    2.266898
  _Istate_92 |   1.732019   .0582912    29.71   0.000     1.614879     1.84916
  _Istate_93 |   5.341638    .092082    58.01   0.000     5.156592    5.526683
  _Istate_94 |  -1.045848   .0526583   -19.86   0.000    -1.151669   -.9400276
  _Istate_95 |   1.147398   .0816288    14.06   0.000     .9833588    1.311437
  _IstaXt_12 |  -.0366638   .0054491    -6.73   0.000    -.0476142   -.0257133
  _IstaXt_13 |   .0370024   .0059737     6.19   0.000     .0249978     .049007
  _IstaXt_14 |  -.1199306   .0052384   -22.89   0.000    -.1304576   -.1094035
  _IstaXt_15 |  -.0631772          .        .       .            .           .
  _IstaXt_16 |  -.1336062   .0049726   -26.87   0.000     -.143599   -.1236134
  _IstaXt_21 |  -.1362045   .0031787   -42.85   0.000    -.1425922   -.1298167
  _IstaXt_22 |  -.1226786   .0047953   -25.58   0.000    -.1323152   -.1130421
  _IstaXt_23 |  -.0974829          .        .       .            .           .
  _IstaXt_31 |  -.0571067   .0033266   -17.17   0.000    -.0637916   -.0504217
  _IstaXt_32 |  -.0452463   .0054491    -8.30   0.000    -.0561967   -.0342958
  _IstaXt_33 |   -.059877          .        .       .            .           .
  _IstaXt_34 |  -.0524816   .0012109   -43.34   0.000     -.054915   -.0500482
  _IstaXt_35 |  -.0862637   .0047953   -17.99   0.000    -.0959002   -.0766271
  _IstaXt_41 |  -.0980004   .0054083   -18.12   0.000    -.1088687    -.087132
  _IstaXt_42 |  -.0738249   .0061028   -12.10   0.000    -.0860889    -.061561
  _IstaXt_43 |  -.0752967   .0052682   -14.29   0.000    -.0858836   -.0647099
  _IstaXt_44 |  -.0407735   .0058078    -7.02   0.000    -.0524447   -.0291023
  _IstaXt_45 |  -.0391381   .0055116    -7.10   0.000    -.0502141   -.0280621
  _IstaXt_46 |  -.0444211   .0055116    -8.06   0.000     -.055497   -.0333451
  _IstaXt_47 |  -.0105788   .0044332    -2.39   0.021    -.0194876     -.00167
  _IstaXt_51 |  -.0866661   .0059136   -14.66   0.000      -.09855   -.0747823
  _IstaXt_52 |  -.0932653   .0048402   -19.27   0.000     -.102992   -.0835386
  _IstaXt_54 |  -.0672718   .0052073   -12.92   0.000    -.0777362   -.0568073
  _IstaXt_55 |  -.0891017   .0052978   -16.82   0.000    -.0997479   -.0784554
  _IstaXt_56 |   .0021807   .0047147     0.46   0.646    -.0072939    .0116553
  _IstaXt_57 |   .0083442   .0061028     1.37   0.178    -.0039198    .0206082
  _IstaXt_58 |  -.0352676          .        .       .            .           .
  _IstaXt_59 |  -.0062965          .        .       .            .           .
  _IstaXt_61 |  -.0343387   .0045754    -7.51   0.000    -.0435334   -.0251441
  _IstaXt_62 |  -.0082071   .0042386    -1.94   0.059    -.0167249    .0003108
  _IstaXt_63 |    .004203   .0094273     0.45   0.658    -.0147419    .0231478
  _IstaXt_64 |   .0873112   .0051433    16.98   0.000     .0769753    .0976471
  _IstaXt_71 |   .0438618   .0043545    10.07   0.000     .0351112    .0526124
  _IstaXt_72 |  -.1034155          .        .       .            .           .
  _IstaXt_73 |  -.0723585   .0050431   -14.35   0.000     -.082493    -.062224
  _IstaXt_74 |   -.053002   .0055758    -9.51   0.000     -.064207    -.041797
  _IstaXt_81 |   .0400339   .0067622     5.92   0.000     .0264447    .0536231
  _IstaXt_82 |   .0049268   .0079606     0.62   0.539    -.0110707    .0209242
  _IstaXt_83 |  -.0478072   .0066715    -7.17   0.000    -.0612141   -.0344004
  _IstaXt_84 |   -.088422   .0052073   -16.98   0.000    -.0988865   -.0779576
  _IstaXt_85 |  -.0172473    .003563    -4.84   0.000    -.0244074   -.0100872
  _IstaXt_86 |  -.0407655   .0088676    -4.60   0.000    -.0585856   -.0229453
  _IstaXt_87 |    .028913   .0061592     4.69   0.000     .0165356    .0412904
  _IstaXt_88 |  -.0148517   .0092721    -1.60   0.116    -.0334848    .0037813
  _IstaXt_91 |  -.0536976   .0042861   -12.53   0.000    -.0623109   -.0450843
  _IstaXt_92 |  -.0276636          .        .       .            .           .
  _IstaXt_93 |  -.0991496   .0018196   -54.49   0.000    -.1028062    -.095493
  _IstaXt_94 |  -.0339381   .0077745    -4.37   0.000    -.0495616   -.0183145
  _IstaXt_95 |  -.0945871   .0052903   -17.88   0.000    -.1052184   -.0839559
       _cons |   6.117107   .0678351    90.18   0.000     5.980788    6.253427
------------------------------------------------------------------------------

. reg lnths many _Iyear* _Istate* _IstaXt_* [aw=empwt], cluster(state);
(sum of wgt is 850)
note: _Iyear_75 omitted because of collinearity.
note: _Iyear_76 omitted because of collinearity.
note: _Iyear_96 omitted because of collinearity.
note: _Iyear_97 omitted because of collinearity.

Linear regression                               Number of obs     =        850
                                                F(16, 49)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.9875
                                                Root MSE          =     .20527

                                 (Std. err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        many |   .0712801   .0650938     1.10   0.279    -.0595307     .202091
   _Iyear_75 |          0  (omitted)
   _Iyear_76 |          0  (omitted)
   _Iyear_80 |   .0226302   .0339809     0.67   0.509    -.0456569    .0909173
   _Iyear_81 |   .0569287   .0531395     1.07   0.289    -.0498591    .1637166
   _Iyear_82 |   .0722769   .0580976     1.24   0.219    -.0444747    .1890285
   _Iyear_83 |   .1445521   .0533945     2.71   0.009     .0372519    .2518524
   _Iyear_84 |   .5696757   .0522996    10.89   0.000     .4645759    .6747756
   _Iyear_85 |   .8367546   .0613738    13.63   0.000     .7134194    .9600898
   _Iyear_86 |   .9914049   .0575934    17.21   0.000     .8756666    1.107143
   _Iyear_87 |   1.166487   .0606304    19.24   0.000     1.044646    1.288329
   _Iyear_88 |   1.541008   .0467328    32.97   0.000     1.447095    1.634922
   _Iyear_89 |   1.684157   .0422353    39.88   0.000     1.599282    1.769032
   _Iyear_90 |   1.776323   .0499916    35.53   0.000     1.675861    1.876785
   _Iyear_91 |   1.855395   .0464468    39.95   0.000     1.762057    1.948733
   _Iyear_92 |   2.047116   .0396101    51.68   0.000     1.967516    2.126715
   _Iyear_93 |   2.369467   .0363063    65.26   0.000     2.296507    2.442428
   _Iyear_94 |   2.569788   .0342763    74.97   0.000     2.500907    2.638669
   _Iyear_95 |   2.724511   .0346964    78.52   0.000     2.654786    2.794236
   _Iyear_96 |          0  (omitted)
   _Iyear_97 |          0  (omitted)
  _Istate_12 |   .6669017   1.38e-08  4.8e+07   0.000     .6669017    .6669017
  _Istate_13 |  -1.698468   .0703587   -24.14   0.000    -1.839859   -1.557077
  _Istate_14 |   3.745795   1.34e-08  2.8e+08   0.000     3.745795    3.745795
  _Istate_15 |    1.39743   .0650938    21.47   0.000     1.266619     1.52824
  _Istate_16 |   3.184376   .0153162   207.91   0.000     3.153597    3.215155
  _Istate_21 |   4.945075   .0416409   118.76   0.000     4.861394    5.028755
  _Istate_22 |   3.763856   .0153162   245.74   0.000     3.733077    3.794635
  _Istate_23 |   3.785124   1.24e-08  3.1e+08   0.000     3.785124    3.785125
  _Istate_31 |   3.550298   .0416409    85.26   0.000     3.466617    3.633978
  _Istate_32 |   2.393871   1.52e-09  1.6e+09   0.000     2.393871    2.393871
  _Istate_33 |   3.763679   8.44e-09  4.5e+08   0.000     3.763679    3.763679
  _Istate_34 |   3.354933   1.06e-08  3.2e+08   0.000     3.354933    3.354933
  _Istate_35 |   2.917905   .0153162   190.51   0.000     2.887126    2.948684
  _Istate_41 |   3.241636   .0526494    61.57   0.000     3.135833    3.347439
  _Istate_42 |    1.58585   .0703587    22.54   0.000     1.444459    1.727242
  _Istate_43 |   2.886655   .0526494    54.83   0.000     2.780852    2.992458
  _Istate_44 |  -1.584045    .062222   -25.46   0.000    -1.709084   -1.459005
  _Istate_45 |   -.903147   .0526494   -17.15   0.000     -1.00895   -.7973441
  _Istate_46 |   1.217274   .0526494    23.12   0.000     1.111471    1.323077
  _Istate_47 |   .9335913   .0291965    31.98   0.000     .8749188    .9922638
  _Istate_51 |   1.508954   .0871108    17.32   0.000     1.333898    1.684009
  _Istate_52 |   2.885141   .0291965    98.82   0.000     2.826469    2.943814
  _Istate_54 |   2.857878   .0526494    54.28   0.000     2.752075    2.963681
  _Istate_55 |   .6746854   2.85e-09  2.4e+08   0.000     .6746853    .6746854
  _Istate_56 |   2.329116   .0703587    33.10   0.000     2.187725    2.470508
  _Istate_57 |   1.484434   .0703587    21.10   0.000     1.343042    1.625825
  _Istate_58 |   2.939314   .0650938    45.16   0.000     2.808503    3.070125
  _Istate_59 |   3.595518   .0650938    55.24   0.000     3.464707    3.726329
  _Istate_61 |   1.732248   .0526494    32.90   0.000     1.626446    1.838051
  _Istate_62 |   2.152755   .0291965    73.73   0.000     2.094083    2.211428
  _Istate_63 |   1.294682   .0823245    15.73   0.000     1.129245    1.460119
  _Istate_64 |  -.6244893   .0823245    -7.59   0.000    -.7899266   -.4590521
  _Istate_71 |   .4951403   .0153162    32.33   0.000     .4643613    .5259193
  _Istate_72 |   3.050156   .0650938    46.86   0.000     2.919345    3.180966
  _Istate_73 |   2.283755   7.72e-09  3.0e+08   0.000     2.283755    2.283755
  _Istate_74 |   4.050003    .062222    65.09   0.000     3.924963    4.175042
  _Istate_81 |  -2.048931   .0153162  -133.78   0.000     -2.07971   -2.018152
  _Istate_82 |  -.5594027   8.48e-09 -6.6e+07   0.000    -.5594027   -.5594027
  _Istate_83 |  -1.260088   .0703587   -17.91   0.000    -1.401479   -1.118696
  _Istate_84 |   2.793205   .0526494    53.05   0.000     2.687402    2.899008
  _Istate_85 |   .4495123   .0153162    29.35   0.000     .4187333    .4802913
  _Istate_86 |   2.466016   .0526494    46.84   0.000     2.360213    2.571819
  _Istate_87 |    .593531   .0770595     7.70   0.000      .438674    .7483879
  _Istate_88 |   .5205351   .0526494     9.89   0.000     .4147323     .626338
  _Istate_91 |   2.260736   1.22e-08  1.9e+08   0.000     2.260736    2.260736
  _Istate_92 |   1.709494   1.20e-08  1.4e+08   0.000     1.709494    1.709494
  _Istate_93 |   5.258882   1.07e-08  4.9e+08   0.000     5.258882    5.258882
  _Istate_94 |  -1.110267   .0526494   -21.09   0.000     -1.21607   -1.004465
  _Istate_95 |    1.02219   .0416409    24.55   0.000     .9385094     1.10587
  _IstaXt_12 |  -.0245377   1.48e-09 -1.7e+07   0.000    -.0245378   -.0245377
  _IstaXt_13 |   .0404203   .0052649     7.68   0.000       .02984    .0510006
  _IstaXt_14 |  -.1082462   1.63e-09 -6.6e+07   0.000    -.1082462   -.1082462
  _IstaXt_15 |  -.0631772   6.03e-10 -1.0e+08   0.000    -.0631772   -.0631772
  _IstaXt_16 |  -.1258744   .0012763   -98.62   0.000    -.1284393   -.1233095
  _IstaXt_21 |  -.1327998   .0033504   -39.64   0.000    -.1395327   -.1260669
  _IstaXt_22 |  -.1134024   .0012763   -88.85   0.000    -.1159674   -.1108375
  _IstaXt_23 |  -.0974829   1.38e-09 -7.1e+07   0.000     -.097483   -.0974829
  _IstaXt_31 |  -.0535363   .0033504   -15.98   0.000    -.0602693   -.0468034
  _IstaXt_32 |  -.0331202   1.49e-09 -2.2e+07   0.000    -.0331202   -.0331202
  _IstaXt_33 |   -.059877   1.40e-09 -4.3e+07   0.000     -.059877    -.059877
  _IstaXt_34 |  -.0497869   1.70e-09 -2.9e+07   0.000    -.0497869   -.0497869
  _IstaXt_35 |  -.0769875   .0012763   -60.32   0.000    -.0795524   -.0744226
  _IstaXt_41 |  -.0957174   .0041481   -23.07   0.000    -.1040534   -.0873814
  _IstaXt_42 |  -.0692861   .0052649   -13.16   0.000    -.0798664   -.0587059
  _IstaXt_43 |  -.0846925   .0041481   -20.42   0.000    -.0930285   -.0763565
  _IstaXt_44 |  -.0378972   .0047863    -7.92   0.000    -.0475157   -.0282788
  _IstaXt_45 |  -.0369103   .0041481    -8.90   0.000    -.0452463   -.0285743
  _IstaXt_46 |  -.0421933   .0041481   -10.17   0.000    -.0505293   -.0338573
  _IstaXt_47 |  -.0039225   .0023932    -1.64   0.108    -.0087317    .0008867
  _IstaXt_51 |  -.0962277   .0041481   -23.20   0.000    -.1045637   -.0878917
  _IstaXt_52 |  -.0855985   .0023932   -35.77   0.000    -.0904077   -.0807893
  _IstaXt_54 |  -.0648784   .0041481   -15.64   0.000    -.0732144   -.0565424
  _IstaXt_55 |  -.0773125   9.49e-10 -8.1e+07   0.000    -.0773125   -.0773125
  _IstaXt_56 |  -.0054065   .0052649    -1.03   0.310    -.0159868    .0051737
  _IstaXt_57 |    .012883   .0052649     2.45   0.018     .0023027    .0234633
  _IstaXt_58 |  -.0352676   1.11e-09 -3.2e+07   0.000    -.0352676   -.0352676
  _IstaXt_59 |  -.0062965   1.40e-09 -4.5e+06   0.000    -.0062965   -.0062965
  _IstaXt_61 |  -.0315589   .0041481    -7.61   0.000    -.0398949   -.0232229
  _IstaXt_62 |  -.0074314   .0023932    -3.11   0.003    -.0122407   -.0026222
  _IstaXt_63 |   .0030899   .0057436     0.54   0.593    -.0084522     .014632
  _IstaXt_64 |   .0790342   .0057436    13.76   0.000     .0674921    .0905763
  _IstaXt_71 |   .0521275   .0012763    40.84   0.000     .0495625    .0546924
  _IstaXt_72 |  -.1034155   1.12e-09 -9.2e+07   0.000    -.1034155   -.1034155
  _IstaXt_73 |  -.0737117          .        .       .            .           .
  _IstaXt_74 |   -.048784   .0047863   -10.19   0.000    -.0584024   -.0391655
  _IstaXt_81 |   .0462666   .0012763    36.25   0.000     .0437017    .0488315
  _IstaXt_82 |  -.0018299   9.05e-10 -2.0e+06   0.000    -.0018299   -.0018299
  _IstaXt_83 |   -.047285   .0052649    -8.98   0.000    -.0578653   -.0367047
  _IstaXt_84 |  -.0860286   .0041481   -20.74   0.000    -.0943646   -.0776927
  _IstaXt_85 |  -.0173857   .0012763   -13.62   0.000    -.0199507   -.0148208
  _IstaXt_86 |  -.0447426   .0041481   -10.79   0.000    -.0530786   -.0364066
  _IstaXt_87 |   .0326551    .005584     5.85   0.000     .0214336    .0438767
  _IstaXt_88 |  -.0192424   .0041481    -4.64   0.000    -.0275784   -.0109064
  _IstaXt_91 |  -.0553539   1.03e-09 -5.4e+07   0.000    -.0553539   -.0553539
  _IstaXt_92 |  -.0276636   1.20e-09 -2.3e+07   0.000    -.0276636   -.0276636
  _IstaXt_93 |   -.100694          .        .       .            .           .
  _IstaXt_94 |  -.0366743   .0041481    -8.84   0.000    -.0450103   -.0283383
  _IstaXt_95 |  -.0876262   .0033504   -26.15   0.000    -.0943591   -.0808933
       _cons |   6.189482   .0590181   104.87   0.000     6.070881    6.308083
------------------------------------------------------------------------------

. reg lnths mcount _Iyear* _Istate* _IstaXt_* [aw=empwt], cluster(state);
(sum of wgt is 850)
note: _Iyear_75 omitted because of collinearity.
note: _Iyear_76 omitted because of collinearity.
note: _Iyear_96 omitted because of collinearity.
note: _Iyear_97 omitted because of collinearity.

Linear regression                               Number of obs     =        850
                                                F(16, 49)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.9875
                                                Root MSE          =     .20546

                                 (Std. err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      mcount |   .0342485   .0315429     1.09   0.283    -.0291394    .0976364
   _Iyear_75 |          0  (omitted)
   _Iyear_76 |          0  (omitted)
   _Iyear_80 |   .0251049   .0322651     0.78   0.440    -.0397342     .089944
   _Iyear_81 |   .0623961    .052343     1.19   0.239     -.042791    .1675832
   _Iyear_82 |    .080052   .0563424     1.42   0.162    -.0331724    .1932763
   _Iyear_83 |   .1584493   .0512159     3.09   0.003     .0555271    .2613716
   _Iyear_84 |   .5824001   .0494332    11.78   0.000     .4830603    .6817399
   _Iyear_85 |   .8457333   .0600615    14.08   0.000     .7250353    .9664314
   _Iyear_86 |   .9984701   .0581083    17.18   0.000      .881697    1.115243
   _Iyear_87 |    1.17101   .0625318    18.73   0.000     1.045348    1.296672
   _Iyear_88 |   1.544932    .044683    34.58   0.000     1.455138    1.634726
   _Iyear_89 |   1.686796   .0411008    41.04   0.000     1.604201    1.769391
   _Iyear_90 |   1.779733   .0476971    37.31   0.000     1.683882    1.875584
   _Iyear_91 |   1.859576   .0437579    42.50   0.000     1.771641    1.947511
   _Iyear_92 |   2.052808   .0370304    55.44   0.000     1.978393    2.127223
   _Iyear_93 |    2.37593   .0339641    69.95   0.000     2.307677    2.444184
   _Iyear_94 |   2.576336   .0344119    74.87   0.000     2.507183    2.645489
   _Iyear_95 |   2.731831   .0345584    79.05   0.000     2.662383    2.801278
   _Iyear_96 |          0  (omitted)
   _Iyear_97 |          0  (omitted)
  _Istate_12 |   .6437336   .0213379    30.17   0.000     .6008536    .6866137
  _Istate_13 |  -1.732199   .0398925   -43.42   0.000    -1.812366   -1.652032
  _Istate_14 |   3.730686    .013916   268.09   0.000      3.70272    3.758651
  _Istate_15 |   1.360398   .0315429    43.13   0.000      1.29701    1.423786
  _Istate_16 |   3.152243   .0141479   222.81   0.000     3.123812    3.180674
  _Istate_21 |   4.921385   .0201782   243.90   0.000     4.880836    4.961935
  _Istate_22 |   3.757913   .0099731   376.80   0.000     3.737871    3.777955
  _Istate_23 |   3.785124          .        .       .            .           .
  _Istate_31 |   3.520313   .0143799   244.81   0.000     3.491415     3.54921
  _Istate_32 |   2.402937   .0083496   287.79   0.000     2.386158    2.419716
  _Istate_33 |   3.729431   .0315429   118.23   0.000     3.666043    3.792818
  _Istate_34 |   3.328743   .0241211   138.00   0.000      3.28027    3.377216
  _Istate_35 |   2.911961   .0099731   291.98   0.000      2.89192    2.932003
  _Istate_41 |   3.217979    .031311   102.77   0.000     3.155058    3.280901
  _Istate_42 |   1.554889   .0424438    36.63   0.000     1.469595    1.640183
  _Istate_43 |   2.847133   .0166992   170.50   0.000     2.813575    2.880692
  _Istate_44 |  -1.610377   .0385009   -41.83   0.000    -1.687747   -1.533006
  _Istate_45 |  -.9220187   .0357177   -25.81   0.000    -.9937961   -.8502412
  _Istate_46 |   1.196387   .0338623    35.33   0.000     1.128339    1.264436
  _Istate_47 |   .9154706   .0127563    71.77   0.000     .8898358    .9411054
  _Istate_51 |   1.459396   .0422119    34.57   0.000     1.374569    1.544224
  _Istate_52 |   2.871302   .0166992   171.94   0.000     2.837743     2.90486
  _Istate_54 |   2.830696   .0280639   100.87   0.000       2.7743    2.887093
  _Istate_55 |    .680981   .0057983   117.44   0.000     .6693289    .6926332
  _Istate_56 |    2.28909   .0340942    67.14   0.000     2.220575    2.357604
  _Istate_57 |   1.453472   .0424438    34.24   0.000     1.368178    1.538766
  _Istate_58 |   2.902283   .0315429    92.01   0.000     2.838895     2.96567
  _Istate_59 |   3.558487   .0315429   112.81   0.000     3.495099    3.621874
  _Istate_61 |   1.695749   .0194824    87.04   0.000     1.656598      1.7349
  _Istate_62 |   2.134634   .0127563   167.34   0.000        2.109    2.160269
  _Istate_63 |   1.256914   .0482421    26.05   0.000     1.159968     1.35386
  _Istate_64 |  -.6713235   .0398925   -16.83   0.000    -.7514905   -.5911565
  _Istate_71 |    .484916   .0060303    80.41   0.000     .4727977    .4970343
  _Istate_72 |   3.013124   .0315429    95.52   0.000     2.949736    3.076512
  _Istate_73 |   2.287784   .0037109   616.50   0.000     2.280327    2.295242
  _Istate_74 |   4.017375   .0327026   122.85   0.000     3.951657    4.083093
  _Istate_81 |  -2.060918   .0044067  -467.67   0.000    -2.069773   -2.052062
  _Istate_82 |  -.5813117   .0201782   -28.81   0.000    -.6218613   -.5407621
  _Istate_83 |  -1.280472    .052185   -24.54   0.000    -1.385342   -1.175602
  _Istate_84 |   2.766023   .0280639    98.56   0.000     2.709626    2.822419
  _Istate_85 |   .4342514   .0013916   312.05   0.000     .4314549     .437048
  _Istate_86 |   2.441604   .0306152    79.75   0.000     2.380081    2.503128
  _Istate_87 |   .5620316    .048706    11.54   0.000     .4641532    .6599099
  _Istate_88 |   .4981379   .0324707    15.34   0.000     .4328857    .5633901
  _Istate_91 |   2.259225   .0013916  1623.47   0.000     2.256429    2.262022
  _Istate_92 |   1.675246   .0315429    53.11   0.000     1.611858    1.738633
  _Istate_93 |   5.198443    .055664    93.39   0.000     5.086582    5.310304
  _Istate_94 |  -1.140471   .0252807   -45.11   0.000    -1.191275   -1.089668
  _Istate_95 |   1.004796   .0259765    38.68   0.000     .9525944    1.056998
  _IstaXt_12 |  -.0275597   .0027832    -9.90   0.000    -.0331527   -.0219666
  _IstaXt_13 |   .0404775   .0052572     7.70   0.000     .0299129    .0510422
  _IstaXt_14 |  -.1119397   .0034017   -32.91   0.000    -.1187756   -.1051037
  _IstaXt_15 |  -.0631772          .        .       .            .           .
  _IstaXt_16 |  -.1285899   .0037882   -33.94   0.000    -.1362027   -.1209771
  _IstaXt_21 |  -.1308938   .0016235   -80.62   0.000    -.1341564   -.1276311
  _IstaXt_22 |  -.1154464   .0031698   -36.42   0.000    -.1218163   -.1090766
  _IstaXt_23 |  -.0974829   2.22e-10 -4.4e+08   0.000    -.0974829   -.0974829
  _IstaXt_31 |  -.0513785   .0013916   -36.92   0.000     -.054175    -.048582
  _IstaXt_32 |  -.0361422   .0027832   -12.99   0.000    -.0417352   -.0305491
  _IstaXt_33 |   -.059877   8.18e-10 -7.3e+07   0.000     -.059877    -.059877
  _IstaXt_34 |  -.0504585   .0006185   -81.58   0.000    -.0517014   -.0492156
  _IstaXt_35 |  -.0790315   .0031698   -24.93   0.000    -.0854013   -.0726616
  _IstaXt_41 |  -.0962955    .004716   -20.42   0.000    -.1057726   -.0868184
  _IstaXt_42 |  -.0693129   .0053345   -12.99   0.000    -.0800329   -.0585929
  _IstaXt_43 |  -.0821648   .0018555   -44.28   0.000    -.0858935   -.0784361
  _IstaXt_44 |  -.0381962   .0051025    -7.49   0.000    -.0484502   -.0279423
  _IstaXt_45 |  -.0375724   .0047933    -7.84   0.000    -.0472049   -.0279399
  _IstaXt_46 |  -.0428554   .0047933    -8.94   0.000    -.0524878   -.0332229
  _IstaXt_47 |  -.0050793    .003479    -1.46   0.151    -.0120706     .001912
  _IstaXt_51 |  -.0938679   .0020101   -46.70   0.000    -.0979073   -.0898284
  _IstaXt_52 |  -.0870071   .0037109   -23.45   0.000    -.0944645   -.0795497
  _IstaXt_54 |  -.0652886   .0045614   -14.31   0.000     -.074455   -.0561222
  _IstaXt_55 |  -.0802505   .0027059   -29.66   0.000    -.0856882   -.0748128
  _IstaXt_56 |  -.0024113   .0025513    -0.95   0.349    -.0075383    .0027156
  _IstaXt_57 |   .0128563   .0053345     2.41   0.020     .0021363    .0235763
  _IstaXt_58 |  -.0352676   8.84e-10 -4.0e+07   0.000    -.0352676   -.0352676
  _IstaXt_59 |  -.0062965          .        .       .            .           .
  _IstaXt_61 |  -.0313815   .0040202    -7.81   0.000    -.0394604   -.0233027
  _IstaXt_62 |  -.0085882    .003479    -2.47   0.017    -.0155796   -.0015969
  _IstaXt_63 |   .0033355   .0055664     0.60   0.552    -.0078506    .0145216
  _IstaXt_64 |   .0823017   .0027832    29.57   0.000     .0767087    .0878948
  _IstaXt_71 |   .0503353   .0029378    17.13   0.000     .0444315    .0562391
  _IstaXt_72 |  -.1034155          .        .       .            .           .
  _IstaXt_73 |  -.0763979    .002474   -30.88   0.000    -.0813695   -.0714263
  _IstaXt_74 |  -.0488312   .0048706   -10.03   0.000     -.058619   -.0390433
  _IstaXt_81 |    .042208   .0050252     8.40   0.000     .0321095    .0523066
  _IstaXt_82 |  -.0047678   .0027059    -1.76   0.084    -.0102055    .0006698
  _IstaXt_83 |  -.0484869   .0064168    -7.56   0.000     -.061382   -.0355919
  _IstaXt_84 |  -.0864389   .0045614   -18.95   0.000    -.0956053   -.0772725
  _IstaXt_85 |  -.0188421   .0026286    -7.17   0.000    -.0241245   -.0135598
  _IstaXt_86 |   -.047923   .0071126    -6.74   0.000    -.0622163   -.0336296
  _IstaXt_87 |   .0328939   .0054118     6.08   0.000     .0220185    .0437693
  _IstaXt_88 |  -.0224227   .0071126    -3.15   0.003    -.0367161   -.0081294
  _IstaXt_91 |  -.0578722   .0023193   -24.95   0.000     -.062533   -.0532113
  _IstaXt_92 |  -.0276636          .        .       .            .           .
  _IstaXt_93 |  -.1013655   .0006185  -163.89   0.000    -.1026084   -.1001226
  _IstaXt_94 |  -.0394349   .0067261    -5.86   0.000    -.0529514   -.0259184
  _IstaXt_95 |  -.0886581   .0043294   -20.48   0.000    -.0973584   -.0799578
       _cons |    6.22045   .0387074   160.70   0.000     6.142665    6.298236
------------------------------------------------------------------------------

. reg lnths mone mtwo mthree _Iyear* _Istate* _IstaXt_* [aw=empwt], cluster(state);
(sum of wgt is 850)
note: _Iyear_75 omitted because of collinearity.
note: _Iyear_76 omitted because of collinearity.
note: _Iyear_96 omitted because of collinearity.
note: _Iyear_97 omitted because of collinearity.

Linear regression                               Number of obs     =        850
                                                F(18, 49)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.9876
                                                Root MSE          =     .20519

                                 (Std. err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        mone |   .0745716   .0675697     1.10   0.275    -.0612147    .2103579
        mtwo |   .0572944   .0723717     0.79   0.432     -.088142    .2027309
      mthree |   .1527636   .1263492     1.21   0.232    -.1011446    .4066718
   _Iyear_75 |          0  (omitted)
   _Iyear_76 |          0  (omitted)
   _Iyear_80 |   .0220644   .0343751     0.64   0.524     -.047015    .0911437
   _Iyear_81 |   .0568673   .0538142     1.06   0.296    -.0512764     .165011
   _Iyear_82 |   .0730654   .0593134     1.23   0.224    -.0461294    .1922602
   _Iyear_83 |   .1464208   .0537096     2.73   0.009     .0384874    .2543542
   _Iyear_84 |   .5738424   .0524061    10.95   0.000     .4685285    .6791563
   _Iyear_85 |   .8409307   .0601522    13.98   0.000     .7200503    .9618111
   _Iyear_86 |   .9956898   .0571582    17.42   0.000     .8808261    1.110553
   _Iyear_87 |   1.169252   .0627036    18.65   0.000     1.043244    1.295259
   _Iyear_88 |   1.540656    .046601    33.06   0.000     1.447007    1.634304
   _Iyear_89 |   1.683288   .0424584    39.65   0.000     1.597964    1.768611
   _Iyear_90 |   1.776156   .0493075    36.02   0.000     1.677069    1.875243
   _Iyear_91 |    1.85593   .0462135    40.16   0.000      1.76306    1.948799
   _Iyear_92 |   2.048286   .0396306    51.68   0.000     1.968646    2.127927
   _Iyear_93 |    2.37134   .0370315    64.04   0.000     2.296922    2.445757
   _Iyear_94 |   2.570453   .0356327    72.14   0.000     2.498846    2.642059
   _Iyear_95 |   2.725878   .0362191    75.26   0.000     2.653093    2.798663
   _Iyear_96 |          0  (omitted)
   _Iyear_97 |          0  (omitted)
  _Istate_12 |   .7150659    .082122     8.71   0.000     .5500355    .8800963
  _Istate_13 |  -1.698086   .0694594   -24.45   0.000     -1.83767   -1.558502
  _Istate_14 |   3.789894   .0694467    54.57   0.000     3.650336    3.929453
  _Istate_15 |   1.400721   .0675697    20.73   0.000     1.264935    1.536507
  _Istate_16 |   3.206084   .0587586    54.56   0.000     3.088005    3.324164
  _Istate_21 |    4.94718   .0432247   114.45   0.000     4.860317    5.034044
  _Istate_22 |   3.763233   .0147262   255.55   0.000      3.73364    3.792827
  _Istate_23 |   3.785124   1.61e-08  2.4e+08   0.000     3.785124    3.785125
  _Istate_31 |   3.555579   .0487817    72.89   0.000     3.457549     3.65361
  _Istate_32 |   2.389298   .0165295   144.55   0.000     2.356081    2.422515
  _Istate_33 |   3.780956   .0624447    60.55   0.000     3.655469    3.906444
  _Istate_34 |   3.368145   .0477519    70.53   0.000     3.272184    3.464106
  _Istate_35 |   2.917282   .0147262   198.10   0.000     2.887688    2.946875
  _Istate_41 |   3.241122   .0513688    63.10   0.000     3.137893    3.344352
  _Istate_42 |   1.584835   .0684392    23.16   0.000     1.447301    1.722368
  _Istate_43 |   2.894144   .0634084    45.64   0.000     2.766721    3.021568
  _Istate_44 |  -1.585472   .0602355   -26.32   0.000     -1.70652   -1.464424
  _Istate_45 |  -.9060744   .0505021   -17.94   0.000    -1.007562   -.8045867
  _Istate_46 |   1.215363   .0506861    23.98   0.000     1.113505     1.31722
  _Istate_47 |   .9358299   .0314637    29.74   0.000     .8726012    .9990586
  _Istate_51 |   1.513358   .0904241    16.74   0.000     1.331644    1.695072
  _Istate_52 |    2.88522   .0287566   100.33   0.000     2.827432    2.943009
  _Istate_54 |   2.859143   .0529265    54.02   0.000     2.752783    2.965503
  _Istate_55 |   .6715094   .0114788    58.50   0.000     .6484419    .6945769
  _Istate_56 |   2.332674   .0730349    31.94   0.000     2.185905    2.479443
  _Istate_57 |   1.483418   .0684392    21.67   0.000     1.345884    1.620952
  _Istate_58 |   2.942606   .0675697    43.55   0.000     2.806819    3.078392
  _Istate_59 |    3.59881   .0675697    53.26   0.000     3.463023    3.734596
  _Istate_61 |   1.738214   .0602361    28.86   0.000     1.617165    1.859263
  _Istate_62 |   2.154994   .0314637    68.49   0.000     2.091765    2.218222
  _Istate_63 |   1.294272   .0805945    16.06   0.000     1.132311    1.456232
  _Istate_64 |  -.6203266   .0854558    -7.26   0.000    -.7920564   -.4485968
  _Istate_71 |    .496677   .0171424    28.97   0.000      .462228    .5311259
  _Istate_72 |   3.053447   .0675697    45.19   0.000     2.917661    3.189233
  _Istate_73 |   2.281723   .0073464   310.59   0.000     2.266959    2.296486
  _Istate_74 |   4.051752   .0628306    64.49   0.000     3.925489    4.178014
  _Istate_81 |   -2.01666   .0494201   -40.81   0.000    -2.115974   -1.917347
  _Istate_82 |  -.5077286   .0852339    -5.96   0.000    -.6790124   -.3364447
  _Istate_83 |  -1.242397   .0700469   -17.74   0.000    -1.383162   -1.101633
  _Istate_84 |    2.79447   .0529265    52.80   0.000      2.68811    2.900829
  _Istate_85 |   .4535897   .0232478    19.51   0.000     .4068715    .5003079
  _Istate_86 |   2.475003   .0534659    46.29   0.000     2.367559    2.582446
  _Istate_87 |   .5912026   .0743514     7.95   0.000     .4417879    .7406174
  _Istate_88 |   .5492308    .064454     8.52   0.000     .4197057    .6787559
  _Istate_91 |   2.261499   .0027549   820.90   0.000     2.255962    2.267035
  _Istate_92 |   1.726771   .0624447    27.65   0.000     1.601284    1.852259
  _Istate_93 |   5.203153   .0979021    53.15   0.000     5.006411    5.399895
  _Istate_94 |  -1.086753   .0651111   -16.69   0.000    -1.217598   -.9559072
  _Istate_95 |    1.02112    .040257    25.37   0.000       .94022    1.102019
  _IstaXt_12 |  -.0329615   .0107747    -3.06   0.004    -.0546142   -.0113088
  _IstaXt_13 |   .0416362   .0060142     6.92   0.000     .0295502    .0537222
  _IstaXt_14 |  -.1163312   .0105228   -11.06   0.000    -.1374775   -.0951849
  _IstaXt_15 |  -.0631772   2.02e-09 -3.1e+07   0.000    -.0631772   -.0631772
  _IstaXt_16 |  -.1333219   .0096399   -13.83   0.000    -.1526941   -.1139498
  _IstaXt_21 |  -.1329692   .0034779   -38.23   0.000    -.1399582   -.1259802
  _IstaXt_22 |  -.1120696    .004706   -23.81   0.000    -.1215266   -.1026125
  _IstaXt_23 |  -.0974829   1.22e-09 -8.0e+07   0.000     -.097483   -.0974829
  _IstaXt_31 |  -.0538328    .003678   -14.64   0.000     -.061224   -.0464416
  _IstaXt_32 |  -.0315958   .0055098    -5.73   0.000    -.0426682   -.0205234
  _IstaXt_33 |   -.059877   1.61e-09 -3.7e+07   0.000     -.059877    -.059877
  _IstaXt_34 |  -.0494482   .0012244   -40.39   0.000    -.0519087   -.0469876
  _IstaXt_35 |  -.0756546    .004706   -16.08   0.000    -.0851117   -.0661976
  _IstaXt_41 |   -.094445     .00544   -17.36   0.000     -.105377    -.083513
  _IstaXt_42 |  -.0680279   .0060987   -11.15   0.000    -.0802837   -.0557721
  _IstaXt_43 |  -.0849869    .004432   -19.18   0.000    -.0938934   -.0760805
  _IstaXt_44 |  -.0366148   .0058399    -6.27   0.000    -.0483505   -.0248791
  _IstaXt_45 |  -.0355956   .0055455    -6.42   0.000    -.0467397   -.0244516
  _IstaXt_46 |  -.0408786   .0055455    -7.37   0.000    -.0520226   -.0297346
  _IstaXt_47 |  -.0027731   .0043045    -0.64   0.522    -.0114234    .0058771
  _IstaXt_51 |  -.0964375   .0043059   -22.40   0.000    -.1050905   -.0877844
  _IstaXt_52 |  -.0843221   .0046993   -17.94   0.000    -.0937657   -.0748784
  _IstaXt_54 |  -.0636907    .005236   -12.16   0.000    -.0742128   -.0531686
  _IstaXt_55 |  -.0758304   .0053568   -14.16   0.000    -.0865952   -.0650655
  _IstaXt_56 |  -.0056728   .0054652    -1.04   0.304    -.0166555    .0053099
  _IstaXt_57 |   .0141413   .0060987     2.32   0.025     .0018855    .0263971
  _IstaXt_58 |  -.0352676   1.80e-09 -2.0e+07   0.000    -.0352676   -.0352676
  _IstaXt_59 |  -.0062965   1.96e-09 -3.2e+06   0.000    -.0062966   -.0062965
  _IstaXt_61 |  -.0306676   .0046119    -6.65   0.000    -.0399356   -.0213996
  _IstaXt_62 |  -.0062821   .0043045    -1.46   0.151    -.0149323    .0023682
  _IstaXt_63 |   .0043239   .0063857     0.68   0.502    -.0085087    .0171565
  _IstaXt_64 |   .0787438    .005962    13.21   0.000     .0667626    .0907249
  _IstaXt_71 |   .0533333   .0042643    12.51   0.000     .0447638    .0619028
  _IstaXt_72 |  -.1034155   1.77e-09 -5.8e+07   0.000    -.1034155   -.1034155
  _IstaXt_73 |  -.0723566   .0048976   -14.77   0.000    -.0821988   -.0625145
  _IstaXt_74 |  -.0476286   .0055678    -8.55   0.000    -.0588175   -.0364397
  _IstaXt_81 |   .0386676   .0103211     3.75   0.000     .0179265    .0594087
  _IstaXt_82 |  -.0100196   .0104754    -0.96   0.344    -.0310708    .0110316
  _IstaXt_83 |   -.049579     .00657    -7.55   0.000     -.062782    -.036376
  _IstaXt_84 |   -.084841    .005236   -16.20   0.000    -.0953631   -.0743188
  _IstaXt_85 |  -.0163493   .0036821    -4.44   0.000    -.0237487   -.0089499
  _IstaXt_86 |  -.0512767   .0098939    -5.18   0.000    -.0711592   -.0313942
  _IstaXt_87 |   .0338549   .0062084     5.45   0.000     .0213787    .0463311
  _IstaXt_88 |  -.0266055   .0106597    -2.50   0.016     -.048027    -.005184
  _IstaXt_91 |  -.0540835   .0045915   -11.78   0.000    -.0633105   -.0448565
  _IstaXt_92 |  -.0276636   1.81e-09 -1.5e+07   0.000    -.0276636   -.0276636
  _IstaXt_93 |  -.1025659   .0023944   -42.84   0.000    -.1073776   -.0977542
  _IstaXt_94 |  -.0439728   .0103983    -4.23   0.000     -.064869   -.0230766
  _IstaXt_95 |  -.0863135   .0051518   -16.75   0.000    -.0966663   -.0759606
       _cons |   6.184918   .0617078   100.23   0.000     6.060911    6.308924
------------------------------------------------------------------------------

. reg lnths mico mppa mgfa many _Iyear* _Istate* _IstaXt_* [aw=empwt], cluster(state);
(sum of wgt is 850)
note: _Iyear_75 omitted because of collinearity.
note: _Iyear_76 omitted because of collinearity.
note: _Iyear_96 omitted because of collinearity.
note: _Iyear_97 omitted because of collinearity.

Linear regression                               Number of obs     =        850
                                                F(19, 49)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.9878
                                                Root MSE          =     .20375

                                 (Std. err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        mico |    .126333   .0668153     1.89   0.065    -.0079374    .2606033
        mppa |  -.0311637    .082366    -0.38   0.707    -.1966843    .1343569
        mgfa |  -.0836027   .0897022    -0.93   0.356     -.263866    .0966605
        many |   .0215855   .0908627     0.24   0.813    -.1610099    .2041808
   _Iyear_75 |          0  (omitted)
   _Iyear_76 |          0  (omitted)
   _Iyear_80 |    .032492   .0325631     1.00   0.323     -.032946    .0979299
   _Iyear_81 |     .07036   .0551733     1.28   0.208    -.0405148    .1812349
   _Iyear_82 |   .0877999   .0596595     1.47   0.148    -.0320904    .2076902
   _Iyear_83 |   .1495339   .0533018     2.81   0.007     .0424199     .256648
   _Iyear_84 |   .5734264   .0525873    10.90   0.000     .4677482    .6791046
   _Iyear_85 |   .8379864   .0580512    14.44   0.000     .7213281    .9546448
   _Iyear_86 |   .9897884   .0572248    17.30   0.000     .8747909    1.104786
   _Iyear_87 |   1.160684   .0611458    18.98   0.000     1.037807    1.283561
   _Iyear_88 |   1.530971   .0454979    33.65   0.000      1.43954    1.622402
   _Iyear_89 |   1.682056   .0412136    40.81   0.000     1.599234    1.764878
   _Iyear_90 |    1.77609   .0487022    36.47   0.000      1.67822    1.873961
   _Iyear_91 |    1.85703   .0450289    41.24   0.000     1.766541    1.947519
   _Iyear_92 |   2.053285   .0396244    51.82   0.000     1.973656    2.132913
   _Iyear_93 |   2.377504   .0376514    63.15   0.000     2.301841    2.453167
   _Iyear_94 |   2.581364   .0345453    74.72   0.000     2.511943    2.650786
   _Iyear_95 |   2.737956   .0356861    76.72   0.000     2.666242     2.80967
   _Iyear_96 |          0  (omitted)
   _Iyear_97 |          0  (omitted)
  _Istate_12 |   .9488735   .1506541     6.30   0.000     .6461228    1.251624
  _Istate_13 |   -1.62136   .0827801   -19.59   0.000    -1.787712   -1.455007
  _Istate_14 |   4.020434   .1436127    27.99   0.000     3.731834    4.309035
  _Istate_15 |   1.474068   .0848094    17.38   0.000     1.303637    1.644499
  _Istate_16 |   3.396997   .1215501    27.95   0.000     3.152733    3.641261
  _Istate_21 |   4.994101   .0542531    92.05   0.000     4.885075    5.103126
  _Istate_22 |   3.912546   .0894075    43.76   0.000     3.732875    4.092217
  _Istate_23 |   3.942621   .0915639    43.06   0.000     3.758617    4.126626
  _Istate_31 |   3.605053   .0650081    55.46   0.000     3.474414    3.735691
  _Istate_32 |   2.584809   .1014986    25.47   0.000      2.38084    2.788778
  _Istate_33 |   3.794843    .082366    46.07   0.000     3.629322    3.960363
  _Istate_34 |   3.415822   .0797328    42.84   0.000     3.255594    3.576051
  _Istate_35 |   3.066594   .0894075    34.30   0.000     2.886923    3.246265
  _Istate_41 |   3.297894   .0600228    54.94   0.000     3.177274    3.418514
  _Istate_42 |    1.68939   .0923775    18.29   0.000      1.50375    1.875029
  _Istate_43 |   2.900604   .0605698    47.89   0.000     2.778884    3.022324
  _Istate_44 |  -1.519037   .0691426   -21.97   0.000    -1.657984   -1.380089
  _Istate_45 |  -.8512425   .0554198   -15.36   0.000    -.9626127   -.7398723
  _Istate_46 |   1.271011    .057121    22.25   0.000     1.156222      1.3858
  _Istate_47 |   1.049247   .0827502    12.68   0.000     .8829543     1.21554
  _Istate_51 |   1.540506   .1126811    13.67   0.000     1.314065    1.766947
  _Istate_52 |   3.016589   .0864686    34.89   0.000     2.842824    3.190354
  _Istate_54 |   2.917344    .064527    45.21   0.000     2.787673    3.047016
  _Istate_55 |   .8554049    .098232     8.71   0.000     .6580004     1.05281
  _Istate_56 |   2.399215   .0858928    27.93   0.000     2.226607    2.571823
  _Istate_57 |   1.587973   .0923775    17.19   0.000     1.402333    1.773612
  _Istate_58 |   3.015952   .0848094    35.56   0.000     2.845522    3.186383
  _Istate_59 |   3.672157   .0848094    43.30   0.000     3.501726    3.842587
  _Istate_61 |   1.800193   .0796148    22.61   0.000     1.640201    1.960185
  _Istate_62 |   2.188504   .0404657    54.08   0.000     2.107186    2.269823
  _Istate_63 |   1.369477   .1086591    12.60   0.000     1.151118    1.587836
  _Istate_64 |  -.5692547   .0891877    -6.38   0.000    -.7484841   -.3900253
  _Istate_71 |   .6280379    .085402     7.35   0.000     .4564161    .7996597
  _Istate_72 |   3.126794   .0848094    36.87   0.000     2.956363    3.297225
  _Istate_73 |   2.292813   .0360521    63.60   0.000     2.220364    2.365262
  _Istate_74 |   4.140426   .0861585    48.06   0.000     3.967284    4.313568
  _Istate_81 |  -1.846897   .1070509   -17.25   0.000    -2.062024    -1.63177
  _Istate_82 |  -.5583606   .0871974    -6.40   0.000    -.7335903   -.3831309
  _Istate_83 |  -1.206306   .0776475   -15.54   0.000    -1.362344   -1.050267
  _Istate_84 |   2.852671    .064527    44.21   0.000     2.722999    2.982343
  _Istate_85 |   .4735026   .0323901    14.62   0.000     .4084122    .5385929
  _Istate_86 |    2.51872   .0645706    39.01   0.000     2.388961     2.64848
  _Istate_87 |   .6730291   .0844976     7.97   0.000     .5032249    .8428333
  _Istate_88 |   .5617667   .0736717     7.63   0.000     .4137179    .7098155
  _Istate_91 |   2.262111   .0036338   622.52   0.000     2.254809    2.269414
  _Istate_92 |   1.740658    .082366    21.13   0.000     1.575137    1.906178
  _Istate_93 |   5.353977    .109397    48.94   0.000     5.134135    5.573818
  _Istate_94 |  -1.038026    .063211   -16.42   0.000    -1.165054   -.9109991
  _Istate_95 |   1.151184   .0885024    13.01   0.000     .9733318    1.329036
  _IstaXt_12 |  -.0356848   .0058955    -6.05   0.000    -.0475322   -.0238374
  _IstaXt_13 |    .036895   .0059011     6.25   0.000     .0250363    .0487536
  _IstaXt_14 |  -.1187822   .0065054   -18.26   0.000    -.1318553    -.105709
  _IstaXt_15 |  -.0631772   1.32e-09 -4.8e+07   0.000    -.0631772   -.0631772
  _IstaXt_16 |  -.1328678   .0051319   -25.89   0.000    -.1431808   -.1225547
  _IstaXt_21 |  -.1367444   .0043652   -31.33   0.000    -.1455166   -.1279722
  _IstaXt_22 |  -.1220351   .0051204   -23.83   0.000    -.1323249   -.1117452
  _IstaXt_23 |  -.0974829   1.59e-09 -6.1e+07   0.000     -.097483   -.0974829
  _IstaXt_31 |  -.0577101   .0047762   -12.08   0.000    -.0673082    -.048112
  _IstaXt_32 |  -.0442673   .0058955    -7.51   0.000    -.0561147   -.0324199
  _IstaXt_33 |   -.059877   1.59e-09 -3.8e+07   0.000     -.059877    -.059877
  _IstaXt_34 |   -.052264   .0013101   -39.89   0.000    -.0548968   -.0496313
  _IstaXt_35 |  -.0856201   .0051204   -16.72   0.000      -.09591   -.0753303
  _IstaXt_41 |  -.0979278    .005492   -17.83   0.000    -.1089645   -.0868912
  _IstaXt_42 |  -.0738932   .0060663   -12.18   0.000    -.0860837   -.0617026
  _IstaXt_43 |  -.0762183   .0046695   -16.32   0.000     -.085602   -.0668347
  _IstaXt_44 |  -.0407827   .0057953    -7.04   0.000    -.0524288   -.0291365
  _IstaXt_45 |  -.0390444   .0056264    -6.94   0.000    -.0503511   -.0277377
  _IstaXt_46 |  -.0443274   .0056264    -7.88   0.000    -.0556341   -.0330207
  _IstaXt_47 |   -.010239   .0046137    -2.22   0.031    -.0195105   -.0009674
  _IstaXt_51 |  -.0877333   .0085373   -10.28   0.000    -.1048896   -.0705769
  _IstaXt_52 |  -.0928439   .0050631   -18.34   0.000    -.1030185   -.0826692
  _IstaXt_54 |  -.0672416   .0052362   -12.84   0.000    -.0777641    -.056719
  _IstaXt_55 |  -.0881499   .0057317   -15.38   0.000    -.0996682   -.0766316
  _IstaXt_56 |   .0011335   .0045879     0.25   0.806    -.0080863    .0103533
  _IstaXt_57 |    .008276   .0060663     1.36   0.179    -.0039146    .0204666
  _IstaXt_58 |  -.0352676   1.31e-09 -2.7e+07   0.000    -.0352676   -.0352676
  _IstaXt_59 |  -.0062965   1.74e-09 -3.6e+06   0.000    -.0062966   -.0062965
  _IstaXt_61 |  -.0344568   .0045145    -7.63   0.000    -.0435289   -.0253846
  _IstaXt_62 |  -.0079576     .00471    -1.69   0.097    -.0174228    .0015076
  _IstaXt_63 |   .0037044   .0106095     0.35   0.728    -.0176163     .025025
  _IstaXt_64 |   .0861688    .005005    17.22   0.000     .0761108    .0962267
  _IstaXt_71 |   .0444237   .0046405     9.57   0.000     .0350984    .0537491
  _IstaXt_72 |  -.1034155   1.65e-09 -6.3e+07   0.000    -.1034155   -.1034155
  _IstaXt_73 |  -.0716531   .0070686   -10.14   0.000    -.0858579   -.0574482
  _IstaXt_74 |  -.0530566   .0055464    -9.57   0.000    -.0642025   -.0419107
  _IstaXt_81 |   .0410081   .0066313     6.18   0.000     .0276821    .0543342
  _IstaXt_82 |   .0053419    .007695     0.69   0.491    -.0101218    .0208057
  _IstaXt_83 |  -.0477367   .0067341    -7.09   0.000    -.0612694   -.0342041
  _IstaXt_84 |  -.0883919   .0052362   -16.88   0.000    -.0989144   -.0778693
  _IstaXt_85 |  -.0169025   .0043729    -3.87   0.000    -.0256901   -.0081149
  _IstaXt_86 |  -.0403439   .0089511    -4.51   0.000    -.0583318   -.0223559
  _IstaXt_87 |   .0287541   .0060772     4.73   0.000     .0165416    .0409667
  _IstaXt_88 |   -.014458   .0092856    -1.56   0.126    -.0331182    .0042022
  _IstaXt_91 |  -.0530624   .0060563    -8.76   0.000    -.0652331   -.0408918
  _IstaXt_92 |  -.0276636   1.80e-09 -1.5e+07   0.000    -.0276636   -.0276636
  _IstaXt_93 |  -.0990547   .0017589   -56.32   0.000    -.1025893   -.0955201
  _IstaXt_94 |  -.0335571   .0079426    -4.22   0.000    -.0495183   -.0175959
  _IstaXt_95 |  -.0943017   .0054422   -17.33   0.000    -.1052383   -.0833652
       _cons |   6.108735   .0835851    73.08   0.000     5.940764    6.276706
------------------------------------------------------------------------------

. reg lnths mico mppa mcount _Iyear* _Istate* _IstaXt_* [aw=empwt], cluster(state);
(sum of wgt is 850)
note: _Iyear_75 omitted because of collinearity.
note: _Iyear_76 omitted because of collinearity.
note: _Iyear_96 omitted because of collinearity.
note: _Iyear_97 omitted because of collinearity.

Linear regression                               Number of obs     =        850
                                                F(18, 49)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.9878
                                                Root MSE          =     .20363

                                 (Std. err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        mico |   .2161913   .1159112     1.87   0.068    -.0167409    .4491235
        mppa |   .0562377   .1093154     0.51   0.609    -.1634399    .2759153
      mcount |  -.0787631   .0927979    -0.85   0.400    -.2652476    .1077213
   _Iyear_75 |          0  (omitted)
   _Iyear_76 |          0  (omitted)
   _Iyear_80 |   .0335385   .0312465     1.07   0.288    -.0292538    .0963307
   _Iyear_81 |   .0722644    .054269     1.33   0.189    -.0367932    .1813221
   _Iyear_82 |   .0904163    .057519     1.57   0.122    -.0251725     .206005
   _Iyear_83 |   .1539363    .050889     3.02   0.004     .0516711    .2562015
   _Iyear_84 |   .5774657   .0502711    11.49   0.000     .4764421    .6784892
   _Iyear_85 |   .8411854     .05796    14.51   0.000     .7247105    .9576603
   _Iyear_86 |   .9923652   .0581129    17.08   0.000      .875583    1.109148
   _Iyear_87 |   1.162606   .0612425    18.98   0.000     1.039535    1.285677
   _Iyear_88 |   1.532503   .0449303    34.11   0.000     1.442213    1.622794
   _Iyear_89 |   1.683325   .0409703    41.09   0.000     1.600992    1.765658
   _Iyear_90 |    1.77749   .0480664    36.98   0.000     1.680897    1.874083
   _Iyear_91 |    1.85856    .043357    42.87   0.000     1.771431    1.945689
   _Iyear_92 |    2.05528   .0373913    54.97   0.000     1.980139     2.13042
   _Iyear_93 |   2.379629   .0350995    67.80   0.000     2.309094    2.450164
   _Iyear_94 |   2.583523   .0345223    74.84   0.000     2.514148    2.652898
   _Iyear_95 |   2.740245    .034752    78.85   0.000     2.670408    2.810082
   _Iyear_96 |          0  (omitted)
   _Iyear_97 |          0  (omitted)
  _Istate_12 |   .9500805   .1510251     6.29   0.000     .6465842    1.253577
  _Istate_13 |   -1.63111   .0645135   -25.28   0.000    -1.760755   -1.501466
  _Istate_14 |   4.023674   .1440251    27.94   0.000     3.734245    4.313103
  _Istate_15 |   1.463578   .0617569    23.70   0.000     1.339473    1.587683
  _Istate_16 |   3.393604   .1185249    28.63   0.000     3.155419    3.631789
  _Istate_21 |    4.98739   .0395062   126.24   0.000     4.907999    5.066781
  _Istate_22 |   3.912854   .0902373    43.36   0.000     3.731515    4.094192
  _Istate_23 |   3.945078   .0962728    40.98   0.000     3.751611    4.138546
  _Istate_31 |   3.596754   .0437882    82.14   0.000     3.508758     3.68475
  _Istate_32 |   2.590203   .1099965    23.55   0.000     2.369157    2.811249
  _Istate_33 |   3.786204   .0582912    64.95   0.000     3.669064    3.903345
  _Istate_34 |   3.409795    .063976    53.30   0.000      3.28123     3.53836
  _Istate_35 |   3.066902   .0902373    33.99   0.000     2.885563     3.24824
  _Istate_41 |   3.290997   .0480008    68.56   0.000     3.194536    3.387458
  _Istate_42 |   1.680789   .0768903    21.86   0.000     1.526272    1.835306
  _Istate_43 |    2.88882   .0267375   108.04   0.000     2.835089    2.942551
  _Istate_44 |  -1.526778   .0565907   -26.98   0.000    -1.640501   -1.413054
  _Istate_45 |  -.8569325   .0480886   -17.82   0.000    -.9535702   -.7602948
  _Istate_46 |   1.264813   .0478831    26.41   0.000     1.168589    1.361038
  _Istate_47 |   1.045407   .0748487    13.97   0.000     .8949933    1.195821
  _Istate_51 |   1.524352   .0667642    22.83   0.000     1.390184    1.658519
  _Istate_52 |   3.014136   .0819458    36.78   0.000      2.84946    3.178812
  _Istate_54 |   2.909558   .0488132    59.61   0.000     2.811465    3.007652
  _Istate_55 |   .8599015    .105724     8.13   0.000     .6474412    1.072362
  _Istate_56 |   2.387677   .0605788    39.41   0.000      2.26594    2.509415
  _Istate_57 |   1.579372   .0768903    20.54   0.000     1.424856    1.733889
  _Istate_58 |   3.005462   .0617569    48.67   0.000     2.881357    3.129567
  _Istate_59 |   3.661666   .0617569    59.29   0.000     3.537561    3.785771
  _Istate_61 |   1.790057   .0541964    33.03   0.000     1.681145    1.898969
  _Istate_62 |   2.183418    .028541    76.50   0.000     2.126063    2.240773
  _Istate_63 |   1.357491   .0797844    17.01   0.000     1.197158    1.517824
  _Istate_64 |  -.5831722   .0592248    -9.85   0.000    -.7021889   -.4641554
  _Istate_71 |    .626959   .0835174     7.51   0.000     .4591244    .7947936
  _Istate_72 |   3.116304   .0617569    50.46   0.000     2.992199    3.240409
  _Istate_73 |   2.294751   .0307068    74.73   0.000     2.233043    2.356459
  _Istate_74 |   4.131405   .0675315    61.18   0.000     3.995695    4.267114
  _Istate_81 |  -1.846293   .1080316   -17.09   0.000    -2.063391   -1.629195
  _Istate_82 |  -.5652552   .0670396    -8.43   0.000    -.6999763    -.430534
  _Istate_83 |    -1.2135   .0652632   -18.59   0.000    -1.344652   -1.082349
  _Istate_84 |   2.844885   .0488132    58.28   0.000     2.746791    2.942979
  _Istate_85 |   .4693829   .0206846    22.69   0.000     .4278156    .5109501
  _Istate_86 |   2.511326   .0487173    51.55   0.000     2.413425    2.609227
  _Istate_87 |   .6637228    .070063     9.47   0.000      .522926    .8045196
  _Istate_88 |    .554182   .0544197    10.18   0.000     .4448215    .6635424
  _Istate_91 |    2.26173   .0025717   879.48   0.000     2.256562    2.266898
  _Istate_92 |   1.732019   .0582912    29.71   0.000     1.614879     1.84916
  _Istate_93 |   5.341638    .092082    58.01   0.000     5.156592    5.526683
  _Istate_94 |  -1.045848   .0526583   -19.86   0.000    -1.151669   -.9400276
  _Istate_95 |   1.147398   .0816288    14.06   0.000     .9833588    1.311437
  _IstaXt_12 |  -.0366638   .0054491    -6.73   0.000    -.0476142   -.0257133
  _IstaXt_13 |   .0370024   .0059737     6.19   0.000     .0249978     .049007
  _IstaXt_14 |  -.1199306   .0052384   -22.89   0.000    -.1304576   -.1094035
  _IstaXt_15 |  -.0631772   1.08e-09 -5.8e+07   0.000    -.0631772   -.0631772
  _IstaXt_16 |  -.1336062   .0049726   -26.87   0.000     -.143599   -.1236134
  _IstaXt_21 |  -.1362045   .0031787   -42.85   0.000    -.1425922   -.1298167
  _IstaXt_22 |  -.1226786   .0047953   -25.58   0.000    -.1323152   -.1130421
  _IstaXt_23 |  -.0974829   1.03e-09 -9.4e+07   0.000     -.097483   -.0974829
  _IstaXt_31 |  -.0571067   .0033266   -17.17   0.000    -.0637916   -.0504217
  _IstaXt_32 |  -.0452463   .0054491    -8.30   0.000    -.0561967   -.0342958
  _IstaXt_33 |   -.059877   1.55e-09 -3.9e+07   0.000     -.059877    -.059877
  _IstaXt_34 |  -.0524816   .0012109   -43.34   0.000     -.054915   -.0500482
  _IstaXt_35 |  -.0862637   .0047953   -17.99   0.000    -.0959002   -.0766271
  _IstaXt_41 |  -.0980004   .0054083   -18.12   0.000    -.1088687    -.087132
  _IstaXt_42 |  -.0738249   .0061028   -12.10   0.000    -.0860889    -.061561
  _IstaXt_43 |  -.0752967   .0052682   -14.29   0.000    -.0858836   -.0647099
  _IstaXt_44 |  -.0407735   .0058078    -7.02   0.000    -.0524447   -.0291023
  _IstaXt_45 |  -.0391381   .0055116    -7.10   0.000    -.0502141   -.0280621
  _IstaXt_46 |  -.0444211   .0055116    -8.06   0.000     -.055497   -.0333451
  _IstaXt_47 |  -.0105788   .0044332    -2.39   0.021    -.0194876     -.00167
  _IstaXt_51 |  -.0866661   .0059136   -14.66   0.000      -.09855   -.0747823
  _IstaXt_52 |  -.0932653   .0048402   -19.27   0.000     -.102992   -.0835386
  _IstaXt_54 |  -.0672718   .0052073   -12.92   0.000    -.0777362   -.0568073
  _IstaXt_55 |  -.0891017   .0052978   -16.82   0.000    -.0997479   -.0784554
  _IstaXt_56 |   .0021807   .0047147     0.46   0.646    -.0072939    .0116553
  _IstaXt_57 |   .0083442   .0061028     1.37   0.178    -.0039198    .0206082
  _IstaXt_58 |  -.0352676   1.63e-09 -2.2e+07   0.000    -.0352676   -.0352676
  _IstaXt_59 |  -.0062965   4.56e-10 -1.4e+07   0.000    -.0062965   -.0062965
  _IstaXt_61 |  -.0343387   .0045754    -7.51   0.000    -.0435334   -.0251441
  _IstaXt_62 |  -.0082071   .0042386    -1.94   0.059    -.0167249    .0003108
  _IstaXt_63 |    .004203   .0094273     0.45   0.658    -.0147419    .0231478
  _IstaXt_64 |   .0873112   .0051433    16.98   0.000     .0769753    .0976471
  _IstaXt_71 |   .0438618   .0043545    10.07   0.000     .0351112    .0526124
  _IstaXt_72 |  -.1034155   6.25e-10 -1.7e+08   0.000    -.1034155   -.1034155
  _IstaXt_73 |  -.0723585   .0050431   -14.35   0.000     -.082493    -.062224
  _IstaXt_74 |   -.053002   .0055758    -9.51   0.000     -.064207    -.041797
  _IstaXt_81 |   .0400339   .0067622     5.92   0.000     .0264447    .0536231
  _IstaXt_82 |   .0049268   .0079606     0.62   0.539    -.0110707    .0209242
  _IstaXt_83 |  -.0478072   .0066715    -7.17   0.000    -.0612141   -.0344004
  _IstaXt_84 |   -.088422   .0052073   -16.98   0.000    -.0988865   -.0779576
  _IstaXt_85 |  -.0172473    .003563    -4.84   0.000    -.0244074   -.0100872
  _IstaXt_86 |  -.0407655   .0088676    -4.60   0.000    -.0585856   -.0229453
  _IstaXt_87 |    .028913   .0061592     4.69   0.000     .0165356    .0412904
  _IstaXt_88 |  -.0148517   .0092721    -1.60   0.116    -.0334848    .0037813
  _IstaXt_91 |  -.0536976   .0042861   -12.53   0.000    -.0623109   -.0450843
  _IstaXt_92 |  -.0276636   1.33e-09 -2.1e+07   0.000    -.0276636   -.0276636
  _IstaXt_93 |  -.0991496   .0018196   -54.49   0.000    -.1028062    -.095493
  _IstaXt_94 |  -.0339381   .0077745    -4.37   0.000    -.0495616   -.0183145
  _IstaXt_95 |  -.0945871   .0052903   -17.88   0.000    -.1052184   -.0839559
       _cons |   6.117107   .0678351    90.18   0.000     5.980788    6.253427
------------------------------------------------------------------------------

. reg lnths mico mppa mgfa mtwo mthree _Iyear* _Istate* _IstaXt_* [aw=empwt], cluster(state);
(sum of wgt is 850)
note: _Iyear_75 omitted because of collinearity.
note: _Iyear_76 omitted because of collinearity.
note: _Iyear_96 omitted because of collinearity.
note: _Iyear_97 omitted because of collinearity.

Linear regression                               Number of obs     =        850
                                                F(20, 49)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.9878
                                                Root MSE          =     .20341

                                 (Std. err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        mico |   .1511514   .0851902     1.77   0.082    -.0200448    .3223475
        mppa |   .0069088   .0567103     0.12   0.904    -.1070549    .1208724
        mgfa |  -.0876635    .144878    -0.61   0.548    -.3788068    .2034798
        mtwo |   -.055082   .0921164    -0.60   0.553    -.2401968    .1300329
      mthree |    .028938   .2122986     0.14   0.892    -.3976919    .4555679
   _Iyear_75 |          0  (omitted)
   _Iyear_76 |          0  (omitted)
   _Iyear_80 |   .0317869    .032603     0.97   0.334    -.0337313     .097305
   _Iyear_81 |   .0694099   .0551414     1.26   0.214    -.0414008    .1802207
   _Iyear_82 |   .0880527   .0594373     1.48   0.145    -.0313911    .2074965
   _Iyear_83 |   .1514826   .0526284     2.88   0.006     .0457218    .2572434
   _Iyear_84 |   .5776909   .0521657    11.07   0.000     .4728601    .6825218
   _Iyear_85 |   .8431405   .0559874    15.06   0.000     .7306296    .9556513
   _Iyear_86 |    .994806   .0552564    18.00   0.000     .8837641    1.105848
   _Iyear_87 |   1.165349   .0609993    19.10   0.000     1.042767    1.287932
   _Iyear_88 |   1.530919    .044982    34.03   0.000     1.440524    1.621314
   _Iyear_89 |   1.681299   .0406425    41.37   0.000     1.599625    1.762973
   _Iyear_90 |   1.775813   .0483698    36.71   0.000      1.67861    1.873016
   _Iyear_91 |   1.857232   .0449093    41.36   0.000     1.766983     1.94748
   _Iyear_92 |   2.054478   .0395597    51.93   0.000      1.97498    2.133977
   _Iyear_93 |   2.379177   .0373739    63.66   0.000     2.304071    2.454283
   _Iyear_94 |   2.581917    .034757    74.28   0.000     2.512071    2.651764
   _Iyear_95 |   2.738988    .035762    76.59   0.000     2.667122    2.810854
   _Iyear_96 |          0  (omitted)
   _Iyear_97 |          0  (omitted)
  _Istate_12 |   1.029975   .2150075     4.79   0.000     .5979008    1.462048
  _Istate_13 |  -1.620992   .0818714   -19.80   0.000    -1.785519   -1.456465
  _Istate_14 |   4.097533    .206129    19.88   0.000     3.683302    4.511765
  _Istate_15 |   1.477301   .0851902    17.34   0.000     1.306105    1.648497
  _Istate_16 |   3.441652   .1524889    22.57   0.000     3.135214     3.74809
  _Istate_21 |   4.996169   .0544967    91.68   0.000     4.886654    5.105684
  _Istate_22 |   3.900723   .0876436    44.51   0.000     3.724597     4.07685
  _Istate_23 |   3.929367   .0902211    43.55   0.000     3.748061    4.110673
  _Istate_31 |   3.610247   .0663455    54.42   0.000     3.476921    3.743574
  _Istate_32 |   2.563544   .0975418    26.28   0.000     2.367527    2.759562
  _Istate_33 |   3.811852   .0841381    45.30   0.000      3.64277    3.980934
  _Istate_34 |   3.425711    .082103    41.72   0.000     3.260719    3.590703
  _Istate_35 |   3.054771   .0876436    34.85   0.000     2.878645    3.230898
  _Istate_41 |   3.297382   .0589834    55.90   0.000     3.178851    3.415914
  _Istate_42 |   1.685945   .0904814    18.63   0.000     1.504116    1.867774
  _Istate_43 |   2.912747   .0624191    46.66   0.000     2.787311    3.038183
  _Istate_44 |  -1.520449    .067535   -22.51   0.000    -1.656166   -1.384732
  _Istate_45 |  -.8541307   .0532429   -16.04   0.000    -.9611263   -.7471351
  _Istate_46 |   1.269124   .0554291    22.90   0.000     1.157735    1.380513
  _Istate_47 |   1.044723   .0825182    12.66   0.000     .8788967     1.21055
  _Istate_51 |   1.535064   .1125083    13.64   0.000     1.308971    1.761158
  _Istate_52 |   3.008282   .0850702    35.36   0.000     2.837327    3.179237
  _Istate_54 |   2.918584   .0642695    45.41   0.000     2.789429    3.047738
  _Istate_55 |   .8365878   .0951095     8.80   0.000      .645458    1.027718
  _Istate_56 |   2.403781   .0864127    27.82   0.000     2.230128    2.577434
  _Istate_57 |   1.584528   .0904814    17.51   0.000     1.402699    1.766358
  _Istate_58 |   3.019185   .0851902    35.44   0.000     2.847989    3.190381
  _Istate_59 |   3.675389   .0851902    43.14   0.000     3.504193    3.846586
  _Istate_61 |    1.80606   .0810845    22.27   0.000     1.643114    1.969005
  _Istate_62 |   2.190705   .0409206    53.54   0.000     2.108472    2.272938
  _Istate_63 |    1.35791   .1084244    12.52   0.000     1.140023    1.575797
  _Istate_64 |  -.5616576   .0900024    -6.24   0.000    -.7425242    -.380791
  _Istate_71 |   .6199983   .0848099     7.31   0.000     .4495665    .7904302
  _Istate_72 |   3.130027   .0851902    36.74   0.000     2.958831    3.301223
  _Istate_73 |   2.301035   .0405367    56.76   0.000     2.219574    2.382497
  _Istate_74 |   4.140484   .0857622    48.28   0.000     3.968139     4.31283
  _Istate_81 |  -1.806153   .1340314   -13.48   0.000    -2.075499   -1.536806
  _Istate_82 |  -.5125422     .08969    -5.71   0.000     -.692781   -.3323035
  _Istate_83 |   -1.19189   .0791965   -15.05   0.000    -1.351041   -1.032738
  _Istate_84 |    2.85391   .0642695    44.41   0.000     2.724756    2.983065
  _Istate_85 |   .4775151   .0334176    14.29   0.000     .4103598    .5446704
  _Istate_86 |   2.526427   .0657354    38.43   0.000     2.394326    2.658527
  _Istate_87 |   .6707279   .0822431     8.16   0.000     .5054541    .8360017
  _Istate_88 |   .5862977   .0780794     7.51   0.000     .4293913    .7432041
  _Istate_91 |   2.262862    .003712   609.61   0.000     2.255402    2.270321
  _Istate_92 |   1.757667   .0841381    20.89   0.000     1.588585    1.926749
  _Istate_93 |   5.309841   .1055227    50.32   0.000     5.097785    5.521897
  _Istate_94 |  -1.001661   .0876371   -11.43   0.000    -1.177775    -.825548
  _Istate_95 |   1.142914   .0864345    13.22   0.000      .969217     1.31661
  _IstaXt_12 |  -.0452882   .0150137    -3.02   0.004    -.0754593   -.0151171
  _IstaXt_13 |   .0380926   .0054041     7.05   0.000     .0272328    .0489525
  _IstaXt_14 |  -.1280521   .0149509    -8.56   0.000    -.1580971    -.098007
  _IstaXt_15 |  -.0631772   9.88e-10 -6.4e+07   0.000    -.0631772   -.0631772
  _IstaXt_16 |  -.1408345   .0118376   -11.90   0.000     -.164623    -.117046
  _IstaXt_21 |  -.1369108   .0043848   -31.22   0.000    -.1457224   -.1280992
  _IstaXt_22 |  -.1199106   .0043567   -27.52   0.000    -.1286658   -.1111554
  _IstaXt_23 |  -.0974829   2.01e-10 -4.9e+08   0.000    -.0974829   -.0974829
  _IstaXt_31 |  -.0580016   .0048423   -11.98   0.000    -.0677325   -.0482707
  _IstaXt_32 |   -.041597   .0050435    -8.25   0.000    -.0517323   -.0314616
  _IstaXt_33 |   -.059877   1.08e-09 -5.5e+07   0.000     -.059877    -.059877
  _IstaXt_34 |  -.0516706   .0011208   -46.10   0.000    -.0539229   -.0494183
  _IstaXt_35 |  -.0834956   .0043567   -19.16   0.000    -.0922508   -.0747404
  _IstaXt_41 |  -.0966747   .0051113   -18.91   0.000    -.1069462   -.0864033
  _IstaXt_42 |  -.0725563   .0054903   -13.22   0.000    -.0835894   -.0615233
  _IstaXt_43 |  -.0776447   .0045929   -16.91   0.000    -.0868745   -.0684149
  _IstaXt_44 |  -.0395195   .0053435    -7.40   0.000    -.0502576   -.0287814
  _IstaXt_45 |  -.0377496   .0052498    -7.19   0.000    -.0482994   -.0271997
  _IstaXt_46 |  -.0430326   .0052498    -8.20   0.000    -.0535824   -.0324827
  _IstaXt_47 |  -.0086199    .003978    -2.17   0.035     -.016614   -.0006257
  _IstaXt_51 |   -.086099   .0092324    -9.33   0.000    -.1046522   -.0675457
  _IstaXt_52 |  -.0910022   .0043492   -20.92   0.000    -.0997423   -.0822621
  _IstaXt_54 |  -.0660718   .0048486   -13.63   0.000    -.0758156   -.0563281
  _IstaXt_55 |  -.0855537   .0049034   -17.45   0.000    -.0954076   -.0756999
  _IstaXt_56 |     -.0002   .0045869    -0.04   0.965    -.0094177    .0090176
  _IstaXt_57 |   .0096128   .0054903     1.75   0.086    -.0014203    .0206459
  _IstaXt_58 |  -.0352676   8.68e-10 -4.1e+07   0.000    -.0352676   -.0352676
  _IstaXt_59 |  -.0062965   7.13e-10 -8.8e+06   0.000    -.0062965   -.0062965
  _IstaXt_61 |  -.0335788   .0041273    -8.14   0.000    -.0418729   -.0252848
  _IstaXt_62 |  -.0068257   .0045461    -1.50   0.140    -.0159615      .00231
  _IstaXt_63 |   .0086376   .0133803     0.65   0.522     -.018251    .0355263
  _IstaXt_64 |    .084714   .0050039    16.93   0.000     .0746584    .0947697
  _IstaXt_71 |   .0463257   .0039499    11.73   0.000     .0383882    .0542633
  _IstaXt_72 |  -.1034155          .        .       .            .           .
  _IstaXt_73 |  -.0706288   .0070816    -9.97   0.000    -.0848598   -.0563978
  _IstaXt_74 |  -.0518211   .0050151   -10.33   0.000    -.0618993    -.041743
  _IstaXt_81 |   .0341256   .0103777     3.29   0.002     .0132708    .0549804
  _IstaXt_82 |  -.0015173    .007226    -0.21   0.835    -.0160384    .0130038
  _IstaXt_83 |  -.0494787    .006708    -7.38   0.000     -.062959   -.0359985
  _IstaXt_84 |  -.0872221   .0048486   -17.99   0.000    -.0969658   -.0774784
  _IstaXt_85 |   -.015882   .0043435    -3.66   0.001    -.0246106   -.0071534
  _IstaXt_86 |  -.0456414   .0089749    -5.09   0.000    -.0636771   -.0276057
  _IstaXt_87 |   .0299359   .0055559     5.39   0.000     .0187709     .041101
  _IstaXt_88 |  -.0204686   .0093344    -2.19   0.033    -.0392268   -.0017104
  _IstaXt_91 |  -.0518117   .0061866    -8.37   0.000    -.0642442   -.0393792
  _IstaXt_92 |  -.0276636   6.52e-10 -4.2e+07   0.000    -.0276636   -.0276636
  _IstaXt_93 |  -.1006225   .0016517   -60.92   0.000    -.1039416   -.0973034
  _IstaXt_94 |  -.0404679   .0099567    -4.06   0.000    -.0604767    -.020459
  _IstaXt_95 |  -.0925542    .004739   -19.53   0.000    -.1020776   -.0830308
       _cons |   6.104136   .0847241    72.05   0.000     5.933877    6.274396
------------------------------------------------------------------------------

. 
end of do-file

