---------------------------------------------------------------------------------
       log:  C:\Documents and Settings\jwang\Desktop\JOLEcluster-runs_table6.log
  log type:  text
 opened on:  30 May 2008, 13:13:11

. set matsize 450;

Current memory allocation

                    current                                 memory usage
    settable          value     description                 (1M = 1024k)
    --------------------------------------------------------------------
    set maxvar         5000     max. variables allowed           1.909M
    set memory           10M    max. data space                 10.000M
    set matsize         450     max. RHS vars in models          1.583M
                                                            -----------
                                                                13.492M

. use autor-jole-2003.dta;
(EOW SVCs, CPS, rulings research data set)

. * Log total employment - from BLS employment & earnings;
. gen lnemp=ln(annemp);

. * Non-business-service sector employment from CBP;
. gen nonemp= stateemp-svcemp;
(200 missing values generated)

. gen lnnon=ln(nonemp);
(200 missing values generated)

. gen svcfrac= svcemp/nonemp;
(200 missing values generated)

. * Total business services employment from CBP;
. gen bizemp= svcemp+peremp;
(200 missing values generated)

. gen lnbiz = ln(biz);
(200 missing values generated)

. * State dummies, year dummies, and state*time trends;
. gen t=year-78;

. gen t2=t^2;

. drop if state==98;
(0 observations deleted)

. xi i.state i.year i.state*t i.state*t2 i.region*i.year;
i.state           _Istate_11-95       (naturally coded; _Istate_11 omitted)
i.year            _Iyear_74-97        (naturally coded; _Iyear_74 omitted)
i.state*t         _IstaXt_#           (coded as above)
i.state*t2        _IstaXt2_#          (coded as above)
i.region          _Iregion_1-9        (naturally coded; _Iregion_1 omitted)
i.reg~n*i.year    _IregXyea_#_#       (coded as above)

. drop _Iyear_77 - _Iyear_79;

. * Working sample;
. gen year1 = year>=79 & year<=95;

. keep if year1;
(350 observations deleted)

. gen year2 = ((int(year/2)*2 + 1)==year);

. gen year4 = (year==79 | year==83 | year==87 | year==91 | year==95);

. * Generate more aggregate demos;
. gen clp=clg+gtc;

. gen a1624=m1619+m2024+f1619+f2024;

. gen a2554=m2554+f2554;

. gen a55up=m5564+m65up+f5564+f65up;

. gen fem=f1619+f2024+f2554+f5564+f65up;

. gen white=rs_wm+rs_wf;

. gen black=rs_bm+rs_bf;

. gen other=rs_om+rs_of;

. gen married=marfem+marmale;

. * Modify union variable so that:
>   1 - We don't use interpolated data for 1979 & 1981
>   2 - Turn from fraction into percent so that coefficient will be friendly si
> ze;
. replace unmem=. if year==79 | year==81;
(100 real changes made, 100 to missing)

. replace unmem=unmem*100;
(750 real changes made)

. *******************;
. ** Table 6
> *******************;
. /*By period*/;
.    * 1 year intervals;
. reg lnths lnemp mico mppa mgfa _Iyear* _Istate* _IstaXt_*  if year>=79 & year
> <=83, cluster(state);

Linear regression                                      Number of obs =     250
                                                       F(  6,    49) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.9928
                                                       Root MSE      =   .1894

                                 (Std. Err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       lnemp |  -.0054343   1.204746    -0.00   0.996    -2.426462    2.415593
        mico |   .1217005   .0881334     1.38   0.174    -.0554102    .2988111
        mppa |   .0873076   .0962725     0.91   0.369    -.1061593    .2807745
        mgfa |   -.033347   .0746499    -0.45   0.657    -.1833617    .1166676
   _Iyear_75 |  (dropped)
   _Iyear_76 |  (dropped)
   _Iyear_80 |  -.0890197   .0468449    -1.90   0.063    -.1831579    .0051186
   _Iyear_81 |  -.1625419   .0623976    -2.60   0.012    -.2879346   -.0371492
   _Iyear_82 |   -.255176   .0366936    -6.95   0.000    -.3289146   -.1814375
   _Iyear_83 |  -.3019781   .0404382    -7.47   0.000    -.3832417   -.2207145
   _Iyear_84 |  (dropped)
   _Iyear_85 |  (dropped)
   _Iyear_86 |  (dropped)
   _Iyear_87 |  (dropped)
   _Iyear_88 |  (dropped)
   _Iyear_89 |  (dropped)
   _Iyear_90 |  (dropped)
   _Iyear_91 |  (dropped)
   _Iyear_92 |  (dropped)
   _Iyear_93 |  (dropped)
   _Iyear_94 |  (dropped)
   _Iyear_95 |  (dropped)
   _Iyear_96 |  (dropped)
   _Iyear_97 |  (dropped)
  _Istate_12 |   .6189332    .209931     2.95   0.005     .1970611    1.040805
  _Istate_13 |  -2.779564   .9234031    -3.01   0.004    -4.635212    -.923916
  _Istate_14 |   3.449641   2.183626     1.58   0.121    -.9385196    7.837803
  _Istate_15 |   1.152007   .1029271    11.19   0.000     .9451678    1.358847
  _Istate_16 |   2.814113   1.449434     1.94   0.058    -.0986332     5.72686
  _Istate_21 |   4.553912   3.403859     1.34   0.187    -2.286399    11.39422
  _Istate_22 |   3.304698    2.36969     1.39   0.169    -1.457372    8.066768
  _Istate_23 |   3.636988   2.980901     1.22   0.228    -2.353358    9.627333
  _Istate_31 |   3.593659   2.870777     1.25   0.217    -2.175384    9.362702
  _Istate_32 |   2.459021   2.051713     1.20   0.236    -1.664051    6.582092
  _Istate_33 |   3.675645   3.026223     1.21   0.230    -2.405778    9.757068
  _Istate_34 |   3.328498   2.646824     1.26   0.215    -1.990495     8.64749
  _Istate_35 |   2.734315   1.876254     1.46   0.151    -1.036158    6.504788
  _Istate_41 |   3.593752   1.740803     2.06   0.044     .0954763    7.092027
  _Istate_42 |    1.85945   1.222685     1.52   0.135    -.5976263    4.316527
  _Istate_43 |   2.860274   1.882861     1.52   0.135    -.9234763    6.644025
  _Istate_44 |  -1.022226   .6703176    -1.52   0.134    -2.369279    .3248281
  _Istate_45 |  -1.663174   .6858793    -2.42   0.019      -3.0415   -.2848479
  _Istate_46 |   1.420889   .5064662     2.81   0.007     .4031074    2.438671
  _Istate_47 |   .7316299    .988646     0.74   0.463    -1.255129    2.718389
  _Istate_51 |    1.06184   .6134043     1.73   0.090     -.170842    2.294522
  _Istate_52 |   2.569869   1.672866     1.54   0.131     -.791881     5.93162
  _Istate_54 |   2.446136   1.933867     1.26   0.212    -1.440116    6.332388
  _Istate_55 |   .7652006   .6191994     1.24   0.222    -.4791272    2.009528
  _Istate_56 |   1.946234   2.079747     0.94   0.354    -2.233174    6.125642
  _Istate_57 |   1.350288   1.246243     1.08   0.284     -1.15413    3.854706
  _Istate_58 |   2.516428   1.932136     1.30   0.199    -1.366344      6.3992
  _Istate_59 |   3.496779   2.485847     1.41   0.166    -1.498718    8.492276
  _Istate_61 |   1.715609   1.313485     1.31   0.198    -.9239372    4.355155
  _Istate_62 |   1.775877   1.739148     1.02   0.312    -1.719072    5.270826
  _Istate_63 |   .8567543   1.427165     0.60   0.551    -2.011242     3.72475
  _Istate_64 |  -1.079614   .8546065    -1.26   0.212     -2.79701    .6377815
  _Istate_71 |   .7037178   .7048018     1.00   0.323    -.7126345     2.12007
  _Istate_72 |   2.909762   1.565323     1.86   0.069    -.2358711    6.055396
  _Istate_73 |   1.886613   1.165617     1.62   0.112    -.4557823    4.229008
  _Istate_74 |   4.034953   3.106329     1.30   0.200    -2.207449    10.27736
  _Istate_81 |  -1.775517   .4631201    -3.83   0.000    -2.706192   -.8448423
  _Istate_82 |  -.6072675   .2268021    -2.68   0.010    -1.063043   -.1514917
  _Istate_83 |  -1.161757    .858152    -1.35   0.182    -2.886278    .5627636
  _Istate_84 |   2.694669   1.256464     2.14   0.037     .1697102    5.219628
  _Istate_85 |   .2366695   .1217479     1.94   0.058    -.0079921    .4813311
  _Istate_86 |   2.056875   .9989582     2.06   0.045     .0493939    4.064357
  _Istate_87 |   .4004636   .3173432     1.26   0.213    -.2372615    1.038189
  _Istate_88 |   .5473489   .1615692     3.39   0.001     .2226634    .8720344
  _Istate_91 |   2.285764   1.628234     1.40   0.167     -.986294    5.557822
  _Istate_92 |   1.733407   1.191128     1.46   0.152    -.6602541    4.127067
  _Istate_93 |   4.883236   3.818591     1.28   0.207    -2.790509    12.55698
  _Istate_94 |  -1.882218    1.22988    -1.53   0.132    -4.353755    .5893188
  _Istate_95 |   .9263583   .1283873     7.22   0.000     .6683544    1.184362
  _IstaXt_12 |   .0863238   .0173428     4.98   0.000     .0514721    .1211755
  _IstaXt_13 |   .4528934    .007401    61.19   0.000     .4380205    .4677662
  _IstaXt_14 |   .0563853     .02031     2.78   0.008     .0155709    .0971997
  _IstaXt_15 |   .0674537   .0090278     7.47   0.000     .0493117    .0855956
  _IstaXt_16 |   .0149779   .0214512     0.70   0.488      -.02813    .0580858
  _IstaXt_21 |   .0512007    .026649     1.92   0.061    -.0023526    .1047539
  _IstaXt_22 |   .0855024   .0221965     3.85   0.000     .0408969    .1301079
  _IstaXt_23 |   .0083807   .0234318     0.36   0.722    -.0387074    .0554687
  _IstaXt_31 |   -.005143   .0373925    -0.14   0.891     -.080286    .0699999
  _IstaXt_32 |   -.026347   .0336698    -0.78   0.438     -.094009    .0413149
  _IstaXt_33 |   .0012048   .0288654     0.04   0.967    -.0568023     .059212
  _IstaXt_34 |  -.0573111   .0420962    -1.36   0.180    -.1419065    .0272843
  _IstaXt_35 |   .0243747   .0249297     0.98   0.333    -.0257234    .0744728
  _IstaXt_41 |  -.1627208   .0205525    -7.92   0.000    -.2040227    -.121419
  _IstaXt_42 |  -.0703888   .0322906    -2.18   0.034    -.1352792   -.0054984
  _IstaXt_43 |  -.0152164   .0210637    -0.72   0.473    -.0575455    .0271128
  _IstaXt_44 |  -.1746643   .0040184   -43.47   0.000    -.1827396    -.166589
  _IstaXt_45 |   .2009891   .0200711    10.01   0.000     .1606548    .2413235
  _IstaXt_46 |  -.0295597   .0207217    -1.43   0.160    -.0712015    .0120821
  _IstaXt_47 |   .1184097   .0291717     4.06   0.000      .059787    .1770323
  _IstaXt_51 |   .0624496   .0042594    14.66   0.000       .05389    .0710093
  _IstaXt_52 |   .0468936    .028459     1.65   0.106    -.0102968    .1040841
  _IstaXt_54 |    .136743   .0195308     7.00   0.000     .0974943    .1759917
  _IstaXt_55 |  -.0349923    .041399    -0.85   0.402    -.1181867    .0482021
  _IstaXt_56 |   .1631774   .0014421   113.15   0.000     .1602793    .1660755
  _IstaXt_57 |   .1109064    .004473    24.79   0.000     .1019175    .1198953
  _IstaXt_58 |   .1477178   .0145476    10.15   0.000     .1184833    .1769522
  _IstaXt_59 |   .0925871   .0364207     2.54   0.014     .0193971    .1657772
  _IstaXt_61 |   .0168974   .0316182     0.53   0.595    -.0466418    .0804366
  _IstaXt_62 |   .1451195   .0273278     5.31   0.000     .0902023    .2000367
  _IstaXt_63 |   .2099783   .0142893    14.69   0.000     .1812628    .2386937
  _IstaXt_64 |   .2916967   .0235065    12.41   0.000     .2444585    .3389348
  _IstaXt_71 |   .0584869   .0198587     2.95   0.005     .0185793    .0983945
  _IstaXt_72 |   .0348453   .0051924     6.71   0.000     .0244108    .0452798
  _IstaXt_73 |   .1315146   .0213129     6.17   0.000     .0886848    .1743444
  _IstaXt_74 |    .071229   .0279936     2.54   0.014     .0149738    .1274842
  _IstaXt_81 |   .0538426    .029477     1.83   0.074    -.0053937    .1130789
  _IstaXt_82 |   .0676371   .0258587     2.62   0.012      .015672    .1196022
  _IstaXt_83 |  -.0571666   .0019692   -29.03   0.000    -.0611238   -.0532094
  _IstaXt_84 |   .0154254   .0316118     0.49   0.628    -.0481009    .0789518
  _IstaXt_85 |   .1091104   .0291669     3.74   0.000     .0504973    .1677236
  _IstaXt_86 |   .1219919   .0299274     4.08   0.000     .0618505    .1821333
  _IstaXt_87 |   .1369895   .0057774    23.71   0.000     .1253794    .1485997
  _IstaXt_88 |   .0395008   .0208022     1.90   0.063    -.0023027    .0813043
  _IstaXt_91 |  -.0072815   .0066719    -1.09   0.280    -.0206892    .0061261
  _IstaXt_92 |   -.013403   .0357319    -0.38   0.709    -.0852089    .0584029
  _IstaXt_93 |   .0507394   .0146746     3.46   0.001     .0212497    .0802291
  _IstaXt_94 |   .2658352   .0791955     3.36   0.002      .106686    .4249845
  _IstaXt_95 |   .0122463   .0292569     0.42   0.677    -.0465478    .0710403
       _cons |   6.312701     15.597     0.40   0.687    -25.03064    37.65604
------------------------------------------------------------------------------

. reg lnths lnemp mico mppa mgfa _Iyear* _Istate* _IstaXt_*  if year>=83 & year
> <=87, cluster(state);

Linear regression                                      Number of obs =     250
                                                       F(  6,    49) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.9943
                                                       Root MSE      =  .16096

                                 (Std. Err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       lnemp |   .0837563   2.005432     0.04   0.967     -3.94631    4.113822
        mico |   .0709413   .1205255     0.59   0.559    -.1712638    .3131463
        mppa |    .002729   .1017349     0.03   0.979    -.2017149    .2071729
        mgfa |   .1396487   .1306478     1.07   0.290    -.1228979    .4021954
   _Iyear_75 |  (dropped)
   _Iyear_76 |  (dropped)
   _Iyear_80 |  (dropped)
   _Iyear_81 |  (dropped)
   _Iyear_82 |  (dropped)
   _Iyear_83 |  (dropped)
   _Iyear_84 |   .5701324   .1188116     4.80   0.000     .3313715    .8088933
   _Iyear_85 |    .976596    .196733     4.96   0.000     .5812462    1.371946
   _Iyear_86 |   1.277331    .258117     4.95   0.000     .7586255    1.796037
   _Iyear_87 |   1.590863   .3292305     4.83   0.000     .9292494    2.252476
   _Iyear_88 |  (dropped)
   _Iyear_89 |  (dropped)
   _Iyear_90 |  (dropped)
   _Iyear_91 |  (dropped)
   _Iyear_92 |  (dropped)
   _Iyear_93 |  (dropped)
   _Iyear_94 |  (dropped)
   _Iyear_95 |  (dropped)
   _Iyear_96 |  (dropped)
   _Iyear_97 |  (dropped)
  _Istate_12 |   1.227612   .2703334     4.54   0.000     .6843568    1.770867
  _Istate_13 |  -.8772159   1.586125    -0.55   0.583    -4.064654    2.310222
  _Istate_14 |   4.142352   3.857077     1.07   0.288    -3.608733    11.89344
  _Istate_15 |   2.059546   .1288671    15.98   0.000     1.800578    2.318515
  _Istate_16 |   3.666327   2.616198     1.40   0.167    -1.591121    8.923774
  _Istate_21 |   5.834566   5.876504     0.99   0.326    -5.974711    17.64384
  _Istate_22 |   4.787634   4.201114     1.14   0.260     -3.65482    13.23009
  _Istate_23 |   4.553729   4.987624     0.91   0.366    -5.469276    14.57673
  _Istate_31 |   3.918362    4.66764     0.84   0.405    -5.461611    13.29834
  _Istate_32 |   2.548984   3.288944     0.78   0.442    -4.060397    9.158365
  _Istate_33 |   4.761018   4.991075     0.95   0.345    -5.268923    14.79096
  _Istate_34 |    3.57151   4.136252     0.86   0.392      -4.7406    11.88362
  _Istate_35 |   3.705392   3.165832     1.17   0.247    -2.656585    10.06737
  _Istate_41 |   3.210844   2.870716     1.12   0.269    -2.558076    8.979764
  _Istate_42 |   2.264682   2.067736     1.10   0.279    -1.890589    6.419954
  _Istate_43 |   3.309384   3.108999     1.06   0.292    -2.938383     9.55715
  _Istate_44 |  -.9669893   .7445746    -1.30   0.200    -2.463268    .5292893
  _Istate_45 |    .000257   .9576537     0.00   1.000     -1.92422    1.924734
  _Istate_46 |   2.093937   .9122533     2.30   0.026     .2606958    3.927179
  _Istate_47 |   2.171817   1.813111     1.20   0.237    -1.471765      5.8154
  _Istate_51 |   2.177671   .9954912     2.19   0.034     .1771565    4.178186
  _Istate_52 |   3.169762   2.869867     1.10   0.275     -2.59745    8.936975
  _Istate_54 |   3.890234   3.184739     1.22   0.228    -2.509739    10.29021
  _Istate_55 |   1.302383   1.070384     1.22   0.230     -.848635    3.453401
  _Istate_56 |   2.949009   3.459325     0.85   0.398    -4.002765    9.900783
  _Istate_57 |   2.382981   2.094114     1.14   0.261    -1.825299     6.59126
  _Istate_58 |    4.05713   3.308753     1.23   0.226    -2.592058    10.70632
  _Istate_59 |   4.297242   4.346953     0.99   0.328    -4.438286    13.03277
  _Istate_61 |   2.947841   2.114139     1.39   0.170     -1.30068    7.196363
  _Istate_62 |    3.18917   2.815397     1.13   0.263    -2.468582    8.846922
  _Istate_63 |   2.891619   2.420334     1.19   0.238    -1.972225    7.755462
  _Istate_64 |   .7624457   1.436163     0.53   0.598    -2.123632    3.648524
  _Istate_71 |   1.694222   1.297255     1.31   0.198    -.9127101    4.301155
  _Istate_72 |    4.73507   3.223649     1.47   0.148    -1.743095    11.21324
  _Istate_73 |   3.818302   2.633527     1.45   0.153    -1.473969    9.110572
  _Istate_74 |   5.151985    5.70163     0.90   0.371    -6.305869    16.60984
  _Istate_81 |  -1.861744    .492013    -3.78   0.000    -2.850481   -.8730068
  _Istate_82 |   1.130543   .2301656     4.91   0.000     .6680076    1.593078
  _Istate_83 |  -1.361973   .8341374    -1.63   0.109    -3.038235    .3142892
  _Istate_84 |   3.963235   2.554791     1.55   0.127    -1.170811     9.09728
  _Istate_85 |   1.414074   .4677208     3.02   0.004     .4741541    2.353995
  _Istate_86 |   4.278122   1.658868     2.58   0.013     .9445014    7.611743
  _Istate_87 |   2.090272   .7928339     2.64   0.011     .4970128    3.683532
  _Istate_88 |   2.067747   .2955914     7.00   0.000     1.473734     2.66176
  _Istate_91 |   2.971399   2.649294     1.12   0.268    -2.352558    8.295355
  _Istate_92 |   2.104334   1.775331     1.19   0.242    -1.463327    5.671995
  _Istate_93 |   5.929294   6.392916     0.93   0.358    -6.917751    18.77634
  _Istate_94 |   .6629271   .9234217     0.72   0.476    -1.192758    2.518613
  _Istate_95 |   2.145227   .3014124     7.12   0.000     1.539516    2.750937
  _IstaXt_12 |  -.1390565   .0313222    -4.44   0.000    -.2020009   -.0761121
  _IstaXt_13 |  -.0641185   .0567456    -1.13   0.264    -.1781531    .0499162
  _IstaXt_14 |  -.2091305   .0192353   -10.87   0.000    -.2477852   -.1704758
  _IstaXt_15 |  -.1635588   .0149944   -10.91   0.000    -.1936912   -.1334264
  _IstaXt_16 |  -.2136953   .0411822    -5.19   0.000    -.2964541   -.1309366
  _IstaXt_21 |  -.2977338   .0321343    -9.27   0.000    -.3623101   -.2331574
  _IstaXt_22 |  -.2760366   .0425187    -6.49   0.000    -.3614811   -.1905922
  _IstaXt_23 |  -.2416565   .0408354    -5.92   0.000    -.3237182   -.1595948
  _IstaXt_31 |   -.158983    .023752    -6.69   0.000    -.2067144   -.1112516
  _IstaXt_32 |  -.0840753   .0314498    -2.67   0.010    -.1472761   -.0208745
  _IstaXt_33 |   -.255458   .0410788    -6.22   0.000     -.338009    -.172907
  _IstaXt_34 |  -.0968092   .0048835   -19.82   0.000    -.1066228   -.0869955
  _IstaXt_35 |  -.2107166   .0457678    -4.60   0.000    -.3026904   -.1187428
  _IstaXt_41 |  -.1300209    .030574    -4.25   0.000    -.1914616   -.0685801
  _IstaXt_42 |  -.2020363   .0637259    -3.17   0.003    -.3300983   -.0739744
  _IstaXt_43 |  -.1855929   .0305454    -6.08   0.000    -.2469762   -.1242096
  _IstaXt_44 |  -.1375394   .0813933    -1.69   0.097    -.3011054    .0260267
  _IstaXt_45 |  -.1145348   .0406795    -2.82   0.007    -.1962833   -.0327863
  _IstaXt_46 |  -.2170958   .0381998    -5.68   0.000    -.2938613   -.1403304
  _IstaXt_47 |  -.2112434   .0472988    -4.47   0.000    -.3062939    -.116193
  _IstaXt_51 |  -.1820267   .0109754   -16.58   0.000    -.2040826   -.1599707
  _IstaXt_52 |  -.1317851   .0361583    -3.64   0.001    -.2044479   -.0591223
  _IstaXt_54 |  -.2404323   .0388755    -6.18   0.000    -.3185556    -.162309
  _IstaXt_55 |  -.2093187   .0779707    -2.68   0.010    -.3660067   -.0526307
  _IstaXt_56 |  -.1111461   .0308977    -3.60   0.001    -.1732373   -.0490548
  _IstaXt_57 |  -.1427965   .0445868    -3.20   0.002    -.2323971   -.0531959
  _IstaXt_58 |  -.2093241   .0175888   -11.90   0.000      -.24467   -.1739782
  _IstaXt_59 |  -.1498978   .0248981    -6.02   0.000    -.1999323   -.0998633
  _IstaXt_61 |  -.2287734   .0131412   -17.41   0.000    -.2551815   -.2023652
  _IstaXt_62 |  -.1704751     .01949    -8.75   0.000    -.2096417   -.1313086
  _IstaXt_63 |  -.2443291   .0361851    -6.75   0.000    -.3170457   -.1716124
  _IstaXt_64 |  -.1440113   .0377564    -3.81   0.000    -.2198857   -.0681369
  _IstaXt_71 |  -.1812007   .0336391    -5.39   0.000    -.2488011   -.1136004
  _IstaXt_72 |  -.3876863   .1119921    -3.46   0.001    -.6127429   -.1626296
  _IstaXt_73 |   -.331489   .1205506    -2.75   0.008    -.5737446   -.0892334
  _IstaXt_74 |  -.2789724   .0701941    -3.97   0.000    -.4200326   -.1379121
  _IstaXt_81 |  -.0509106   .0905778    -0.56   0.577    -.2329335    .1311123
  _IstaXt_82 |  -.2784136   .0621507    -4.48   0.000    -.4033101   -.1535172
  _IstaXt_83 |  -.0099902   .1351525    -0.07   0.941    -.2815893     .261609
  _IstaXt_84 |  -.2763477   .0533318    -5.18   0.000     -.383522   -.1691734
  _IstaXt_85 |  -.1834425   .0312046    -5.88   0.000    -.2461506   -.1207345
  _IstaXt_86 |  -.3191792   .0696588    -4.58   0.000    -.4591638   -.1791946
  _IstaXt_87 |  -.1996604   .0420057    -4.75   0.000    -.2840741   -.1152467
  _IstaXt_88 |   -.276734   .0430589    -6.43   0.000    -.3632641   -.1902039
  _IstaXt_91 |  -.2028522   .0194334   -10.44   0.000    -.2419051   -.1637993
  _IstaXt_92 |  -.1282035   .0179747    -7.13   0.000     -.164325   -.0920819
  _IstaXt_93 |  -.2692044   .0084404   -31.89   0.000     -.286166   -.2522429
  _IstaXt_94 |  -.2952585   .0879524    -3.36   0.002    -.4720054   -.1185117
  _IstaXt_95 |  -.2803449   .0406678    -6.89   0.000    -.3620699     -.19862
       _cons |   5.061736   25.97128     0.19   0.846    -47.12951    57.25299
------------------------------------------------------------------------------

. reg lnths lnemp mico mppa mgfa _Iyear* _Istate* _IstaXt_*  if year>=87 & year
> <=91, cluster(state);

Linear regression                                      Number of obs =     250
                                                       F(  6,    49) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.9951
                                                       Root MSE      =  .13744

                                 (Std. Err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       lnemp |   .5663279    2.11197     0.27   0.790    -3.677835     4.81049
        mico |   .1454673   .1099701     1.32   0.192    -.0755259    .3664604
        mppa |  -.0444967   .1685543    -0.26   0.793    -.3832193     .294226
        mgfa |   .0490281   .2184782     0.22   0.823    -.3900203    .4880766
   _Iyear_75 |  (dropped)
   _Iyear_76 |  (dropped)
   _Iyear_80 |  (dropped)
   _Iyear_81 |  (dropped)
   _Iyear_82 |  (dropped)
   _Iyear_83 |  (dropped)
   _Iyear_84 |  (dropped)
   _Iyear_85 |  (dropped)
   _Iyear_86 |  (dropped)
   _Iyear_87 |  -.4073789   .0473172    -8.61   0.000    -.5024663   -.3122915
   _Iyear_88 |  -.1153177   .0291618    -3.95   0.000    -.1739206   -.0567148
   _Iyear_89 |  -.0436892   .0506501    -0.86   0.393    -.1454744    .0580959
   _Iyear_90 |  -.0219952   .0610565    -0.36   0.720    -.1446928    .1007023
   _Iyear_91 |  (dropped)
   _Iyear_92 |  (dropped)
   _Iyear_93 |  (dropped)
   _Iyear_94 |  (dropped)
   _Iyear_95 |  (dropped)
   _Iyear_96 |  (dropped)
   _Iyear_97 |  (dropped)
  _Istate_12 |   1.253334   .6830142     1.84   0.073    -.1192345    2.625902
  _Istate_13 |  -.7964283   1.515748    -0.53   0.602    -3.842439    2.249582
  _Istate_14 |   2.903266   4.464459     0.65   0.519    -6.068401    11.87493
  _Istate_15 |    1.79554   .2641241     6.80   0.000     1.264762    2.326317
  _Istate_16 |   2.863848   2.822551     1.01   0.315     -2.80828    8.535976
  _Istate_21 |   2.926454   6.029789     0.49   0.630    -9.190861    15.04377
  _Istate_22 |   2.672884   4.288447     0.62   0.536    -5.945074    11.29084
  _Istate_23 |   1.912863   4.738898     0.40   0.688    -7.610309    11.43603
  _Istate_31 |   1.401736   4.487261     0.31   0.756    -7.615752    10.41922
  _Istate_32 |   1.941864   2.840819     0.68   0.497    -3.766975    7.650703
  _Istate_33 |   1.124417    4.56416     0.25   0.806    -8.047606    10.29644
  _Istate_34 |   2.564425   4.042934     0.63   0.529    -5.560155      10.689
  _Istate_35 |   1.891609    2.57018     0.74   0.465    -3.273361     7.05658
  _Istate_41 |   2.002266   2.495647     0.80   0.426    -3.012924    7.017455
  _Istate_42 |   .9947957   1.183905     0.84   0.405     -1.38435    3.373942
  _Istate_43 |    .945752   2.744506     0.34   0.732    -4.569538    6.461042
  _Istate_44 |  -2.060484   1.777964    -1.16   0.252    -5.633437    1.512469
  _Istate_45 |    1.81434    1.99617     0.91   0.368    -2.197114    5.825793
  _Istate_46 |  -.0553361   .1965847    -0.28   0.780    -.4503878    .3397156
  _Istate_47 |  -.5761527   1.076025    -0.54   0.595    -2.738506    1.586201
  _Istate_51 |   1.581577   1.111116     1.42   0.161    -.6512934    3.814448
  _Istate_52 |   2.712903   2.808175     0.97   0.339    -2.930336    8.356142
  _Istate_54 |   1.274292   3.294142     0.39   0.701    -5.345534    7.894119
  _Istate_55 |  -.6151188   .2109011    -2.92   0.005     -1.03894   -.1912973
  _Istate_56 |   1.680476   3.434512     0.49   0.627    -5.221435    8.582386
  _Istate_57 |   .3591082   1.759315     0.20   0.839    -3.176368    3.894585
  _Istate_58 |   1.423431    3.48221     0.41   0.684    -5.574332    8.421194
  _Istate_59 |   1.502054   4.491429     0.33   0.739    -7.523812    10.52792
  _Istate_61 |  -.1704667   1.575601    -0.11   0.914    -3.336755    2.995822
  _Istate_62 |   .5630864   2.571974     0.22   0.828     -4.60549    5.731662
  _Istate_63 |   -.442829   2.008117    -0.22   0.826    -4.478292    3.592634
  _Istate_64 |  -3.428466   .8663337    -3.96   0.000    -5.169429   -1.687503
  _Istate_71 |  -2.574805    .565739    -4.55   0.000    -3.711701    -1.43791
  _Istate_72 |   .0245014   1.990566     0.01   0.990     -3.97569    4.024693
  _Istate_73 |  -.1900116   1.628752    -0.12   0.908    -3.463112    3.083089
  _Istate_74 |   .1581681   4.943318     0.03   0.975    -9.775802    10.09214
  _Istate_81 |  -2.007552   1.751479    -1.15   0.257    -5.527281    1.512177
  _Istate_82 |  -.9537142   1.864767    -0.51   0.611    -4.701104    2.793675
  _Istate_83 |  -.6709117   2.467536    -0.27   0.787     -5.62961    4.287787
  _Istate_84 |   .7936236   1.746215     0.45   0.651    -2.715526    4.302773
  _Istate_85 |  -.2586633   .3974231    -0.65   0.518    -1.057315    .5399884
  _Istate_86 |   1.189096   1.830204     0.65   0.519    -2.488836    4.867028
  _Istate_87 |  -1.004785   .4361734    -2.30   0.026    -1.881308   -.1282615
  _Istate_88 |   -1.08064   1.131316    -0.96   0.344    -3.354105    1.192825
  _Istate_91 |   .8665883    1.98055     0.44   0.664    -3.113475    4.846652
  _Istate_92 |   .2587088   1.083126     0.24   0.812    -1.917913    2.435331
  _Istate_93 |   2.686964   6.287562     0.43   0.671    -9.948364    15.32229
  _Istate_94 |   -2.19544   2.600851    -0.84   0.403    -7.422046    3.031165
  _Istate_95 |  -1.096281   .9787128    -1.12   0.268    -3.063078    .8705161
  _IstaXt_12 |   -.103527   .0626654    -1.65   0.105    -.2294578    .0224039
  _IstaXt_13 |   .0048765   .0065564     0.74   0.461    -.0082991    .0180521
  _IstaXt_14 |  -.1190232   .0728364    -1.63   0.109    -.2653936    .0273471
  _IstaXt_15 |  -.0994483   .0465651    -2.14   0.038    -.1930243   -.0058722
  _IstaXt_16 |   -.156362   .0409425    -3.82   0.000    -.2386389    -.074085
  _IstaXt_21 |   -.096824   .0218378    -4.43   0.000    -.1407087   -.0529392
  _IstaXt_22 |  -.1182415   .0235333    -5.02   0.000    -.1655334   -.0709495
  _IstaXt_23 |  -.0337672   .0062124    -5.44   0.000    -.0462515   -.0212829
  _IstaXt_31 |   .0227701   .0158758     1.43   0.158    -.0091335    .0546737
  _IstaXt_32 |  -.0647718   .0330585    -1.96   0.056    -.1312054    .0016619
  _IstaXt_33 |   .0546052   .0196342     2.78   0.008     .0151489    .0940615
  _IstaXt_34 |  -.0878259   .0120163    -7.31   0.000    -.1119736   -.0636782
  _IstaXt_35 |  -.0552173   .0391968    -1.41   0.165    -.1339863    .0235516
  _IstaXt_41 |  -.0585704   .0326221    -1.80   0.079    -.1241269    .0069862
  _IstaXt_42 |  -.0771727   .0455621    -1.69   0.097    -.1687331    .0143877
  _IstaXt_43 |   .0210135   .0433203     0.49   0.630     -.066042    .1080689
  _IstaXt_44 |   .0358491   .0228322     1.57   0.123    -.0100339    .0817321
  _IstaXt_45 |  -.2530978   .0628219    -4.03   0.000    -.3793431   -.1268524
  _IstaXt_46 |   .0593467   .0424541     1.40   0.168     -.025968    .1446613
  _IstaXt_47 |   .1025942   .0335572     3.06   0.004     .0351584      .17003
  _IstaXt_51 |  -.0635064   .0218725    -2.90   0.006    -.1074608   -.0195521
  _IstaXt_52 |  -.1351127   .0081615   -16.55   0.000    -.1515138   -.1187116
  _IstaXt_54 |  -.0144533   .0186569    -0.77   0.442    -.0519458    .0230391
  _IstaXt_55 |   .0361627   .0142802     2.53   0.015     .0074656    .0648599
  _IstaXt_56 |   -.019658   .0255756    -0.77   0.446    -.0710542    .0317382
  _IstaXt_57 |   .0643313   .0354616     1.81   0.076    -.0069314    .1355941
  _IstaXt_58 |   .0090326   .0179727     0.50   0.618    -.0270849    .0451501
  _IstaXt_59 |   .0624461   .0368101     1.70   0.096    -.0115265    .1364187
  _IstaXt_61 |   .0858735   .0439739     1.95   0.057    -.0024954    .1742425
  _IstaXt_62 |   .0643183    .031277     2.06   0.045     .0014647    .1271719
  _IstaXt_63 |   .0820463   .0328807     2.50   0.016     .0159701    .1481225
  _IstaXt_64 |   .3216435   .0302571    10.63   0.000     .2608396    .3824474
  _IstaXt_71 |   .3141643   .0479804     6.55   0.000      .217744    .4105846
  _IstaXt_72 |   .1032318   .0326432     3.16   0.003     .0376328    .1688308
  _IstaXt_73 |   .0940997   .0708045     1.33   0.190    -.0481872    .2363866
  _IstaXt_74 |   .1608312   .0400842     4.01   0.000     .0802789    .2413835
  _IstaXt_81 |    .081044   .0404558     2.00   0.051     -.000255    .1623431
  _IstaXt_82 |   .0289674   .1085931     0.27   0.791    -.1892586    .2471934
  _IstaXt_83 |  -.0471297   .0549804    -0.86   0.396    -.1576169    .0633575
  _IstaXt_84 |    .017908   .0366145     0.49   0.627    -.0556715    .0914876
  _IstaXt_85 |   .0420914    .041531     1.01   0.316    -.0413682     .125551
  _IstaXt_86 |   .0075035   .0269467     0.28   0.782    -.0466478    .0616549
  _IstaXt_87 |   .1725229   .0730585     2.36   0.022     .0257064    .3193394
  _IstaXt_88 |   .1164363   .1136576     1.02   0.311    -.1119673    .3448398
  _IstaXt_91 |   .0011558   .0759372     0.02   0.988    -.1514456    .1537573
  _IstaXt_92 |   .0626771   .0554233     1.13   0.264    -.0487001    .1740543
  _IstaXt_93 |  -.0356202   .0282736    -1.26   0.214    -.0924381    .0211977
  _IstaXt_94 |   .0997515   .0705901     1.41   0.164    -.0421045    .2416076
  _IstaXt_95 |   .1152416    .074805     1.54   0.130    -.0350848    .2655679
       _cons |   .4502075   27.73911     0.02   0.987    -55.29361    56.19403
------------------------------------------------------------------------------

. * 2 year intervals - no linear trends;
. reg lnths lnemp mico mppa mgfa _Iyear* _Istate*  if year>=79 & year<=83 & yea
> r2, cluster(state);

Linear regression                                      Number of obs =     150
                                                       F(  5,    49) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.9877
                                                       Root MSE      =  .23531

                                 (Std. Err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       lnemp |   2.524844   .6984005     3.62   0.001     1.121356    3.928333
        mico |   .0727846   .0919404     0.79   0.432    -.1119766    .2575459
        mppa |   .0641672   .0974424     0.66   0.513    -.1316506     .259985
        mgfa |  -.1383229   .0746944    -1.85   0.070     -.288427    .0117811
   _Iyear_75 |  (dropped)
   _Iyear_76 |  (dropped)
   _Iyear_80 |  (dropped)
   _Iyear_81 |   -.060117    .073436    -0.82   0.417    -.2076922    .0874582
   _Iyear_82 |  (dropped)
   _Iyear_83 |   -.036631   .0895659    -0.41   0.684    -.2166203    .1433584
   _Iyear_84 |  (dropped)
   _Iyear_85 |  (dropped)
   _Iyear_86 |  (dropped)
   _Iyear_87 |  (dropped)
   _Iyear_88 |  (dropped)
   _Iyear_89 |  (dropped)
   _Iyear_90 |  (dropped)
   _Iyear_91 |  (dropped)
   _Iyear_92 |  (dropped)
   _Iyear_93 |  (dropped)
   _Iyear_94 |  (dropped)
   _Iyear_95 |  (dropped)
   _Iyear_96 |  (dropped)
   _Iyear_97 |  (dropped)
  _Istate_12 |   .9282886   .1346357     6.89   0.000     .6577281    1.198849
  _Istate_13 |   .4410273   .5143674     0.86   0.395    -.5926328    1.474687
  _Istate_14 |  -1.007905   1.272988    -0.79   0.432    -3.566069    1.550259
  _Istate_15 |   1.405346   .0977152    14.38   0.000      1.20898    1.601712
  _Istate_16 |  -.2019447   .8504589    -0.24   0.813    -1.911006    1.507117
  _Istate_21 |  -2.536535    1.99277    -1.27   0.209    -6.541157    1.468087
  _Istate_22 |   -1.52491   1.410188    -1.08   0.285    -4.358789    1.308969
  _Istate_23 |  -2.503638   1.704502    -1.47   0.148    -5.928963     .921687
  _Istate_31 |  -2.380953   1.626446    -1.46   0.150    -5.649418    .8875118
  _Istate_32 |  -1.739936   1.154221    -1.51   0.138    -4.059431    .5795585
  _Istate_33 |  -2.413356   1.705147    -1.42   0.163    -5.839978    1.013266
  _Istate_34 |   -2.18267   1.478992    -1.48   0.146    -5.154816    .7894748
  _Istate_35 |  -1.009255   1.076158    -0.94   0.353    -3.171876    1.153365
  _Istate_41 |  -.6286564    .999578    -0.63   0.532    -2.637384    1.380071
  _Istate_42 |  -.7849017   .6722141    -1.17   0.249    -2.135766    .5659631
  _Istate_43 |  -1.211121   1.081881    -1.12   0.268    -3.385242    .9629996
  _Istate_44 |  -.2778138   .3769176    -0.74   0.465    -1.035258    .4796304
  _Istate_45 |   .4244462    .401213     1.06   0.295    -.3818215    1.230714
  _Istate_46 |   .2701011   .2821158     0.96   0.343    -.2968318     .837034
  _Istate_47 |  -1.034541   .5818848    -1.78   0.082    -2.203882    .1348003
  _Istate_51 |   2.353566   .3434989     6.85   0.000     1.663279    3.043852
  _Istate_52 |  -.8693467   .9970208    -0.87   0.387    -2.872935    1.134242
  _Istate_54 |  -1.323844   1.147023    -1.15   0.254    -3.628873    .9811849
  _Istate_55 |  -.4149706    .312558    -1.33   0.190    -1.043079    .2131382
  _Istate_56 |   -2.00554   1.221411    -1.64   0.107    -4.460058    .4489778
  _Istate_57 |  -.9885959   .7336824    -1.35   0.184    -2.462986     .485794
  _Istate_58 |  -1.288913   1.162728    -1.11   0.273    -3.625502    1.047675
  _Istate_59 |  -1.757597   1.518496    -1.16   0.253    -4.809128    1.293934
  _Istate_61 |  -.8969085   .7403101    -1.21   0.232    -2.384617    .5908003
  _Istate_62 |  -1.415946   .9980616    -1.42   0.162    -3.421626    .5897334
  _Istate_63 |  -1.606149   .8208318    -1.96   0.056    -3.255672    .0433744
  _Istate_64 |  -2.005026   .4754596    -4.22   0.000    -2.960497   -1.049554
  _Istate_71 |  -.5842477    .421905    -1.38   0.172    -1.432098    .2636022
  _Istate_72 |  -.3557011   .9278667    -0.38   0.703    -2.220319    1.508917
  _Istate_73 |  -.1503857   .7047958    -0.21   0.832    -1.566726    1.265955
  _Istate_74 |  -2.550532   1.860041    -1.37   0.177    -6.288423     1.18736
  _Istate_81 |  -.6485376   .2967484    -2.19   0.034    -1.244876   -.0521995
  _Istate_82 |   .2187994   .1861013     1.18   0.245    -.1551851     .592784
  _Istate_83 |   .5969389   .4949576     1.21   0.234    -.3977157    1.591594
  _Istate_84 |   -.126616   .7817875    -0.16   0.872    -1.697677    1.444445
  _Istate_85 |   .2077418   .0948228     2.19   0.033     .0171884    .3982953
  _Istate_86 |   .1278357   .6323556     0.20   0.841    -1.142931    1.398602
  _Istate_87 |   .0590059   .2203947     0.27   0.790    -.3838939    .5019057
  _Istate_88 |   .7368594   .0701802    10.50   0.000      .595827    .8778918
  _Istate_91 |  -1.050304   .9310428    -1.13   0.265    -2.921304    .8206964
  _Istate_92 |  -.4890943   .6362666    -0.77   0.446     -1.76772    .7895313
  _Istate_93 |  -2.888403   2.198961    -1.31   0.195     -7.30738    1.530575
  _Istate_94 |   .9869401   .5735421     1.72   0.092     -.165636    2.139516
  _Istate_95 |   1.074621   .0923244    11.64   0.000      .889088    1.260154
       _cons |  -26.51554   9.038993    -2.93   0.005    -44.68008   -8.351005
------------------------------------------------------------------------------

. reg lnths lnemp mico mppa mgfa _Iyear* _Istate*  if year>=83 & year<=87 & yea
> r2, cluster(state);

Linear regression                                      Number of obs =     150
                                                       F(  5,    49) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.9900
                                                       Root MSE      =  .20497

                                 (Std. Err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       lnemp |   .8752357   1.205646     0.73   0.471      -1.5476    3.298072
        mico |   .1985082   .0993673     2.00   0.051    -.0011779    .3981943
        mppa |   -.039666    .082383    -0.48   0.632    -.2052209    .1258889
        mgfa |  -.2255297    .116229    -1.94   0.058    -.4591005    .0080412
   _Iyear_75 |  (dropped)
   _Iyear_76 |  (dropped)
   _Iyear_80 |  (dropped)
   _Iyear_81 |  (dropped)
   _Iyear_82 |  (dropped)
   _Iyear_83 |   -.722982   .1766755    -4.09   0.000    -1.078025   -.3679392
   _Iyear_84 |  (dropped)
   _Iyear_85 |   -.192304   .0877709    -2.19   0.033    -.3686862   -.0159218
   _Iyear_86 |  (dropped)
   _Iyear_87 |  (dropped)
   _Iyear_88 |  (dropped)
   _Iyear_89 |  (dropped)
   _Iyear_90 |  (dropped)
   _Iyear_91 |  (dropped)
   _Iyear_92 |  (dropped)
   _Iyear_93 |  (dropped)
   _Iyear_94 |  (dropped)
   _Iyear_95 |  (dropped)
   _Iyear_96 |  (dropped)
   _Iyear_97 |  (dropped)
  _Istate_12 |   .7724568   .1687254     4.58   0.000     .4333903    1.111523
  _Istate_13 |  -.5586305   .8585962    -0.65   0.518    -2.284044    1.166783
  _Istate_14 |   1.819818   2.211411     0.82   0.415    -2.624179    6.263814
  _Istate_15 |   1.081073   .1352741     7.99   0.000     .8092297    1.352917
  _Istate_16 |   1.643095   1.452584     1.13   0.263    -1.275983    4.562172
  _Istate_21 |    1.55549   3.396313     0.46   0.649    -5.269657    8.380637
  _Istate_22 |   1.382418   2.419236     0.57   0.570    -3.479219    6.244055
  _Istate_23 |   1.203157   2.825446     0.43   0.672    -4.474789    6.881103
  _Istate_31 |   1.059175   2.710456     0.39   0.698    -4.387691    6.506041
  _Istate_32 |   .8367178   1.884108     0.44   0.659    -2.949538    4.622974
  _Istate_33 |   1.191309   2.823798     0.42   0.675    -4.483325    6.865944
  _Istate_34 |   1.316975   2.459618     0.54   0.595    -3.625812    6.259762
  _Istate_35 |   1.164209   1.773395     0.66   0.515    -2.399561    4.727979
  _Istate_41 |   1.137977   1.678624     0.68   0.501    -2.235345    4.511299
  _Istate_42 |   .3008159   1.035527     0.29   0.773    -1.780153    2.381785
  _Istate_43 |   .8642866   1.823673     0.47   0.638    -2.800522    4.529095
  _Istate_44 |  -1.358403   .7230846    -1.88   0.066    -2.811496    .0946894
  _Istate_45 |   -.306127   .7507285    -0.41   0.685    -1.814772    1.202518
  _Istate_46 |   .4338419   .4066285     1.07   0.291    -.3833087    1.250992
  _Istate_47 |   .2218547   .9090177     0.24   0.808    -1.604885    2.048594
  _Istate_51 |   1.391847   .5516583     2.52   0.015     .2832477    2.500446
  _Istate_52 |   1.287791   1.709583     0.75   0.455    -2.147743    4.723326
  _Istate_54 |   .9475058   2.019533     0.47   0.641    -3.110898    5.005909
  _Istate_55 |   -.196976   .3338636    -0.59   0.558       -.8679    .4739481
  _Istate_56 |   .9792164   2.119833     0.46   0.646    -3.280748    5.239181
  _Istate_57 |   .6875684   1.255534     0.55   0.586    -1.835522    3.210659
  _Istate_58 |   1.358806   2.063251     0.66   0.513    -2.787453    5.505064
  _Istate_59 |   1.642722   2.719296     0.60   0.549    -3.821909    7.107353
  _Istate_61 |   .5959786   1.211348     0.49   0.625    -1.838317    3.030274
  _Istate_62 |   .8624877   1.694098     0.51   0.613     -2.54193    4.266905
  _Istate_63 |   .5086479   1.353022     0.38   0.709    -2.210352    3.227648
  _Istate_64 |   -.553943   .7276275    -0.76   0.450    -2.016165    .9082793
  _Istate_71 |   .0903378   .6710758     0.13   0.893    -1.258239    1.438915
  _Istate_72 |   1.214963   1.467838     0.83   0.412    -1.734767    4.164694
  _Istate_73 |   1.023555   1.085207     0.94   0.350     -1.15725     3.20436
  _Istate_74 |   1.219167   3.193799     0.38   0.704    -5.199012    7.637347
  _Istate_81 |  -1.246855   .6459064    -1.93   0.059    -2.544853    .0511422
  _Istate_82 |  -.5229214    .400853    -1.30   0.198    -1.328466    .2826228
  _Istate_83 |  -.6493601   1.022474    -0.64   0.528    -2.704099    1.405378
  _Istate_84 |   1.056594   1.337784     0.79   0.433    -1.631785    3.744972
  _Istate_85 |   .1223667   .1568572     0.78   0.439    -.1928496     .437583
  _Istate_86 |   1.561464   1.188571     1.31   0.195    -.8270581    3.949987
  _Istate_87 |   .5340213   .3474032     1.54   0.131    -.1641116    1.232154
  _Istate_88 |   .2877394   .0742165     3.88   0.000     .1385957    .4368831
  _Istate_91 |   .5214679   1.593172     0.33   0.745    -2.680131    3.723067
  _Istate_92 |   .5377414   .9877696     0.54   0.589    -1.447256    2.522739
  _Istate_93 |   1.949303   3.780251     0.52   0.608    -5.647395    9.546002
  _Istate_94 |  -.4204914   .9313676    -0.45   0.654    -2.292145    1.451162
  _Istate_95 |   .3662877   .1158831     3.16   0.003     .1334118    .5991635
       _cons |  -4.236394   15.79695    -0.27   0.790    -35.98156    27.50877
------------------------------------------------------------------------------

. reg lnths lnemp mico mppa mgfa _Iyear* _Istate*  if year>=87 & year<=91 & yea
> r2, cluster(state);

Linear regression                                      Number of obs =     150
                                                       F(  5,    49) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.9853
                                                       Root MSE      =  .22675

                                 (Std. Err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       lnemp |   3.739939   .8148288     4.59   0.000     2.102479    5.377399
        mico |   .0887017   .0470544     1.89   0.065    -.0058578    .1832611
        mppa |  -.3645095   .3704137    -0.98   0.330    -1.108884    .3798646
        mgfa |  -.1922377   .2688761    -0.71   0.478    -.7325645    .3480891
   _Iyear_75 |  (dropped)
   _Iyear_76 |  (dropped)
   _Iyear_80 |  (dropped)
   _Iyear_81 |  (dropped)
   _Iyear_82 |  (dropped)
   _Iyear_83 |  (dropped)
   _Iyear_84 |  (dropped)
   _Iyear_85 |  (dropped)
   _Iyear_86 |  (dropped)
   _Iyear_87 |  (dropped)
   _Iyear_88 |  (dropped)
   _Iyear_89 |   .2304996   .0715883     3.22   0.002     .0866376    .3743616
   _Iyear_90 |  (dropped)
   _Iyear_91 |   .2660204   .0708682     3.75   0.000     .1236054    .4084354
   _Iyear_92 |  (dropped)
   _Iyear_93 |  (dropped)
   _Iyear_94 |  (dropped)
   _Iyear_95 |  (dropped)
   _Iyear_96 |  (dropped)
   _Iyear_97 |  (dropped)
  _Istate_12 |   .6952137   .5953668     1.17   0.249    -.5012207    1.891648
  _Istate_13 |   1.863502   .7109236     2.62   0.012     .4348476    3.292156
  _Istate_14 |  -3.428621   1.453491    -2.36   0.022     -6.34952   -.5077212
  _Istate_15 |   1.057517   .1683036     6.28   0.000     .7192981    1.395736
  _Istate_16 |  -1.934182   1.026687    -1.88   0.066    -3.997387    .1290232
  _Istate_21 |  -6.872876   2.235986    -3.07   0.003    -11.36626   -2.379495
  _Istate_22 |  -4.437789   1.600212    -2.77   0.008    -7.653536   -1.222042
  _Istate_23 |  -5.418837   1.829738    -2.96   0.005    -9.095833   -1.741842
  _Istate_31 |  -5.385935   1.802807    -2.99   0.004    -9.008811    -1.76306
  _Istate_32 |  -3.388944   1.293106    -2.62   0.012    -5.987538   -.7903502
  _Istate_33 |  -5.273678   1.883822    -2.80   0.007     -9.05936   -1.487996
  _Istate_34 |  -4.455867   1.656033    -2.69   0.010    -7.783791   -1.127944
  _Istate_35 |  -3.016094   1.218719    -2.47   0.017    -5.465201   -.5669866
  _Istate_41 |  -2.703121   1.165413    -2.32   0.025    -5.045105   -.3611369
  _Istate_42 |  -2.108988   .7493312    -2.81   0.007    -3.614826   -.6031508
  _Istate_43 |  -3.226398   1.214084    -2.66   0.011     -5.66619    -.786606
  _Istate_44 |   .7842707   .6862438     1.14   0.259    -.5947879    2.163329
  _Istate_45 |   1.244578   .5815679     2.14   0.037     .0758731    2.413282
  _Istate_46 |  -.0661596   .4356956    -0.15   0.880    -.9417228    .8094035
  _Istate_47 |  -1.394151   .6703228    -2.08   0.043    -2.741215   -.0470869
  _Istate_51 |   2.202101   .3972535     5.54   0.000      1.40379    3.000412
  _Istate_52 |  -2.849005   1.177684    -2.42   0.019    -5.215649   -.4823605
  _Istate_54 |  -3.926068   1.401516    -2.80   0.007    -6.742519   -1.109617
  _Istate_55 |  -.4470842   .3885019    -1.15   0.255    -1.227808    .3336396
  _Istate_56 |  -3.900451   1.417659    -2.75   0.008    -6.749344   -1.051558
  _Istate_57 |  -1.995149   .9073044    -2.20   0.033    -3.818445   -.1718525
  _Istate_58 |   -4.03659    1.35698    -2.97   0.005    -6.763544   -1.309636
  _Istate_59 |  -5.161528   1.825738    -2.83   0.007    -8.830485    -1.49257
  _Istate_61 |  -2.100757   .8780234    -2.39   0.021    -3.865211   -.3363031
  _Istate_62 |  -2.917466   1.187116    -2.46   0.018    -5.303065   -.5318659
  _Istate_63 |  -2.863599   .8836301    -3.24   0.002     -4.63932   -1.087877
  _Istate_64 |  -1.476273   .5380031    -2.74   0.008     -2.55743   -.3951148
  _Istate_71 |  -.5845334   .5589704    -1.05   0.301    -1.707827    .5387597
  _Istate_72 |  -2.353295   .8475037    -2.78   0.008    -4.056417    -.650172
  _Istate_73 |  -1.405324   .6969316    -2.02   0.049     -2.80586   -.0047871
  _Istate_74 |  -5.928306   2.115156    -2.80   0.007    -10.17887   -1.677741
  _Istate_81 |   1.406084   .8097375     1.74   0.089    -.2211443    3.033313
  _Istate_82 |   .8321525   .6170008     1.35   0.184    -.4077571    2.072062
  _Istate_83 |   2.320315   .8558283     2.71   0.009     .6004634    4.040166
  _Istate_84 |  -2.030439   .9131466    -2.22   0.031    -3.865476   -.1954023
  _Istate_85 |   .2792945   .3722159     0.75   0.457    -.4687014     1.02729
  _Istate_86 |  -1.467376   .9512584    -1.54   0.129    -3.379001    .4442497
  _Istate_87 |   .1082562    .331107     0.33   0.745    -.5571283    .7736406
  _Istate_88 |   .4523751   .5853874     0.77   0.443    -.7240049    1.628755
  _Istate_91 |  -3.142089   1.150332    -2.73   0.009    -5.453767   -.8304099
  _Istate_92 |   -1.37497   .7497815    -1.83   0.073    -2.881712    .1317725
  _Istate_93 |  -7.159357   2.545068    -2.81   0.007    -12.27386   -2.044851
  _Istate_94 |    2.01629   .9592786     2.10   0.041     .0885475    3.944033
  _Istate_95 |   .5480817   .3730207     1.47   0.148    -.2015314    1.297695
       _cons |    -41.549   10.73549    -3.87   0.000    -63.12277   -19.97523
------------------------------------------------------------------------------

. * 4 year intervals - no linear trends;
. reg lnths lnemp mico mppa mgfa _Iyear* _Istate*   if year>=79 & year<=83 & ye
> ar4, cluster(state);

Linear regression                                      Number of obs =     100
                                                       F(  4,    49) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.9893
                                                       Root MSE      =   .2606

                                 (Std. Err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       lnemp |   2.428423   .9069352     2.68   0.010     .6058681    4.250977
        mico |   .0335484   .1520177     0.22   0.826    -.2719427    .3390395
        mppa |  -.0009103   .1231313    -0.01   0.994    -.2483519    .2465314
        mgfa |  -.0829418   .1437371    -0.58   0.567    -.3717923    .2059087
   _Iyear_75 |  (dropped)
   _Iyear_76 |  (dropped)
   _Iyear_80 |  (dropped)
   _Iyear_81 |  (dropped)
   _Iyear_82 |  (dropped)
   _Iyear_83 |  -.0145386   .1201921    -0.12   0.904    -.2560738    .2269966
   _Iyear_84 |  (dropped)
   _Iyear_85 |  (dropped)
   _Iyear_86 |  (dropped)
   _Iyear_87 |  (dropped)
   _Iyear_88 |  (dropped)
   _Iyear_89 |  (dropped)
   _Iyear_90 |  (dropped)
   _Iyear_91 |  (dropped)
   _Iyear_92 |  (dropped)
   _Iyear_93 |  (dropped)
   _Iyear_94 |  (dropped)
   _Iyear_95 |  (dropped)
   _Iyear_96 |  (dropped)
   _Iyear_97 |  (dropped)
  _Istate_12 |   .7423868    .199253     3.73   0.001     .3419728    1.142801
  _Istate_13 |   .0779125   .6666549     0.12   0.907    -1.261781    1.417606
  _Istate_14 |  -.9663029   1.661465    -0.58   0.564    -4.305141    2.372535
  _Istate_15 |    1.21099   .1551197     7.81   0.000     .8992649    1.522714
  _Istate_16 |  -.2226752   1.116575    -0.20   0.843    -2.466516    2.021166
  _Istate_21 |  -2.308442    2.59062    -0.89   0.377    -7.514487    2.897603
  _Istate_22 |  -1.413038   1.839269    -0.77   0.446    -5.109188    2.283112
  _Istate_23 |  -2.269661   2.219166    -1.02   0.311    -6.729242     2.18992
  _Istate_31 |  -2.201943   2.114247    -1.04   0.303    -6.450681    2.046795
  _Istate_32 |  -1.609472   1.511316    -1.06   0.292    -4.646574    1.427631
  _Istate_33 |  -2.092733    2.20949    -0.95   0.348    -6.532869    2.347404
  _Istate_34 |  -1.893281   1.929569    -0.98   0.331    -5.770895    1.984334
  _Istate_35 |  -.9011094     1.4046    -0.64   0.524    -3.723759     1.92154
  _Istate_41 |   -.480653    1.29923    -0.37   0.713    -3.091553    2.130247
  _Istate_42 |  -.7502611   .8879367    -0.84   0.402    -2.534637    1.034115
  _Istate_43 |  -1.130136   1.412034    -0.80   0.427    -3.967724    1.707451
  _Istate_44 |  -.1026641   .4898843    -0.21   0.835    -1.087123    .8817954
  _Istate_45 |   .4634819   .5128701     0.90   0.371    -.5671692    1.494133
  _Istate_46 |   .1763517   .3689977     0.48   0.635    -.5651769    .9178803
  _Istate_47 |  -.9217435   .7605313    -1.21   0.231    -2.450088    .6066013
  _Istate_51 |   2.209568    .442736     4.99   0.000     1.319856    3.099279
  _Istate_52 |   -.809434   1.302076    -0.62   0.537    -3.426054    1.807187
  _Istate_54 |  -1.295601   1.493919    -0.87   0.390    -4.297743    1.706542
  _Istate_55 |   -.492739   .4135476    -1.19   0.239    -1.323794     .338316
  _Istate_56 |  -1.882846   1.600534    -1.18   0.245     -5.09924    1.333548
  _Istate_57 |  -.9571444   .9648422    -0.99   0.326    -2.896067    .9817785
  _Istate_58 |  -1.155563   1.524399    -0.76   0.452    -4.218957    1.907831
  _Istate_59 |  -1.601517   1.976903    -0.81   0.422    -5.574253    2.371219
  _Istate_61 |  -.6983793   .9685208    -0.72   0.474    -2.644695    1.247936
  _Istate_62 |  -1.218314   1.302019    -0.94   0.354     -3.83482    1.398192
  _Istate_63 |  -1.544917   1.080545    -1.43   0.159    -3.716353    .6265198
  _Istate_64 |    -2.1005   .6338307    -3.31   0.002     -3.37423   -.8267689
  _Istate_71 |  -.6601333   .5606538    -1.18   0.245    -1.786809    .4665428
  _Istate_72 |  -.2518132   1.202699    -0.21   0.835    -2.668727    2.165101
  _Istate_73 |  -.1208358   .8954819    -0.13   0.893    -1.920374    1.678703
  _Istate_74 |  -2.376584   2.413907    -0.98   0.330    -7.227513    2.474344
  _Istate_81 |  -.8544798   .3925976    -2.18   0.034    -1.643434   -.0655254
  _Istate_82 |   .1798115    .242353     0.74   0.462    -.3072152    .6668382
  _Istate_83 |   .4249306   .6688755     0.64   0.528    -.9192251    1.769086
  _Istate_84 |  -.0726372   1.013988    -0.07   0.943    -2.110323    1.965048
  _Istate_85 |   .1357013   .1409453     0.96   0.340     -.147539    .4189416
  _Istate_86 |   .2220343   .8216268     0.27   0.788    -1.429087    1.873155
  _Istate_87 |   .1297213   .3104453     0.42   0.678    -.4941418    .7535845
  _Istate_88 |   .7496361   .0925568     8.10   0.000     .5636362     .935636
  _Istate_91 |  -1.009126   1.202795    -0.84   0.406    -3.426234    1.407981
  _Istate_92 |  -.4571347   .8206584    -0.56   0.580     -2.10631     1.19204
  _Istate_93 |  -2.617401   2.854652    -0.92   0.364    -8.354039    3.119237
  _Istate_94 |   .7645168    .742593     1.03   0.308    -.7277798    2.256813
  _Istate_95 |   .9275157   .1432021     6.48   0.000     .6397404    1.215291
       _cons |  -25.19917   11.72789    -2.15   0.037    -48.76725   -1.631097
------------------------------------------------------------------------------

. reg lnths lnemp mico mppa mgfa _Iyear* _Istate*   if year>=83 & year<=87 & ye
> ar4, cluster(state);

Linear regression                                      Number of obs =     100
                                                       F(  4,    49) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.9908
                                                       Root MSE      =  .23218

                                 (Std. Err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       lnemp |   1.011976   1.324448     0.76   0.448    -1.649602    3.673554
        mico |   .2588898   .1407704     1.84   0.072    -.0239988    .5417785
        mppa |  -.0484125   .1191822    -0.41   0.686    -.2879182    .1910932
        mgfa |    -.29867    .095319    -3.13   0.003    -.4902208   -.1071193
   _Iyear_75 |  (dropped)
   _Iyear_76 |  (dropped)
   _Iyear_80 |  (dropped)
   _Iyear_81 |  (dropped)
   _Iyear_82 |  (dropped)
   _Iyear_83 |  -.6949144   .2016018    -3.45   0.001    -1.100048   -.2897804
   _Iyear_84 |  (dropped)
   _Iyear_85 |  (dropped)
   _Iyear_86 |  (dropped)
   _Iyear_87 |  (dropped)
   _Iyear_88 |  (dropped)
   _Iyear_89 |  (dropped)
   _Iyear_90 |  (dropped)
   _Iyear_91 |  (dropped)
   _Iyear_92 |  (dropped)
   _Iyear_93 |  (dropped)
   _Iyear_94 |  (dropped)
   _Iyear_95 |  (dropped)
   _Iyear_96 |  (dropped)
   _Iyear_97 |  (dropped)
  _Istate_12 |   .9986381   .1933065     5.17   0.000     .6101742    1.387102
  _Istate_13 |  -.1870246   .9456955    -0.20   0.844    -2.087471    1.713422
  _Istate_14 |   1.809673    2.43942     0.74   0.462    -3.092526    6.711871
  _Istate_15 |   1.161023   .1781337     6.52   0.000     .8030505    1.518996
  _Istate_16 |   1.635026   1.608106     1.02   0.314    -1.596585    4.866636
  _Istate_21 |   1.297842   3.723784     0.35   0.729    -6.185382    8.781066
  _Istate_22 |   1.296703    2.64992     0.49   0.627    -4.028511    6.621918
  _Istate_23 |   1.054179   3.101561     0.34   0.735    -5.178641       7.287
  _Istate_31 |   .8397111   2.965464     0.28   0.778    -5.119612    6.799034
  _Istate_32 |   .6845147   2.065687     0.33   0.742    -3.466638    4.835668
  _Istate_33 |   .9622339   3.095935     0.31   0.757     -5.25928    7.183748
  _Istate_34 |   .9984396   2.687329     0.37   0.712     -4.40195    6.398829
  _Istate_35 |    1.14364   1.945855     0.59   0.559    -2.766702    5.053983
  _Istate_41 |   1.055941   1.836516     0.57   0.568    -2.634677    4.746559
  _Istate_42 |   .3465913   1.131605     0.31   0.761    -1.927454    2.620636
  _Istate_43 |    .732049    1.99073     0.37   0.715    -3.268473    4.732571
  _Istate_44 |   -1.25383   .7988435    -1.57   0.123    -2.859166    .3515061
  _Istate_45 |  -.1843345   .8339704    -0.22   0.826    -1.860261    1.491592
  _Istate_46 |   .4959241   .4401131     1.13   0.265    -.3885163    1.380364
  _Istate_47 |   .2901479   .9979962     0.29   0.772      -1.7154    2.295696
  _Istate_51 |   1.541526   .6164329     2.50   0.016     .3027576    2.780294
  _Istate_52 |    1.28272   1.873382     0.68   0.497    -2.481982    5.047422
  _Istate_54 |   .8265819   2.208487     0.37   0.710    -3.611539    5.264703
  _Istate_55 |  -.1231167   .3675256    -0.33   0.739     -.861687    .6154536
  _Istate_56 |   .8992023   2.322326     0.39   0.700    -3.767686    5.566091
  _Istate_57 |   .6481434   1.369949     0.47   0.638    -2.104872    3.401158
  _Istate_58 |   1.205153   2.257249     0.53   0.596    -3.330959    5.741265
  _Istate_59 |   1.423742   2.980538     0.48   0.635    -4.565874    7.413357
  _Istate_61 |   .5359701   1.324046     0.40   0.687      -2.1248     3.19674
  _Istate_62 |   .7531018   1.853103     0.41   0.686    -2.970848    4.477052
  _Istate_63 |   .4705705   1.484667     0.32   0.753    -2.512979     3.45412
  _Istate_64 |  -.5117149   .7998262    -0.64   0.525    -2.119026    1.095596
  _Istate_71 |   .1756706   .7355944     0.24   0.812    -1.302562    1.653903
  _Istate_72 |   1.152444   1.593785     0.72   0.473    -2.050386    4.355274
  _Istate_73 |   1.062506   1.192981     0.89   0.377    -1.334878    3.459891
  _Istate_74 |   1.055461   3.483268     0.30   0.763    -5.944428    8.055349
  _Istate_81 |  -.7501334   .6970766    -1.08   0.287    -2.150961    .6506945
  _Istate_82 |  -.3688865   .4647781    -0.79   0.431    -1.302893    .5651201
  _Istate_83 |  -.2776649   1.158873    -0.24   0.812    -2.606508    2.051178
  _Istate_84 |   .9643309   1.447975     0.67   0.509    -1.945484    3.874146
  _Istate_85 |   .3019014   .1750594     1.72   0.091    -.0498936    .6536964
  _Istate_86 |   1.360068   1.293599     1.05   0.298    -1.239516    3.959653
  _Istate_87 |   .6220696   .3624166     1.72   0.092    -.1062338    1.350373
  _Istate_88 |   .4449016   .0809004     5.50   0.000     .2823262    .6074769
  _Istate_91 |    .535818   1.745063     0.31   0.760    -2.971016    4.042653
  _Istate_92 |   .5637984   1.084145     0.52   0.605    -1.614872    2.742469
  _Istate_93 |   1.699427   4.165228     0.41   0.685    -6.670912    10.06977
  _Istate_94 |  -.1449096   1.037707    -0.14   0.890    -2.230259     1.94044
  _Istate_95 |   .4908544   .1519765     3.23   0.002     .1854462    .7962626
       _cons |  -6.183512   17.35827    -0.36   0.723    -41.06627    28.69925
------------------------------------------------------------------------------

. reg lnths lnemp mico mppa mgfa _Iyear* _Istate*   if year>=87 & year<=91 & ye
> ar4, cluster(state);

Linear regression                                      Number of obs =     100
                                                       F(  4,    49) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.9851
                                                       Root MSE      =  .27051

                                 (Std. Err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       lnemp |   4.762881   1.125506     4.23   0.000     2.501091    7.024671
        mico |    .186851   .1061345     1.76   0.085    -.0264342    .4001362
        mppa |  -.5587514   .5167757    -1.08   0.285    -1.597251    .4797484
        mgfa |  -.4680555   .3667316    -1.28   0.208     -1.20503    .2689192
   _Iyear_75 |  (dropped)
   _Iyear_76 |  (dropped)
   _Iyear_80 |  (dropped)
   _Iyear_81 |  (dropped)
   _Iyear_82 |  (dropped)
   _Iyear_83 |  (dropped)
   _Iyear_84 |  (dropped)
   _Iyear_85 |  (dropped)
   _Iyear_86 |  (dropped)
   _Iyear_87 |  -.2046519   .0838341    -2.44   0.018    -.3731229   -.0361809
   _Iyear_88 |  (dropped)
   _Iyear_89 |  (dropped)
   _Iyear_90 |  (dropped)
   _Iyear_91 |  (dropped)
   _Iyear_92 |  (dropped)
   _Iyear_93 |  (dropped)
   _Iyear_94 |  (dropped)
   _Iyear_95 |  (dropped)
   _Iyear_96 |  (dropped)
   _Iyear_97 |  (dropped)
  _Istate_12 |   1.160939   .8393616     1.38   0.173    -.5258209      2.8477
  _Istate_13 |   2.849822     1.0354     2.75   0.008     .7691067    4.930536
  _Istate_14 |  -4.772344   1.917189    -2.49   0.016    -8.625079   -.9196092
  _Istate_15 |   1.303613   .2655448     4.91   0.000     .7699804    1.837245
  _Istate_16 |  -2.681339   1.361055    -1.97   0.054    -5.416481    .0538032
  _Istate_21 |  -9.762945   3.100582    -3.15   0.003     -15.9938   -3.532091
  _Istate_22 |  -6.242395   2.153464    -2.90   0.006    -10.56994   -1.914847
  _Istate_23 |  -7.510515   2.444102    -3.07   0.003    -12.42212   -2.598908
  _Istate_31 |  -7.744285   2.505602    -3.09   0.003    -12.77948   -2.709089
  _Istate_32 |   -4.87763   1.734072    -2.81   0.007    -8.362378   -1.392882
  _Istate_33 |  -7.492198   2.550632    -2.94   0.005    -12.61788   -2.366511
  _Istate_34 |  -6.371955   2.235545    -2.85   0.006    -10.86445   -1.879458
  _Istate_35 |  -4.400083   1.635626    -2.69   0.010    -7.686997   -1.113169
  _Istate_41 |  -3.994645   1.562411    -2.56   0.014    -7.134428   -.8548627
  _Istate_42 |  -2.817718   .9896617    -2.85   0.006    -4.806518   -.8289185
  _Istate_43 |  -4.586503   1.620558    -2.83   0.007    -7.843136    -1.32987
  _Istate_44 |   1.462218   .9807438     1.49   0.142    -.5086608    3.433096
  _Istate_45 |   1.704083   .7746658     2.20   0.033     .1473335    3.260832
  _Istate_46 |  -.2860302   .5769162    -0.50   0.622    -1.445387    .8733263
  _Istate_47 |   -2.07602   .8852931    -2.35   0.023    -3.855083   -.2969569
  _Istate_51 |   2.657931   .5733389     4.64   0.000     1.505763    3.810099
  _Istate_52 |  -4.100778    1.57059    -2.61   0.012    -7.256996   -.9445594
  _Istate_54 |  -5.503702   1.880741    -2.93   0.005    -9.283192   -1.724211
  _Istate_55 |  -.6256865   .5225945    -1.20   0.237    -1.675879    .4245064
  _Istate_56 |  -5.471968   1.873106    -2.92   0.005    -9.236115   -1.707821
  _Istate_57 |  -2.960971   1.202764    -2.46   0.017    -5.378017   -.5439256
  _Istate_58 |   -5.78643   1.856478    -3.12   0.003    -9.517162   -2.055698
  _Istate_59 |  -7.460533    2.50033    -2.98   0.004    -12.48514   -2.435931
  _Istate_61 |  -3.011503    1.16568    -2.58   0.013    -5.354024   -.6689824
  _Istate_62 |  -4.268856   1.587113    -2.69   0.010    -7.458279   -1.079434
  _Istate_63 |  -3.787575   1.229449    -3.08   0.003    -6.258244   -1.316905
  _Istate_64 |  -1.774428   .6846151    -2.59   0.013    -3.150213   -.3986421
  _Istate_71 |  -1.155696   .7367354    -1.57   0.123    -2.636221    .3248291
  _Istate_72 |  -3.519104   1.165816    -3.02   0.004    -5.861898   -1.176309
  _Istate_73 |  -2.058698   .9258561    -2.22   0.031    -3.919276   -.1981209
  _Istate_74 |  -8.420866   2.879676    -2.92   0.005    -14.20779    -2.63394
  _Istate_81 |   2.393588   1.149978     2.08   0.043     .0826204    4.704556
  _Istate_82 |   1.326185   .8265087     1.60   0.115    -.3347463    2.987116
  _Istate_83 |   3.536821   1.164702     3.04   0.004     1.196264    5.877378
  _Istate_84 |  -3.016835   1.220752    -2.47   0.017    -5.470028   -.5636411
  _Istate_85 |   .3393986   .5084065     0.67   0.508    -.6822825     1.36108
  _Istate_86 |  -2.198806   1.267774    -1.73   0.089    -4.746494    .3488818
  _Istate_87 |  -.3687813   .3937136    -0.94   0.354    -1.159978    .4224158
  _Istate_88 |   .6380849   .8048415     0.79   0.432    -.9793047    2.255474
  _Istate_91 |  -4.425484   1.541547    -2.87   0.006    -7.523339   -1.327629
  _Istate_92 |  -2.159928   .9882944    -2.19   0.034     -4.14598   -.1738762
  _Istate_93 |  -10.00841   3.456209    -2.90   0.006    -16.95392   -3.062901
  _Istate_94 |   3.249819   1.361291     2.39   0.021     .5142033    5.985435
  _Istate_95 |   .6683448   .5209057     1.28   0.206    -.3784543    1.715144
       _cons |   -54.7722   14.89972    -3.68   0.001    -84.71431   -24.83008
------------------------------------------------------------------------------

. /*By region*/;
. * New England;
. reg lnths lnemp mico mppa mgfa _Iyear* _Istate* _IstaXt_*  if region==1, clus
> ter(state);

Linear regression                                      Number of obs =     102
                                                       F(  4,     5) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.9852
                                                       Root MSE      =   .2275

                                  (Std. Err. adjusted for 6 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       lnemp |  -.5072295   1.939182    -0.26   0.804    -5.492056    4.477597
        mico |   .1462303    .101875     1.44   0.211    -.1156479    .4081084
        mppa |   .0644461   .0836753     0.77   0.476    -.1506481    .2795403
        mgfa |   .0213788   .1423806     0.15   0.887     -.344622    .3873797
   _Iyear_75 |  (dropped)
   _Iyear_76 |  (dropped)
   _Iyear_80 |   .1550398   .2118101     0.73   0.497    -.3894354     .699515
   _Iyear_81 |   .3889612   .3000187     1.30   0.251    -.3822613    1.160184
   _Iyear_82 |   .4150072    .296622     1.40   0.221    -.3474838    1.177498
   _Iyear_83 |   .3559402   .3093191     1.15   0.302    -.4391899     1.15107
   _Iyear_84 |    .848763   .2708429     3.13   0.026     .1525391    1.544987
   _Iyear_85 |   1.258206   .3213977     3.91   0.011     .4320264    2.084385
   _Iyear_86 |   1.439658   .4414989     3.26   0.022     .3047486    2.574567
   _Iyear_87 |   1.698387   .4864388     3.49   0.017     .4479565    2.948818
   _Iyear_88 |   1.977019     .57017     3.47   0.018     .5113504    3.442688
   _Iyear_89 |    1.99869    .583204     3.43   0.019     .4995159    3.497863
   _Iyear_90 |   2.019041   .5019827     4.02   0.010     .7286536    3.309429
   _Iyear_91 |    1.97591   .4253332     4.65   0.006     .8825558    3.069264
   _Iyear_92 |   2.223692   .5174239     4.30   0.008     .8936116    3.553773
   _Iyear_93 |   2.757736   .6126876     4.50   0.006     1.182772    4.332699
   _Iyear_94 |   3.004415   .6429552     4.67   0.005     1.351646    4.657184
   _Iyear_95 |   3.103993   .6823414     4.55   0.006     1.349979    4.858008
   _Iyear_96 |  (dropped)
   _Iyear_97 |  (dropped)
  _Istate_12 |    .747608   .3028955     2.47   0.057    -.0310097    1.526226
  _Istate_13 |  -1.978402   1.454878    -1.36   0.232    -5.718285     1.76148
  _Istate_14 |   4.829815   3.655318     1.32   0.244    -4.566478    14.22611
  _Istate_15 |   1.467295   .1089846    13.46   0.000     1.187141    1.747449
  _Istate_16 |   3.905726   2.448965     1.59   0.172    -2.389538    10.20099
  _Istate_21 |  (dropped)
  _Istate_22 |  (dropped)
  _Istate_23 |  (dropped)
  _Istate_31 |  (dropped)
  _Istate_32 |  (dropped)
  _Istate_33 |  (dropped)
  _Istate_34 |  (dropped)
  _Istate_35 |  (dropped)
  _Istate_41 |  (dropped)
  _Istate_42 |  (dropped)
  _Istate_43 |  (dropped)
  _Istate_44 |  (dropped)
  _Istate_45 |  (dropped)
  _Istate_46 |  (dropped)
  _Istate_47 |  (dropped)
  _Istate_51 |  (dropped)
  _Istate_52 |  (dropped)
  _Istate_54 |  (dropped)
  _Istate_55 |  (dropped)
  _Istate_56 |  (dropped)
  _Istate_57 |  (dropped)
  _Istate_58 |  (dropped)
  _Istate_59 |  (dropped)
  _Istate_61 |  (dropped)
  _Istate_62 |  (dropped)
  _Istate_63 |  (dropped)
  _Istate_64 |  (dropped)
  _Istate_71 |  (dropped)
  _Istate_72 |  (dropped)
  _Istate_73 |  (dropped)
  _Istate_74 |  (dropped)
  _Istate_81 |  (dropped)
  _Istate_82 |  (dropped)
  _Istate_83 |  (dropped)
  _Istate_84 |  (dropped)
  _Istate_85 |  (dropped)
  _Istate_86 |  (dropped)
  _Istate_87 |  (dropped)
  _Istate_88 |  (dropped)
  _Istate_91 |  (dropped)
  _Istate_92 |  (dropped)
  _Istate_93 |  (dropped)
  _Istate_94 |  (dropped)
  _Istate_95 |  (dropped)
  _IstaXt_12 |  -.0360993   .0115404    -3.13   0.026    -.0657649   -.0064337
  _IstaXt_13 |   .0297559   .0099013     3.01   0.030     .0043037     .055208
  _IstaXt_14 |  -.1286025   .0232615    -5.53   0.003     -.188398    -.068807
  _IstaXt_15 |  -.0693085   .0234403    -2.96   0.032    -.1295638   -.0090532
  _IstaXt_16 |  -.1441895   .0225786    -6.39   0.001    -.2022296   -.0861495
  _IstaXt_21 |  (dropped)
  _IstaXt_22 |  (dropped)
  _IstaXt_23 |  (dropped)
  _IstaXt_31 |  (dropped)
  _IstaXt_32 |  (dropped)
  _IstaXt_33 |  (dropped)
  _IstaXt_34 |  (dropped)
  _IstaXt_35 |  (dropped)
  _IstaXt_41 |  (dropped)
  _IstaXt_42 |  (dropped)
  _IstaXt_43 |  (dropped)
  _IstaXt_44 |  (dropped)
  _IstaXt_45 |  (dropped)
  _IstaXt_46 |  (dropped)
  _IstaXt_47 |  (dropped)
  _IstaXt_51 |  (dropped)
  _IstaXt_52 |  (dropped)
  _IstaXt_54 |  (dropped)
  _IstaXt_55 |  (dropped)
  _IstaXt_56 |  (dropped)
  _IstaXt_57 |  (dropped)
  _IstaXt_58 |  (dropped)
  _IstaXt_59 |  (dropped)
  _IstaXt_61 |  (dropped)
  _IstaXt_62 |  (dropped)
  _IstaXt_63 |  (dropped)
  _IstaXt_64 |  (dropped)
  _IstaXt_71 |  (dropped)
  _IstaXt_72 |  (dropped)
  _IstaXt_73 |  (dropped)
  _IstaXt_74 |  (dropped)
  _IstaXt_81 |  (dropped)
  _IstaXt_82 |  (dropped)
  _IstaXt_83 |  (dropped)
  _IstaXt_84 |  (dropped)
  _IstaXt_85 |  (dropped)
  _IstaXt_86 |  (dropped)
  _IstaXt_87 |  (dropped)
  _IstaXt_88 |  (dropped)
  _IstaXt_91 |  (dropped)
  _IstaXt_92 |  (dropped)
  _IstaXt_93 |  (dropped)
  _IstaXt_94 |  (dropped)
  _IstaXt_95 |  (dropped)
       _cons |   12.44402   25.02284     0.50   0.640    -51.87924    76.76728
------------------------------------------------------------------------------

. * Mid Atlantic;
. reg lnths lnemp mico mppa mgfa _Iyear* _Istate* _IstaXt_*  if region==2, clus
> ter(state);

Linear regression                                      Number of obs =      51
                                                       F(  1,     2) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.9936
                                                       Root MSE      =  .06389

                                  (Std. Err. adjusted for 3 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       lnemp |   2.234513   .0735357    30.39   0.001     1.918115    2.550912
        mico |  -9.34e-06   .0644943    -0.00   1.000     -.277506    .2774873
        mppa |   .1379946   .0243848     5.66   0.030     .0330753    .2429139
        mgfa |  (dropped)
   _Iyear_75 |  (dropped)
   _Iyear_76 |  (dropped)
   _Iyear_80 |  -.0966538   .0213483    -4.53   0.045     -.188508   -.0047995
   _Iyear_81 |  -.2002355   .0645441    -3.10   0.090    -.4779463    .0774754
   _Iyear_82 |  -.2146379   .0238935    -8.98   0.012    -.3174434   -.1118323
   _Iyear_83 |   -.283532   .0797673    -3.55   0.071    -.6267432    .0596792
   _Iyear_84 |  -.1215746    .031439    -3.87   0.061    -.2568458    .0136965
   _Iyear_85 |  -.1252165   .0248007    -5.05   0.037    -.2319252   -.0185078
   _Iyear_86 |  -.1919624   .0137095   -14.00   0.005    -.2509496   -.1329752
   _Iyear_87 |  -.1354925    .042714    -3.17   0.087    -.3192759     .048291
   _Iyear_88 |  -.0922839   .0566133    -1.63   0.245    -.3358712    .1513035
   _Iyear_89 |  -.1596168   .0803682    -1.99   0.185    -.5054134    .1861798
   _Iyear_90 |  -.2404716   .0944022    -2.55   0.126    -.6466515    .1657083
   _Iyear_91 |  -.2719942   .1036693    -2.62   0.120     -.718047    .1740586
   _Iyear_92 |  -.2111281   .1035128    -2.04   0.178    -.6565079    .2342517
   _Iyear_93 |  -.0172484   .0591995    -0.29   0.798    -.2719635    .2374667
   _Iyear_94 |  -.0057508    .026849    -0.21   0.850    -.1212725    .1097709
   _Iyear_95 |  (dropped)
   _Iyear_96 |  (dropped)
   _Iyear_97 |  (dropped)
  _Istate_12 |  (dropped)
  _Istate_13 |  (dropped)
  _Istate_14 |  (dropped)
  _Istate_15 |  (dropped)
  _Istate_16 |  (dropped)
  _Istate_21 |   .2129524   .0096655    22.03   0.002     .1713651    .2545397
  _Istate_22 |   .8810143   .0304842    28.90   0.001     .7498515    1.012177
  _Istate_23 |  (dropped)
  _Istate_31 |  (dropped)
  _Istate_32 |  (dropped)
  _Istate_33 |  (dropped)
  _Istate_34 |  (dropped)
  _Istate_35 |  (dropped)
  _Istate_41 |  (dropped)
  _Istate_42 |  (dropped)
  _Istate_43 |  (dropped)
  _Istate_44 |  (dropped)
  _Istate_45 |  (dropped)
  _Istate_46 |  (dropped)
  _Istate_47 |  (dropped)
  _Istate_51 |  (dropped)
  _Istate_52 |  (dropped)
  _Istate_54 |  (dropped)
  _Istate_55 |  (dropped)
  _Istate_56 |  (dropped)
  _Istate_57 |  (dropped)
  _Istate_58 |  (dropped)
  _Istate_59 |  (dropped)
  _Istate_61 |  (dropped)
  _Istate_62 |  (dropped)
  _Istate_63 |  (dropped)
  _Istate_64 |  (dropped)
  _Istate_71 |  (dropped)
  _Istate_72 |  (dropped)
  _Istate_73 |  (dropped)
  _Istate_74 |  (dropped)
  _Istate_81 |  (dropped)
  _Istate_82 |  (dropped)
  _Istate_83 |  (dropped)
  _Istate_84 |  (dropped)
  _Istate_85 |  (dropped)
  _Istate_86 |  (dropped)
  _Istate_87 |  (dropped)
  _Istate_88 |  (dropped)
  _Istate_91 |  (dropped)
  _Istate_92 |  (dropped)
  _Istate_93 |  (dropped)
  _Istate_94 |  (dropped)
  _Istate_95 |  (dropped)
  _IstaXt_12 |  (dropped)
  _IstaXt_13 |  (dropped)
  _IstaXt_14 |  (dropped)
  _IstaXt_15 |  (dropped)
  _IstaXt_16 |  (dropped)
  _IstaXt_21 |   .0389519   .0056854     6.85   0.021     .0144896    .0634141
  _IstaXt_22 |   .0431086   .0065457     6.59   0.022     .0149447    .0712725
  _IstaXt_23 |   .0671957   .0061787    10.88   0.008      .040611    .0937804
  _IstaXt_31 |  (dropped)
  _IstaXt_32 |  (dropped)
  _IstaXt_33 |  (dropped)
  _IstaXt_34 |  (dropped)
  _IstaXt_35 |  (dropped)
  _IstaXt_41 |  (dropped)
  _IstaXt_42 |  (dropped)
  _IstaXt_43 |  (dropped)
  _IstaXt_44 |  (dropped)
  _IstaXt_45 |  (dropped)
  _IstaXt_46 |  (dropped)
  _IstaXt_47 |  (dropped)
  _IstaXt_51 |  (dropped)
  _IstaXt_52 |  (dropped)
  _IstaXt_54 |  (dropped)
  _IstaXt_55 |  (dropped)
  _IstaXt_56 |  (dropped)
  _IstaXt_57 |  (dropped)
  _IstaXt_58 |  (dropped)
  _IstaXt_59 |  (dropped)
  _IstaXt_61 |  (dropped)
  _IstaXt_62 |  (dropped)
  _IstaXt_63 |  (dropped)
  _IstaXt_64 |  (dropped)
  _IstaXt_71 |  (dropped)
  _IstaXt_72 |  (dropped)
  _IstaXt_73 |  (dropped)
  _IstaXt_74 |  (dropped)
  _IstaXt_81 |  (dropped)
  _IstaXt_82 |  (dropped)
  _IstaXt_83 |  (dropped)
  _IstaXt_84 |  (dropped)
  _IstaXt_85 |  (dropped)
  _IstaXt_86 |  (dropped)
  _IstaXt_87 |  (dropped)
  _IstaXt_88 |  (dropped)
  _IstaXt_91 |  (dropped)
  _IstaXt_92 |  (dropped)
  _IstaXt_93 |  (dropped)
  _IstaXt_94 |  (dropped)
  _IstaXt_95 |  (dropped)
       _cons |  -24.65997   1.126268   -21.90   0.002    -29.50591   -19.81403
------------------------------------------------------------------------------

. * East North Central;
. reg lnths lnemp mico mppa mgfa _Iyear* _Istate* _IstaXt_*  if region==3, clus
> ter(state);

Linear regression                                      Number of obs =      85
                                                       F(  3,     4) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.9844
                                                       Root MSE      =  .12597

                                  (Std. Err. adjusted for 5 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       lnemp |   5.538584   2.474632     2.24   0.089    -1.332095    12.40926
        mico |   .1656681   .1099581     1.51   0.206    -.1396246    .4709607
        mppa |  -.1113037   .1630462    -0.68   0.532    -.5639925    .3413851
        mgfa |  (dropped)
   _Iyear_75 |  (dropped)
   _Iyear_76 |  (dropped)
   _Iyear_80 |   .0008002    .191424     0.00   0.997     -.530678    .5322784
   _Iyear_81 |  -.1194745   .1292698    -0.92   0.408    -.4783849     .239436
   _Iyear_82 |    .032215   .2806449     0.11   0.914    -.7469802    .8114102
   _Iyear_83 |  -.0121783   .3257966    -0.04   0.972    -.9167348    .8923782
   _Iyear_84 |   .1839112   .2951837     0.62   0.567    -.6356501    1.003473
   _Iyear_85 |   .2836305   .3040875     0.93   0.404    -.5606517    1.127913
   _Iyear_86 |   .2439885   .2382679     1.02   0.364    -.4175491    .9055262
   _Iyear_87 |   .0973203    .172622     0.56   0.603    -.3819552    .5765958
   _Iyear_88 |   .2122191   .1226093     1.73   0.159     -.128199    .5526372
   _Iyear_89 |   .0450514   .0908935     0.50   0.646    -.2073095    .2974123
   _Iyear_90 |  -.0783927    .051631    -1.52   0.204    -.2217434    .0649579
   _Iyear_91 |  -.0696204   .0412048    -1.69   0.166    -.1840234    .0447825
   _Iyear_92 |  -.0097238   .0582497    -0.17   0.876     -.171451    .1520033
   _Iyear_93 |   .1058969   .0670366     1.58   0.189    -.0802264    .2920202
   _Iyear_94 |   .0780573   .0361896     2.16   0.097    -.0224212    .1785359
   _Iyear_95 |  (dropped)
   _Iyear_96 |  (dropped)
   _Iyear_97 |  (dropped)
  _Istate_12 |  (dropped)
  _Istate_13 |  (dropped)
  _Istate_14 |  (dropped)
  _Istate_15 |  (dropped)
  _Istate_16 |  (dropped)
  _Istate_21 |  (dropped)
  _Istate_22 |  (dropped)
  _Istate_23 |  (dropped)
  _Istate_31 |  (dropped)
  _Istate_32 |    3.12943   1.931365     1.62   0.180    -2.232898    8.491758
  _Istate_33 |  -.3050558   .2653759    -1.15   0.314    -1.041858     .431746
  _Istate_34 |   1.194711   .6455088     1.85   0.138    -.5975092     2.98693
  _Istate_35 |   4.145086   2.147327     1.93   0.126    -1.816848    10.10702
  _Istate_41 |  (dropped)
  _Istate_42 |  (dropped)
  _Istate_43 |  (dropped)
  _Istate_44 |  (dropped)
  _Istate_45 |  (dropped)
  _Istate_46 |  (dropped)
  _Istate_47 |  (dropped)
  _Istate_51 |  (dropped)
  _Istate_52 |  (dropped)
  _Istate_54 |  (dropped)
  _Istate_55 |  (dropped)
  _Istate_56 |  (dropped)
  _Istate_57 |  (dropped)
  _Istate_58 |  (dropped)
  _Istate_59 |  (dropped)
  _Istate_61 |  (dropped)
  _Istate_62 |  (dropped)
  _Istate_63 |  (dropped)
  _Istate_64 |  (dropped)
  _Istate_71 |  (dropped)
  _Istate_72 |  (dropped)
  _Istate_73 |  (dropped)
  _Istate_74 |  (dropped)
  _Istate_81 |  (dropped)
  _Istate_82 |  (dropped)
  _Istate_83 |  (dropped)
  _Istate_84 |  (dropped)
  _Istate_85 |  (dropped)
  _Istate_86 |  (dropped)
  _Istate_87 |  (dropped)
  _Istate_88 |  (dropped)
  _Istate_91 |  (dropped)
  _Istate_92 |  (dropped)
  _Istate_93 |  (dropped)
  _Istate_94 |  (dropped)
  _Istate_95 |  (dropped)
  _IstaXt_12 |  (dropped)
  _IstaXt_13 |  (dropped)
  _IstaXt_14 |  (dropped)
  _IstaXt_15 |  (dropped)
  _IstaXt_16 |  (dropped)
  _IstaXt_21 |  (dropped)
  _IstaXt_22 |  (dropped)
  _IstaXt_23 |  (dropped)
  _IstaXt_31 |   .0567815   .0240971     2.36   0.078    -.0101226    .1236856
  _IstaXt_32 |   .0349665   .0413278     0.85   0.445    -.0797778    .1497109
  _IstaXt_33 |   .0653348   .0147937     4.42   0.012     .0242608    .1064088
  _IstaXt_34 |   .0496274   .0263517     1.88   0.133    -.0235366    .1227913
  _IstaXt_35 |  -.0099622   .0418036    -0.24   0.823    -.1260276    .1061031
  _IstaXt_41 |  (dropped)
  _IstaXt_42 |  (dropped)
  _IstaXt_43 |  (dropped)
  _IstaXt_44 |  (dropped)
  _IstaXt_45 |  (dropped)
  _IstaXt_46 |  (dropped)
  _IstaXt_47 |  (dropped)
  _IstaXt_51 |  (dropped)
  _IstaXt_52 |  (dropped)
  _IstaXt_54 |  (dropped)
  _IstaXt_55 |  (dropped)
  _IstaXt_56 |  (dropped)
  _IstaXt_57 |  (dropped)
  _IstaXt_58 |  (dropped)
  _IstaXt_59 |  (dropped)
  _IstaXt_61 |  (dropped)
  _IstaXt_62 |  (dropped)
  _IstaXt_63 |  (dropped)
  _IstaXt_64 |  (dropped)
  _IstaXt_71 |  (dropped)
  _IstaXt_72 |  (dropped)
  _IstaXt_73 |  (dropped)
  _IstaXt_74 |  (dropped)
  _IstaXt_81 |  (dropped)
  _IstaXt_82 |  (dropped)
  _IstaXt_83 |  (dropped)
  _IstaXt_84 |  (dropped)
  _IstaXt_85 |  (dropped)
  _IstaXt_86 |  (dropped)
  _IstaXt_87 |  (dropped)
  _IstaXt_88 |  (dropped)
  _IstaXt_91 |  (dropped)
  _IstaXt_92 |  (dropped)
  _IstaXt_93 |  (dropped)
  _IstaXt_94 |  (dropped)
  _IstaXt_95 |  (dropped)
       _cons |  -75.14248   37.92077    -1.98   0.119    -180.4274    30.14245
------------------------------------------------------------------------------

. * West North Central;
. reg lnths lnemp mico mppa mgfa _Iyear* _Istate* _IstaXt_*  if region==4, clus
> ter(state);

Linear regression                                      Number of obs =     119
                                                       F(  5,     6) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.9824
                                                       Root MSE      =  .25899

                                  (Std. Err. adjusted for 7 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       lnemp |  -3.100128   2.713426    -1.14   0.297    -9.739642    3.539385
        mico |   .1164018   .1216565     0.96   0.376     -.181281    .4140846
        mppa |  -.0661367   .2518158    -0.26   0.802    -.6823078    .5500343
        mgfa |  (dropped)
   _Iyear_75 |  (dropped)
   _Iyear_76 |  (dropped)
   _Iyear_80 |  -.3082289   .1804113    -1.71   0.138    -.7496794    .1332216
   _Iyear_81 |  -.7732309   .2420725    -3.19   0.019    -1.365561   -.1809007
   _Iyear_82 |  -.9197908   .3132363    -2.94   0.026    -1.686252   -.1533293
   _Iyear_83 |  -1.071662   .2458512    -4.36   0.005    -1.673238   -.4700854
   _Iyear_84 |  -.7440046   .2683389    -2.77   0.032    -1.400606   -.0874031
   _Iyear_85 |  -.5494681   .1636625    -3.36   0.015    -.9499358   -.1490004
   _Iyear_86 |  -.5742168   .2356814    -2.44   0.051    -1.150908    .0024748
   _Iyear_87 |  -.5165973    .213676    -2.42   0.052    -1.039444     .006249
   _Iyear_88 |  -.2590472   .1470505    -1.76   0.129    -.6188668    .1007725
   _Iyear_89 |  -.2021226   .1395423    -1.45   0.198    -.5435703    .1393251
   _Iyear_90 |   -.403469   .1472549    -2.74   0.034    -.7637887   -.0431493
   _Iyear_91 |  -.4789047   .1963484    -2.44   0.051     -.959352    .0015426
   _Iyear_92 |  -.3496824    .193848    -1.80   0.121    -.8240114    .1246465
   _Iyear_93 |  -.1966068   .1472883    -1.33   0.230    -.5570082    .1637946
   _Iyear_94 |   .0087469   .0401766     0.22   0.835    -.0895617    .1070554
   _Iyear_95 |  (dropped)
   _Iyear_96 |  (dropped)
   _Iyear_97 |  (dropped)
  _Istate_12 |  (dropped)
  _Istate_13 |  (dropped)
  _Istate_14 |  (dropped)
  _Istate_15 |  (dropped)
  _Istate_16 |  (dropped)
  _Istate_21 |  (dropped)
  _Istate_22 |  (dropped)
  _Istate_23 |  (dropped)
  _Istate_31 |  (dropped)
  _Istate_32 |  (dropped)
  _Istate_33 |  (dropped)
  _Istate_34 |  (dropped)
  _Istate_35 |  (dropped)
  _Istate_41 |   10.43363   5.516428     1.89   0.107    -3.064582    23.93185
  _Istate_42 |   7.345658   4.249309     1.73   0.135    -3.052026    17.74334
  _Istate_43 |   10.46043   5.891367     1.78   0.126    -3.955225    24.87609
  _Istate_44 |  -.4027086   .2462406    -1.64   0.153    -1.005238    .1998204
  _Istate_45 |  (dropped)
  _Istate_46 |   5.202266   2.702486     1.92   0.103     -1.41048    11.81501
  _Istate_47 |   6.315184   3.963963     1.59   0.162    -3.384283    16.01465
  _Istate_51 |  (dropped)
  _Istate_52 |  (dropped)
  _Istate_54 |  (dropped)
  _Istate_55 |  (dropped)
  _Istate_56 |  (dropped)
  _Istate_57 |  (dropped)
  _Istate_58 |  (dropped)
  _Istate_59 |  (dropped)
  _Istate_61 |  (dropped)
  _Istate_62 |  (dropped)
  _Istate_63 |  (dropped)
  _Istate_64 |  (dropped)
  _Istate_71 |  (dropped)
  _Istate_72 |  (dropped)
  _Istate_73 |  (dropped)
  _Istate_74 |  (dropped)
  _Istate_81 |  (dropped)
  _Istate_82 |  (dropped)
  _Istate_83 |  (dropped)
  _Istate_84 |  (dropped)
  _Istate_85 |  (dropped)
  _Istate_86 |  (dropped)
  _Istate_87 |  (dropped)
  _Istate_88 |  (dropped)
  _Istate_91 |  (dropped)
  _Istate_92 |  (dropped)
  _Istate_93 |  (dropped)
  _Istate_94 |  (dropped)
  _Istate_95 |  (dropped)
  _IstaXt_12 |  (dropped)
  _IstaXt_13 |  (dropped)
  _IstaXt_14 |  (dropped)
  _IstaXt_15 |  (dropped)
  _IstaXt_16 |  (dropped)
  _IstaXt_21 |  (dropped)
  _IstaXt_22 |  (dropped)
  _IstaXt_23 |  (dropped)
  _IstaXt_31 |  (dropped)
  _IstaXt_32 |  (dropped)
  _IstaXt_33 |  (dropped)
  _IstaXt_34 |  (dropped)
  _IstaXt_35 |  (dropped)
  _IstaXt_41 |   .1268894   .0637987     1.99   0.094    -.0292204    .2829992
  _IstaXt_42 |   .1315166    .045575     2.89   0.028     .0199985    .2430347
  _IstaXt_43 |   .1354312   .0549305     2.47   0.049     .0010212    .2698413
  _IstaXt_44 |   .1563293   .0400512     3.90   0.008     .0583275    .2543312
  _IstaXt_45 |   .1973524   .0741421     2.66   0.037     .0159332    .3787716
  _IstaXt_46 |   .1718404   .0567074     3.03   0.023     .0330824    .3105985
  _IstaXt_47 |   .1980649   .0437824     4.52   0.004     .0909333    .3051965
  _IstaXt_51 |  (dropped)
  _IstaXt_52 |  (dropped)
  _IstaXt_54 |  (dropped)
  _IstaXt_55 |  (dropped)
  _IstaXt_56 |  (dropped)
  _IstaXt_57 |  (dropped)
  _IstaXt_58 |  (dropped)
  _IstaXt_59 |  (dropped)
  _IstaXt_61 |  (dropped)
  _IstaXt_62 |  (dropped)
  _IstaXt_63 |  (dropped)
  _IstaXt_64 |  (dropped)
  _IstaXt_71 |  (dropped)
  _IstaXt_72 |  (dropped)
  _IstaXt_73 |  (dropped)
  _IstaXt_74 |  (dropped)
  _IstaXt_81 |  (dropped)
  _IstaXt_82 |  (dropped)
  _IstaXt_83 |  (dropped)
  _IstaXt_84 |  (dropped)
  _IstaXt_85 |  (dropped)
  _IstaXt_86 |  (dropped)
  _IstaXt_87 |  (dropped)
  _IstaXt_88 |  (dropped)
  _IstaXt_91 |  (dropped)
  _IstaXt_92 |  (dropped)
  _IstaXt_93 |  (dropped)
  _IstaXt_94 |  (dropped)
  _IstaXt_95 |  (dropped)
       _cons |   43.57096   33.44913     1.30   0.240    -38.27611     125.418
------------------------------------------------------------------------------

. * South Atlantic;
. reg lnths lnemp mico mppa mgfa _Iyear* _Istate* _IstaXt_*  if region==5, clus
> ter(state);

Linear regression                                      Number of obs =     136
                                                       F(  6,     7) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.9930
                                                       Root MSE      =  .12462

                                  (Std. Err. adjusted for 8 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       lnemp |   1.335784   .9367928     1.43   0.197    -.8793788    3.550947
        mico |   .1544752   .0713989     2.16   0.067    -.0143564    .3233068
        mppa |   .0478838   .1104004     0.43   0.678    -.2131715    .3089392
        mgfa |  -.3926422   .0828444    -4.74   0.002    -.5885381   -.1967463
   _Iyear_75 |  (dropped)
   _Iyear_76 |  (dropped)
   _Iyear_80 |  -.1239914   .0417377    -2.97   0.021    -.2226854   -.0252974
   _Iyear_81 |  -.1904111   .0777952    -2.45   0.044    -.3743674   -.0064548
   _Iyear_82 |   -.263081   .0904507    -2.91   0.023    -.4769629    -.049199
   _Iyear_83 |  -.3956156   .0972558    -4.07   0.005    -.6255891   -.1656421
   _Iyear_84 |  -.1832376   .0900607    -2.03   0.081    -.3961972     .029722
   _Iyear_85 |  -.0619855   .0797388    -0.78   0.462    -.2505377    .1265667
   _Iyear_86 |  -.1623647   .1023542    -1.59   0.157    -.4043939    .0796646
   _Iyear_87 |  -.1424594   .1007507    -1.41   0.200    -.3806969    .0957781
   _Iyear_88 |  -.0243443   .0817262    -0.30   0.774    -.2175961    .1689074
   _Iyear_89 |  -.0437521   .0513067    -0.85   0.422    -.1650732    .0775691
   _Iyear_90 |  -.1008563   .0471851    -2.14   0.070    -.2124313    .0107188
   _Iyear_91 |  -.2579358   .0459655    -5.61   0.001    -.3666269   -.1492446
   _Iyear_92 |  -.1348579   .0729885    -1.85   0.107    -.3074484    .0377326
   _Iyear_93 |  -.0610127   .0385023    -1.58   0.157    -.1520561    .0300307
   _Iyear_94 |  -.0362723   .0312915    -1.16   0.284    -.1102649    .0377203
   _Iyear_95 |  (dropped)
   _Iyear_96 |  (dropped)
   _Iyear_97 |  (dropped)
  _Istate_12 |  (dropped)
  _Istate_13 |  (dropped)
  _Istate_14 |  (dropped)
  _Istate_15 |  (dropped)
  _Istate_16 |  (dropped)
  _Istate_21 |  (dropped)
  _Istate_22 |  (dropped)
  _Istate_23 |  (dropped)
  _Istate_31 |  (dropped)
  _Istate_32 |  (dropped)
  _Istate_33 |  (dropped)
  _Istate_34 |  (dropped)
  _Istate_35 |  (dropped)
  _Istate_41 |  (dropped)
  _Istate_42 |  (dropped)
  _Istate_43 |  (dropped)
  _Istate_44 |  (dropped)
  _Istate_45 |  (dropped)
  _Istate_46 |  (dropped)
  _Istate_47 |  (dropped)
  _Istate_51 |  (dropped)
  _Istate_52 |  -.9836101   1.805747    -0.54   0.603    -5.253524    3.286304
  _Istate_54 |  -1.331283   2.007804    -0.66   0.529    -6.078985    3.416418
  _Istate_55 |  -1.826437   .8688427    -2.10   0.074    -3.880924    .2280493
  _Istate_56 |  -1.968652   2.087877    -0.94   0.377    -6.905697    2.968393
  _Istate_57 |  -1.844333    1.43284    -1.29   0.239    -5.232461    1.543795
  _Istate_58 |  -1.242699   2.008012    -0.62   0.556    -5.990893    3.505495
  _Istate_59 |  -1.255286   2.477027    -0.51   0.628    -7.112524    4.601953
  _Istate_61 |  (dropped)
  _Istate_62 |  (dropped)
  _Istate_63 |  (dropped)
  _Istate_64 |  (dropped)
  _Istate_71 |  (dropped)
  _Istate_72 |  (dropped)
  _Istate_73 |  (dropped)
  _Istate_74 |  (dropped)
  _Istate_81 |  (dropped)
  _Istate_82 |  (dropped)
  _Istate_83 |  (dropped)
  _Istate_84 |  (dropped)
  _Istate_85 |  (dropped)
  _Istate_86 |  (dropped)
  _Istate_87 |  (dropped)
  _Istate_88 |  (dropped)
  _Istate_91 |  (dropped)
  _Istate_92 |  (dropped)
  _Istate_93 |  (dropped)
  _Istate_94 |  (dropped)
  _Istate_95 |  (dropped)
  _IstaXt_12 |  (dropped)
  _IstaXt_13 |  (dropped)
  _IstaXt_14 |  (dropped)
  _IstaXt_15 |  (dropped)
  _IstaXt_16 |  (dropped)
  _IstaXt_21 |  (dropped)
  _IstaXt_22 |  (dropped)
  _IstaXt_23 |  (dropped)
  _IstaXt_31 |  (dropped)
  _IstaXt_32 |  (dropped)
  _IstaXt_33 |  (dropped)
  _IstaXt_34 |  (dropped)
  _IstaXt_35 |  (dropped)
  _IstaXt_41 |  (dropped)
  _IstaXt_42 |  (dropped)
  _IstaXt_43 |  (dropped)
  _IstaXt_44 |  (dropped)
  _IstaXt_45 |  (dropped)
  _IstaXt_46 |  (dropped)
  _IstaXt_47 |  (dropped)
  _IstaXt_51 |   .0787621   .0264132     2.98   0.020     .0163047    .1412194
  _IstaXt_52 |   .0570279   .0197294     2.89   0.023     .0103752    .1036806
  _IstaXt_54 |   .0705371   .0271568     2.60   0.036     .0063214    .1347527
  _IstaXt_55 |   .0830306   .0079458    10.45   0.000     .0642418    .1018194
  _IstaXt_56 |   .1408601   .0250429     5.62   0.001      .081643    .2000772
  _IstaXt_57 |   .1483695   .0266269     5.57   0.001      .085407    .2113321
  _IstaXt_58 |   .1038541   .0262966     3.95   0.006     .0416726    .1660357
  _IstaXt_59 |    .125201   .0316143     3.96   0.005     .0504451    .1999569
  _IstaXt_61 |  (dropped)
  _IstaXt_62 |  (dropped)
  _IstaXt_63 |  (dropped)
  _IstaXt_64 |  (dropped)
  _IstaXt_71 |  (dropped)
  _IstaXt_72 |  (dropped)
  _IstaXt_73 |  (dropped)
  _IstaXt_74 |  (dropped)
  _IstaXt_81 |  (dropped)
  _IstaXt_82 |  (dropped)
  _IstaXt_83 |  (dropped)
  _IstaXt_84 |  (dropped)
  _IstaXt_85 |  (dropped)
  _IstaXt_86 |  (dropped)
  _IstaXt_87 |  (dropped)
  _IstaXt_88 |  (dropped)
  _IstaXt_91 |  (dropped)
  _IstaXt_92 |  (dropped)
  _IstaXt_93 |  (dropped)
  _IstaXt_94 |  (dropped)
  _IstaXt_95 |  (dropped)
       _cons |  -9.318611   11.64514    -0.80   0.450    -36.85499    18.21776
------------------------------------------------------------------------------

. * East South Central;
. reg lnths lnemp mico mppa mgfa _Iyear* _Istate* _IstaXt_*  if region==6, clus
> ter(state);

Linear regression                                      Number of obs =      68
                                                       F(  2,     3) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.9903
                                                       Root MSE      =  .15952

                                  (Std. Err. adjusted for 4 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       lnemp |   1.578617   3.363658     0.47   0.671    -9.126043    12.28328
        mico |   .0094555   .0887627     0.11   0.922     -.273027     .291938
        mppa |   .1787295   .0719391     2.48   0.089    -.0502129     .407672
        mgfa |  -.1774786   .1394997    -1.27   0.293    -.6214289    .2664718
   _Iyear_75 |  (dropped)
   _Iyear_76 |  (dropped)
   _Iyear_80 |   .0368876   .0975336     0.38   0.730    -.2735079    .3472831
   _Iyear_81 |  -.2149192   .1319773    -1.63   0.202    -.6349299    .2050916
   _Iyear_82 |   -.101358   .2208767    -0.46   0.678    -.8042861    .6015702
   _Iyear_83 |  -.0924328   .3334674    -0.28   0.800    -1.153675    .9688094
   _Iyear_84 |   .0077939   .1671396     0.05   0.966    -.5241189    .5397067
   _Iyear_85 |   .1093059   .1491571     0.73   0.517    -.3653786    .5839903
   _Iyear_86 |   .0672994   .3288066     0.20   0.851    -.9791099    1.113709
   _Iyear_87 |  -.1420526   .1450918    -0.98   0.400    -.6037995    .3196943
   _Iyear_88 |   .1084675   .1582728     0.69   0.542    -.3952273    .6121623
   _Iyear_89 |   .0559766   .1168945     0.48   0.665     -.316034    .4279872
   _Iyear_90 |   .1465448   .1189089     1.23   0.306    -.2318763    .5249659
   _Iyear_91 |   .1121376   .2020195     0.56   0.618    -.5307788    .7550539
   _Iyear_92 |   .1430702   .1295586     1.10   0.350     -.269243    .5553834
   _Iyear_93 |   .1147338    .109161     1.05   0.370    -.2326652    .4621328
   _Iyear_94 |   .0304385   .0687006     0.44   0.688    -.1881974    .2490744
   _Iyear_95 |  (dropped)
   _Iyear_96 |  (dropped)
   _Iyear_97 |  (dropped)
  _Istate_12 |  (dropped)
  _Istate_13 |  (dropped)
  _Istate_14 |  (dropped)
  _Istate_15 |  (dropped)
  _Istate_16 |  (dropped)
  _Istate_21 |  (dropped)
  _Istate_22 |  (dropped)
  _Istate_23 |  (dropped)
  _Istate_31 |  (dropped)
  _Istate_32 |  (dropped)
  _Istate_33 |  (dropped)
  _Istate_34 |  (dropped)
  _Istate_35 |  (dropped)
  _Istate_41 |  (dropped)
  _Istate_42 |  (dropped)
  _Istate_43 |  (dropped)
  _Istate_44 |  (dropped)
  _Istate_45 |  (dropped)
  _Istate_46 |  (dropped)
  _Istate_47 |  (dropped)
  _Istate_51 |  (dropped)
  _Istate_52 |  (dropped)
  _Istate_54 |  (dropped)
  _Istate_55 |  (dropped)
  _Istate_56 |  (dropped)
  _Istate_57 |  (dropped)
  _Istate_58 |  (dropped)
  _Istate_59 |  (dropped)
  _Istate_61 |   .6804288   .4217938     1.61   0.205    -.6619074    2.022765
  _Istate_62 |   .5566754   .8633418     0.64   0.565    -2.190863    3.304214
  _Istate_63 |  (dropped)
  _Istate_64 |  -1.033205    1.69021    -0.61   0.584    -6.412206    4.345797
  _Istate_71 |  (dropped)
  _Istate_72 |  (dropped)
  _Istate_73 |  (dropped)
  _Istate_74 |  (dropped)
  _Istate_81 |  (dropped)
  _Istate_82 |  (dropped)
  _Istate_83 |  (dropped)
  _Istate_84 |  (dropped)
  _Istate_85 |  (dropped)
  _Istate_86 |  (dropped)
  _Istate_87 |  (dropped)
  _Istate_88 |  (dropped)
  _Istate_91 |  (dropped)
  _Istate_92 |  (dropped)
  _Istate_93 |  (dropped)
  _Istate_94 |  (dropped)
  _Istate_95 |  (dropped)
  _IstaXt_12 |  (dropped)
  _IstaXt_13 |  (dropped)
  _IstaXt_14 |  (dropped)
  _IstaXt_15 |  (dropped)
  _IstaXt_16 |  (dropped)
  _IstaXt_21 |  (dropped)
  _IstaXt_22 |  (dropped)
  _IstaXt_23 |  (dropped)
  _IstaXt_31 |  (dropped)
  _IstaXt_32 |  (dropped)
  _IstaXt_33 |  (dropped)
  _IstaXt_34 |  (dropped)
  _IstaXt_35 |  (dropped)
  _IstaXt_41 |  (dropped)
  _IstaXt_42 |  (dropped)
  _IstaXt_43 |  (dropped)
  _IstaXt_44 |  (dropped)
  _IstaXt_45 |  (dropped)
  _IstaXt_46 |  (dropped)
  _IstaXt_47 |  (dropped)
  _IstaXt_51 |  (dropped)
  _IstaXt_52 |  (dropped)
  _IstaXt_54 |  (dropped)
  _IstaXt_55 |  (dropped)
  _IstaXt_56 |  (dropped)
  _IstaXt_57 |  (dropped)
  _IstaXt_58 |  (dropped)
  _IstaXt_59 |  (dropped)
  _IstaXt_61 |    .102308   .0749271     1.37   0.265    -.1361435    .3407594
  _IstaXt_62 |   .1188801   .0820774     1.45   0.243    -.1423267    .3800869
  _IstaXt_63 |   .1677028   .0671722     2.50   0.088    -.0460691    .3814747
  _IstaXt_64 |   .2177227   .0565419     3.85   0.031     .0377813    .3976641
  _IstaXt_71 |  (dropped)
  _IstaXt_72 |  (dropped)
  _IstaXt_73 |  (dropped)
  _IstaXt_74 |  (dropped)
  _IstaXt_81 |  (dropped)
  _IstaXt_82 |  (dropped)
  _IstaXt_83 |  (dropped)
  _IstaXt_84 |  (dropped)
  _IstaXt_85 |  (dropped)
  _IstaXt_86 |  (dropped)
  _IstaXt_87 |  (dropped)
  _IstaXt_88 |  (dropped)
  _IstaXt_91 |  (dropped)
  _IstaXt_92 |  (dropped)
  _IstaXt_93 |  (dropped)
  _IstaXt_94 |  (dropped)
  _IstaXt_95 |  (dropped)
       _cons |  -15.15603   47.34918    -0.32   0.770    -165.8422    135.5302
------------------------------------------------------------------------------

. * West South Central;
. reg lnths lnemp mico mppa mgfa _Iyear* _Istate* _IstaXt_*  if region==7, clus
> ter(state);

Linear regression                                      Number of obs =      68
                                                       F(  2,     3) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.9921
                                                       Root MSE      =  .14374

                                  (Std. Err. adjusted for 4 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       lnemp |   2.192407   .7657347     2.86   0.064    -.2445022    4.629317
        mico |   .0766606   .1367083     0.56   0.614    -.3584062    .5117274
        mppa |  -.1488383   .0945394    -1.57   0.213    -.4497049    .1520283
        mgfa |   .2476954   .1722377     1.44   0.246    -.3004417    .7958325
   _Iyear_75 |  (dropped)
   _Iyear_76 |  (dropped)
   _Iyear_80 |  -.2294206   .1395313    -1.64   0.199    -.6734715    .2146302
   _Iyear_81 |  -.1859345    .140978    -1.32   0.279    -.6345896    .2627205
   _Iyear_82 |    -.41735   .0835174    -5.00   0.015    -.6831398   -.1515602
   _Iyear_83 |  -.4506853   .1013233    -4.45   0.021    -.7731411   -.1282295
   _Iyear_84 |  -.4376444   .0607213    -7.21   0.006    -.6308868    -.244402
   _Iyear_85 |  -.4228489     .16802    -2.52   0.086    -.9575635    .1118658
   _Iyear_86 |  -.3754568   .0804088    -4.67   0.019    -.6313535     -.11956
   _Iyear_87 |  -.4871331   .0742651    -6.56   0.007    -.7234779   -.2507884
   _Iyear_88 |  -.0940012   .1755331    -0.54   0.629    -.6526258    .4646233
   _Iyear_89 |   .0326168   .2019331     0.16   0.882    -.6100243    .6752579
   _Iyear_90 |   .0406684   .1861389     0.22   0.841    -.5517086    .6330453
   _Iyear_91 |   .1782538   .1087384     1.64   0.200    -.1678005     .524308
   _Iyear_92 |   .1400306   .0804787     1.74   0.180    -.1160884    .3961497
   _Iyear_93 |   .1277161   .0241561     5.29   0.013     .0508406    .2045916
   _Iyear_94 |    .046651    .029286     1.59   0.209      -.04655    .1398521
   _Iyear_95 |  (dropped)
   _Iyear_96 |  (dropped)
   _Iyear_97 |  (dropped)
  _Istate_12 |  (dropped)
  _Istate_13 |  (dropped)
  _Istate_14 |  (dropped)
  _Istate_15 |  (dropped)
  _Istate_16 |  (dropped)
  _Istate_21 |  (dropped)
  _Istate_22 |  (dropped)
  _Istate_23 |  (dropped)
  _Istate_31 |  (dropped)
  _Istate_32 |  (dropped)
  _Istate_33 |  (dropped)
  _Istate_34 |  (dropped)
  _Istate_35 |  (dropped)
  _Istate_41 |  (dropped)
  _Istate_42 |  (dropped)
  _Istate_43 |  (dropped)
  _Istate_44 |  (dropped)
  _Istate_45 |  (dropped)
  _Istate_46 |  (dropped)
  _Istate_47 |  (dropped)
  _Istate_51 |  (dropped)
  _Istate_52 |  (dropped)
  _Istate_54 |  (dropped)
  _Istate_55 |  (dropped)
  _Istate_56 |  (dropped)
  _Istate_57 |  (dropped)
  _Istate_58 |  (dropped)
  _Istate_59 |  (dropped)
  _Istate_61 |  (dropped)
  _Istate_62 |  (dropped)
  _Istate_63 |  (dropped)
  _Istate_64 |  (dropped)
  _Istate_71 |   1.238679   1.560659     0.79   0.485    -3.728034    6.205392
  _Istate_72 |   1.864991    1.01018     1.85   0.162    -1.349854    5.079836
  _Istate_73 |    1.66575   1.269109     1.31   0.281    -2.373122    5.704622
  _Istate_74 |  (dropped)
  _Istate_81 |  (dropped)
  _Istate_82 |  (dropped)
  _Istate_83 |  (dropped)
  _Istate_84 |  (dropped)
  _Istate_85 |  (dropped)
  _Istate_86 |  (dropped)
  _Istate_87 |  (dropped)
  _Istate_88 |  (dropped)
  _Istate_91 |  (dropped)
  _Istate_92 |  (dropped)
  _Istate_93 |  (dropped)
  _Istate_94 |  (dropped)
  _Istate_95 |  (dropped)
  _IstaXt_12 |  (dropped)
  _IstaXt_13 |  (dropped)
  _IstaXt_14 |  (dropped)
  _IstaXt_15 |  (dropped)
  _IstaXt_16 |  (dropped)
  _IstaXt_21 |  (dropped)
  _IstaXt_22 |  (dropped)
  _IstaXt_23 |  (dropped)
  _IstaXt_31 |  (dropped)
  _IstaXt_32 |  (dropped)
  _IstaXt_33 |  (dropped)
  _IstaXt_34 |  (dropped)
  _IstaXt_35 |  (dropped)
  _IstaXt_41 |  (dropped)
  _IstaXt_42 |  (dropped)
  _IstaXt_43 |  (dropped)
  _IstaXt_44 |  (dropped)
  _IstaXt_45 |  (dropped)
  _IstaXt_46 |  (dropped)
  _IstaXt_47 |  (dropped)
  _IstaXt_51 |  (dropped)
  _IstaXt_52 |  (dropped)
  _IstaXt_54 |  (dropped)
  _IstaXt_55 |  (dropped)
  _IstaXt_56 |  (dropped)
  _IstaXt_57 |  (dropped)
  _IstaXt_58 |  (dropped)
  _IstaXt_59 |  (dropped)
  _IstaXt_61 |  (dropped)
  _IstaXt_62 |  (dropped)
  _IstaXt_63 |  (dropped)
  _IstaXt_64 |  (dropped)
  _IstaXt_71 |   .1541258   .0240593     6.41   0.008     .0775585    .2306931
  _IstaXt_72 |   .0433102   .0061363     7.06   0.006     .0237817    .0628388
  _IstaXt_73 |   .0837069   .0137747     6.08   0.009     .0398696    .1275442
  _IstaXt_74 |   .0777497   .0249218     3.12   0.052    -.0015626     .157062
  _IstaXt_81 |  (dropped)
  _IstaXt_82 |  (dropped)
  _IstaXt_83 |  (dropped)
  _IstaXt_84 |  (dropped)
  _IstaXt_85 |  (dropped)
  _IstaXt_86 |  (dropped)
  _IstaXt_87 |  (dropped)
  _IstaXt_88 |  (dropped)
  _IstaXt_91 |  (dropped)
  _IstaXt_92 |  (dropped)
  _IstaXt_93 |  (dropped)
  _IstaXt_94 |  (dropped)
  _IstaXt_95 |  (dropped)
       _cons |  -23.90664   11.95387    -2.00   0.139    -61.94919    14.13591
------------------------------------------------------------------------------

. * Moutain Division;
. reg lnths lnemp mico mppa mgfa _Iyear* _Istate* _IstaXt_*  if region==8, clus
> ter(state);

Linear regression                                      Number of obs =     136
                                                       F(  6,     7) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.9854
                                                       Root MSE      =  .22905

                                  (Std. Err. adjusted for 8 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       lnemp |   1.158238   1.212638     0.96   0.371    -1.709195    4.025671
        mico |   .4780309   .1865291     2.56   0.037     .0369595    .9191022
        mppa |  -.0846236    .101413    -0.83   0.432    -.3244272    .1551801
        mgfa |  -.0692347   .0854309    -0.81   0.444    -.2712466    .1327773
   _Iyear_75 |  (dropped)
   _Iyear_76 |  (dropped)
   _Iyear_80 |  -.1267779   .0621255    -2.04   0.081    -.2736814    .0201256
   _Iyear_81 |  -.2744994   .0719542    -3.81   0.007     -.444644   -.1043549
   _Iyear_82 |  -.4935475   .2201896    -2.24   0.060    -1.014213    .0271183
   _Iyear_83 |  -.5958085   .1366669    -4.36   0.003    -.9189743   -.2726426
   _Iyear_84 |  -.2893852   .1144359    -2.53   0.039    -.5599832   -.0187872
   _Iyear_85 |  -.3691432   .1641427    -2.25   0.059    -.7572789    .0189925
   _Iyear_86 |  -.4091251   .1251945    -3.27   0.014     -.705163   -.1130871
   _Iyear_87 |  -.3256812    .116914    -2.79   0.027    -.6021388   -.0492236
   _Iyear_88 |  -.1084325   .1755409    -0.62   0.556    -.5235207    .3066558
   _Iyear_89 |  -.0928191   .2023656    -0.46   0.660    -.5713378    .3856995
   _Iyear_90 |  -.1985141   .1922227    -1.03   0.336    -.6530486    .2560204
   _Iyear_91 |  -.1591065   .1343065    -1.18   0.275     -.476691    .1584779
   _Iyear_92 |  -.1589783   .1018963    -1.56   0.163    -.3999248    .0819682
   _Iyear_93 |   .0365705   .1101707     0.33   0.750    -.2239418    .2970829
   _Iyear_94 |  -.0120133    .053383    -0.23   0.828     -.138244    .1142175
   _Iyear_95 |  (dropped)
   _Iyear_96 |  (dropped)
   _Iyear_97 |  (dropped)
  _Istate_12 |  (dropped)
  _Istate_13 |  (dropped)
  _Istate_14 |  (dropped)
  _Istate_15 |  (dropped)
  _Istate_16 |  (dropped)
  _Istate_21 |  (dropped)
  _Istate_22 |  (dropped)
  _Istate_23 |  (dropped)
  _Istate_31 |  (dropped)
  _Istate_32 |  (dropped)
  _Istate_33 |  (dropped)
  _Istate_34 |  (dropped)
  _Istate_35 |  (dropped)
  _Istate_41 |  (dropped)
  _Istate_42 |  (dropped)
  _Istate_43 |  (dropped)
  _Istate_44 |  (dropped)
  _Istate_45 |  (dropped)
  _Istate_46 |  (dropped)
  _Istate_47 |  (dropped)
  _Istate_51 |  (dropped)
  _Istate_52 |  (dropped)
  _Istate_54 |  (dropped)
  _Istate_55 |  (dropped)
  _Istate_56 |  (dropped)
  _Istate_57 |  (dropped)
  _Istate_58 |  (dropped)
  _Istate_59 |  (dropped)
  _Istate_61 |  (dropped)
  _Istate_62 |  (dropped)
  _Istate_63 |  (dropped)
  _Istate_64 |  (dropped)
  _Istate_71 |  (dropped)
  _Istate_72 |  (dropped)
  _Istate_73 |  (dropped)
  _Istate_74 |  (dropped)
  _Istate_81 |  -2.731701   1.801965    -1.52   0.173     -6.99267    1.529269
  _Istate_82 |  -1.990958   1.697894    -1.17   0.279    -6.005839    2.023923
  _Istate_83 |  -1.939891   2.120248    -0.91   0.391    -6.953481    3.073699
  _Istate_84 |  (dropped)
  _Istate_85 |  -1.391119   1.245592    -1.12   0.301    -4.336475    1.554237
  _Istate_86 |  -.0615202   .2791155    -0.22   0.832    -.7215236    .5984831
  _Istate_87 |  -1.068294   1.042293    -1.02   0.339    -3.532925    1.396337
  _Istate_88 |  -.8338543   1.493701    -0.56   0.594    -4.365897    2.698188
  _Istate_91 |  (dropped)
  _Istate_92 |  (dropped)
  _Istate_93 |  (dropped)
  _Istate_94 |  (dropped)
  _Istate_95 |  (dropped)
  _IstaXt_12 |  (dropped)
  _IstaXt_13 |  (dropped)
  _IstaXt_14 |  (dropped)
  _IstaXt_15 |  (dropped)
  _IstaXt_16 |  (dropped)
  _IstaXt_21 |  (dropped)
  _IstaXt_22 |  (dropped)
  _IstaXt_23 |  (dropped)
  _IstaXt_31 |  (dropped)
  _IstaXt_32 |  (dropped)
  _IstaXt_33 |  (dropped)
  _IstaXt_34 |  (dropped)
  _IstaXt_35 |  (dropped)
  _IstaXt_41 |  (dropped)
  _IstaXt_42 |  (dropped)
  _IstaXt_43 |  (dropped)
  _IstaXt_44 |  (dropped)
  _IstaXt_45 |  (dropped)
  _IstaXt_46 |  (dropped)
  _IstaXt_47 |  (dropped)
  _IstaXt_51 |  (dropped)
  _IstaXt_52 |  (dropped)
  _IstaXt_54 |  (dropped)
  _IstaXt_55 |  (dropped)
  _IstaXt_56 |  (dropped)
  _IstaXt_57 |  (dropped)
  _IstaXt_58 |  (dropped)
  _IstaXt_59 |  (dropped)
  _IstaXt_61 |  (dropped)
  _IstaXt_62 |  (dropped)
  _IstaXt_63 |  (dropped)
  _IstaXt_64 |  (dropped)
  _IstaXt_71 |  (dropped)
  _IstaXt_72 |  (dropped)
  _IstaXt_73 |  (dropped)
  _IstaXt_74 |  (dropped)
  _IstaXt_81 |   .1644429   .0168509     9.76   0.000      .124597    .2042888
  _IstaXt_82 |   .1449561   .0253523     5.72   0.001     .0850074    .2049048
  _IstaXt_83 |   .0983459   .0172563     5.70   0.001     .0575412    .1391505
  _IstaXt_84 |   .0378565   .0305968     1.24   0.256    -.0344935    .1102066
  _IstaXt_85 |   .1209345   .0318484     3.80   0.007     .0456251    .1962439
  _IstaXt_86 |   .0674675   .0426149     1.58   0.157    -.0333007    .1682357
  _IstaXt_87 |   .1373332    .041382     3.32   0.013     .0394804    .2351861
  _IstaXt_88 |   .0823884   .0522824     1.58   0.159    -.0412397    .2060166
  _IstaXt_91 |  (dropped)
  _IstaXt_92 |  (dropped)
  _IstaXt_93 |  (dropped)
  _IstaXt_94 |  (dropped)
  _IstaXt_95 |  (dropped)
       _cons |  -7.412427   17.00914    -0.44   0.676    -47.63265     32.8078
------------------------------------------------------------------------------

. * Pacific Division;
. reg lnths lnemp mico mppa mgfa _Iyear* _Istate* _IstaXt_*  if region==9, clus
> ter(state);

Linear regression                                      Number of obs =      85
                                                       F(  3,     4) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.9974
                                                       Root MSE      =   .1277

                                  (Std. Err. adjusted for 5 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       lnemp |     2.6264   .6079967     4.32   0.012     .9383311     4.31447
        mico |   .0567822   .1571531     0.36   0.736    -.3795446    .4931091
        mppa |  -.0040104   .0948275    -0.04   0.968    -.2672939     .259273
        mgfa |   .0599497   .0490612     1.22   0.289    -.0762661    .1961655
   _Iyear_75 |  (dropped)
   _Iyear_76 |  (dropped)
   _Iyear_80 |  -.1893717   .0598034    -3.17   0.034    -.3554127   -.0233308
   _Iyear_81 |  -.0670402   .0710938    -0.94   0.399    -.2644281    .1303478
   _Iyear_82 |  -.2854158   .0815877    -3.50   0.025    -.5119395   -.0588921
   _Iyear_83 |  -.4038468   .0490048    -8.24   0.001    -.5399058   -.2677878
   _Iyear_84 |  -.1793921   .0334146    -5.37   0.006     -.272166   -.0866183
   _Iyear_85 |  -.2648895   .0721837    -3.67   0.021    -.4653035   -.0644756
   _Iyear_86 |  -.1486933   .1509295    -0.99   0.380    -.5677409    .2703543
   _Iyear_87 |  -.2200698   .1044694    -2.11   0.103    -.5101233    .0699836
   _Iyear_88 |   .0202783   .1112397     0.18   0.864    -.2885726    .3291291
   _Iyear_89 |  -.0201389   .1027976    -0.20   0.854    -.3055509     .265273
   _Iyear_90 |  -.0063808   .1479429    -0.04   0.968    -.4171361    .4043745
   _Iyear_91 |  -.1221412   .1147606    -1.06   0.347    -.4407677    .1964854
   _Iyear_92 |  -.2296775   .0778659    -2.95   0.042     -.445868    -.013487
   _Iyear_93 |    .013658    .075063     0.18   0.864    -.1947504    .2220663
   _Iyear_94 |   .0425612   .0627225     0.68   0.535    -.1315845    .2167069
   _Iyear_95 |  (dropped)
   _Iyear_96 |  (dropped)
   _Iyear_97 |  (dropped)
  _Istate_12 |  (dropped)
  _Istate_13 |  (dropped)
  _Istate_14 |  (dropped)
  _Istate_15 |  (dropped)
  _Istate_16 |  (dropped)
  _Istate_21 |  (dropped)
  _Istate_22 |  (dropped)
  _Istate_23 |  (dropped)
  _Istate_31 |  (dropped)
  _Istate_32 |  (dropped)
  _Istate_33 |  (dropped)
  _Istate_34 |  (dropped)
  _Istate_35 |  (dropped)
  _Istate_41 |  (dropped)
  _Istate_42 |  (dropped)
  _Istate_43 |  (dropped)
  _Istate_44 |  (dropped)
  _Istate_45 |  (dropped)
  _Istate_46 |  (dropped)
  _Istate_47 |  (dropped)
  _Istate_51 |  (dropped)
  _Istate_52 |  (dropped)
  _Istate_54 |  (dropped)
  _Istate_55 |  (dropped)
  _Istate_56 |  (dropped)
  _Istate_57 |  (dropped)
  _Istate_58 |  (dropped)
  _Istate_59 |  (dropped)
  _Istate_61 |  (dropped)
  _Istate_62 |  (dropped)
  _Istate_63 |  (dropped)
  _Istate_64 |  (dropped)
  _Istate_71 |  (dropped)
  _Istate_72 |  (dropped)
  _Istate_73 |  (dropped)
  _Istate_74 |  (dropped)
  _Istate_81 |  (dropped)
  _Istate_82 |  (dropped)
  _Istate_83 |  (dropped)
  _Istate_84 |  (dropped)
  _Istate_85 |  (dropped)
  _Istate_86 |  (dropped)
  _Istate_87 |  (dropped)
  _Istate_88 |  (dropped)
  _Istate_91 |   1.976734   1.189437     1.66   0.172    -1.325671    5.279139
  _Istate_92 |   2.599396   1.433616     1.81   0.144    -1.380958    6.579751
  _Istate_93 |  (dropped)
  _Istate_94 |   4.118819   2.390129     1.72   0.160    -2.517243    10.75488
  _Istate_95 |   4.328774   1.885594     2.30   0.083    -.9064746    9.564022
  _IstaXt_12 |  (dropped)
  _IstaXt_13 |  (dropped)
  _IstaXt_14 |  (dropped)
  _IstaXt_15 |  (dropped)
  _IstaXt_16 |  (dropped)
  _IstaXt_21 |  (dropped)
  _IstaXt_22 |  (dropped)
  _IstaXt_23 |  (dropped)
  _IstaXt_31 |  (dropped)
  _IstaXt_32 |  (dropped)
  _IstaXt_33 |  (dropped)
  _IstaXt_34 |  (dropped)
  _IstaXt_35 |  (dropped)
  _IstaXt_41 |  (dropped)
  _IstaXt_42 |  (dropped)
  _IstaXt_43 |  (dropped)
  _IstaXt_44 |  (dropped)
  _IstaXt_45 |  (dropped)
  _IstaXt_46 |  (dropped)
  _IstaXt_47 |  (dropped)
  _IstaXt_51 |  (dropped)
  _IstaXt_52 |  (dropped)
  _IstaXt_54 |  (dropped)
  _IstaXt_55 |  (dropped)
  _IstaXt_56 |  (dropped)
  _IstaXt_57 |  (dropped)
  _IstaXt_58 |  (dropped)
  _IstaXt_59 |  (dropped)
  _IstaXt_61 |  (dropped)
  _IstaXt_62 |  (dropped)
  _IstaXt_63 |  (dropped)
  _IstaXt_64 |  (dropped)
  _IstaXt_71 |  (dropped)
  _IstaXt_72 |  (dropped)
  _IstaXt_73 |  (dropped)
  _IstaXt_74 |  (dropped)
  _IstaXt_81 |  (dropped)
  _IstaXt_82 |  (dropped)
  _IstaXt_83 |  (dropped)
  _IstaXt_84 |  (dropped)
  _IstaXt_85 |  (dropped)
  _IstaXt_86 |  (dropped)
  _IstaXt_87 |  (dropped)
  _IstaXt_88 |  (dropped)
  _IstaXt_91 |   .0432351   .0234044     1.85   0.138    -.0217459    .1082161
  _IstaXt_92 |   .0883449   .0166437     5.31   0.006     .0421345    .1345553
  _IstaXt_93 |   .0252056   .0147509     1.71   0.163    -.0157494    .0661606
  _IstaXt_94 |   .0709149   .0190837     3.72   0.021     .0179301    .1238997
  _IstaXt_95 |   .0223263   .0162666     1.37   0.242    -.0228371    .0674896
       _cons |  -31.02279   9.711177    -3.19   0.033    -57.98534    -4.06024
------------------------------------------------------------------------------

. 
end of do-file


. exit, clear
