---------------------------------------------------------------------------------
       log:  C:\Documents and Settings\jwang\Desktop\JOLEcluster-runs_table3.log
  log type:  text
 opened on:  29 May 2008, 17:13:46

. set matsize 450;

Current memory allocation

                    current                                 memory usage
    settable          value     description                 (1M = 1024k)
    --------------------------------------------------------------------
    set maxvar         5000     max. variables allowed           1.909M
    set memory           10M    max. data space                 10.000M
    set matsize         450     max. RHS vars in models          1.583M
                                                            -----------
                                                                13.492M

. use autor-jole-2003.dta;
(EOW SVCs, CPS, rulings research data set)

. * Log total employment - from BLS employment & earnings;
. gen lnemp=ln(annemp);

. * Non-business-service sector employment from CBP;
. gen nonemp= stateemp-svcemp;
(200 missing values generated)

. gen lnnon=ln(nonemp);
(200 missing values generated)

. gen svcfrac= svcemp/nonemp;
(200 missing values generated)

. * Total business services employment from CBP;
. gen bizemp= svcemp+peremp;
(200 missing values generated)

. gen lnbiz = ln(biz);
(200 missing values generated)

. * State dummies, year dummies, and state*time trends;
. gen t=year-78;

. gen t2=t^2;

. drop if state==98;
(0 observations deleted)

. xi i.state i.year i.state*t i.state*t2 i.region*i.year;
i.state           _Istate_11-95       (naturally coded; _Istate_11 omitted)
i.year            _Iyear_74-97        (naturally coded; _Iyear_74 omitted)
i.state*t         _IstaXt_#           (coded as above)
i.state*t2        _IstaXt2_#          (coded as above)
i.region          _Iregion_1-9        (naturally coded; _Iregion_1 omitted)
i.reg~n*i.year    _IregXyea_#_#       (coded as above)

. drop _Iyear_77 - _Iyear_79;

. * Working sample;
. gen year1 = year>=79 & year<=95;

. keep if year1;
(350 observations deleted)

. gen year2 = ((int(year/2)*2 + 1)==year);

. gen year4 = (year==79 | year==83 | year==87 | year==91 | year==95);

. * Generate more aggregate demos;
. gen clp=clg+gtc;

. gen a1624=m1619+m2024+f1619+f2024;

. gen a2554=m2554+f2554;

. gen a55up=m5564+m65up+f5564+f65up;

. gen fem=f1619+f2024+f2554+f5564+f65up;

. gen white=rs_wm+rs_wf;

. gen black=rs_bm+rs_bf;

. gen other=rs_om+rs_of;

. gen married=marfem+marmale;

. * Modify union variable so that:
>   1 - We don't use interpolated data for 1979 & 1981
>   2 - Turn from fraction into percent so that coefficient will be friendly si
> ze;
. replace unmem=. if year==79 | year==81;
(100 real changes made, 100 to missing)

. replace unmem=unmem*100;
(750 real changes made)

. *******************************;
. ** Table 3: Basic specs
> *******************************;
. reg lnths mico _Iyear* _Istate* , cluster(state);

Linear regression                                      Number of obs =     850
                                                       F( 16,    49) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.9686
                                                       Root MSE      =  .31538

                                 (Std. Err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        mico |   .1120759   .0987439     1.14   0.262    -.0863575    .3105092
   _Iyear_75 |  (dropped)
   _Iyear_76 |  (dropped)
   _Iyear_80 |   -.017367   .0332078    -0.52   0.603    -.0841005    .0493666
   _Iyear_81 |  -.0251009   .0540082    -0.46   0.644    -.1336343    .0834326
   _Iyear_82 |  -.0540266   .0599547    -0.90   0.372    -.1745101    .0664568
   _Iyear_83 |  -.0339783   .0642836    -0.53   0.599    -.1631611    .0952044
   _Iyear_84 |   .3432042   .0676245     5.08   0.000     .2073077    .4791007
   _Iyear_85 |   .5576528   .0854943     6.52   0.000     .3858455      .72946
   _Iyear_86 |   .6629363   .0902454     7.35   0.000     .4815814    .8442912
   _Iyear_87 |   .7855948   .0987259     7.96   0.000     .5871978    .9839918
   _Iyear_88 |   1.111565   .1044065    10.65   0.000     .9017522    1.321378
   _Iyear_89 |   1.212887   .1024389    11.84   0.000     1.007028    1.418746
   _Iyear_90 |   1.260986    .116959    10.78   0.000     1.025948    1.496024
   _Iyear_91 |    1.29599   .1190993    10.88   0.000     1.056651    1.535329
   _Iyear_92 |   1.445069   .1214418    11.90   0.000     1.201022    1.689115
   _Iyear_93 |   1.723352    .120021    14.36   0.000     1.482161    1.964543
   _Iyear_94 |   1.879605   .1249262    15.05   0.000     1.628556    2.130653
   _Iyear_95 |   1.990261   .1276288    15.59   0.000     1.733781     2.24674
   _Iyear_96 |  (dropped)
   _Iyear_97 |  (dropped)
  _Istate_12 |   .5053963   .0522762     9.67   0.000     .4003433    .6104492
  _Istate_13 |  -1.320287   .0348508   -37.88   0.000    -1.390322   -1.250252
  _Istate_14 |   2.830914   .0522762    54.15   0.000     2.725861    2.935967
  _Istate_15 |   .8696303   .0987439     8.81   0.000      .671197    1.068064
  _Istate_16 |    2.08687   .0348508    59.88   0.000     2.016835    2.156905
  _Istate_21 |   3.757076   .0174254   215.61   0.000     3.722058    3.792093
  _Istate_22 |   2.778598   .0348508    79.73   0.000     2.708562    2.848633
  _Istate_23 |   3.019854   .0987439    30.58   0.000      2.82142    3.218287
  _Istate_31 |    3.07567   .0174254   176.51   0.000     3.040652    3.110688
  _Istate_32 |   2.148531   .0464677    46.24   0.000      2.05515    2.241911
  _Istate_33 |   3.224786   1.18e-12        .   0.000     3.224786    3.224786
  _Istate_34 |   2.913444   .0058085   501.59   0.000     2.901771    2.925116
  _Istate_35 |    2.26038   .0348508    64.86   0.000     2.190345    2.330416
  _Istate_41 |   2.389778   .0232339   102.86   0.000     2.343088    2.436469
  _Istate_42 |   .9898591   .0464677    21.30   0.000     .8964787    1.083239
  _Istate_43 |    2.18017   .0638931    34.12   0.000     2.051772    2.308568
  _Istate_44 |  -1.913121   .0290423   -65.87   0.000    -1.971484   -1.854758
  _Istate_45 |  -1.225741   .0232339   -52.76   0.000    -1.272431   -1.179051
  _Istate_46 |    .847133   .0232339    36.46   0.000     .8004428    .8938232
  _Istate_47 |   .9228662   .0290423    31.78   0.000     .8645035     .981229
  _Istate_51 |   .7004716   .0987439     7.09   0.000     .5020383    .8989049
  _Istate_52 |   2.145925   .0348508    61.57   0.000      2.07589     2.21596
  _Istate_54 |   2.283572   .0232339    98.29   0.000     2.236882    2.330262
  _Istate_55 |   .0250218   .0406593     0.62   0.541    -.0566861    .1067296
  _Istate_56 |   2.367376   .0987439    23.97   0.000     2.168942    2.565809
  _Istate_57 |   1.627965   .0464677    35.03   0.000     1.534584    1.721345
  _Istate_58 |   2.662702   .0987439    26.97   0.000     2.464268    2.861135
  _Istate_59 |   3.579645   .0987439    36.25   0.000     3.381212    3.778078
  _Istate_61 |   1.457818   .0232339    62.75   0.000     1.411127    1.504508
  _Istate_62 |   2.090672   .0116169   179.97   0.000     2.067327    2.114017
  _Istate_63 |   1.341689   .0464677    28.87   0.000     1.248309     1.43507
  _Istate_64 |   .1653509   .0987439     1.67   0.100    -.0330824    .3637842
  _Istate_71 |    .993058   .0290423    34.19   0.000     .9346953    1.051421
  _Istate_72 |   2.160212   .0987439    21.88   0.000     1.961779    2.358645
  _Istate_73 |    1.62035   1.18e-12        .   0.000      1.62035     1.62035
  _Istate_74 |   3.629538   .0348508   104.15   0.000     3.559503    3.699574
  _Istate_81 |  -1.583982   .0464677   -34.09   0.000    -1.677363   -1.490602
  _Istate_82 |  -.5758715   1.18e-12        .   0.000    -.5758715   -.5758715
  _Istate_83 |  -1.671254   .0348508   -47.95   0.000     -1.74129   -1.601219
  _Istate_84 |   2.028546   .0232339    87.31   0.000     1.981856    2.075236
  _Istate_85 |   .2954403   .0058085    50.86   0.000     .2837678    .3071129
  _Istate_86 |   2.072931   .0232339    89.22   0.000     2.026241    2.119622
  _Istate_87 |   .9042255   .0406593    22.24   0.000     .8225176    .9859333
  _Istate_88 |   .3569528   .0232339    15.36   0.000     .3102626     .403643
  _Istate_91 |   1.762551   1.18e-12        .   0.000     1.762551    1.762551
  _Istate_92 |   1.460522   1.18e-12        .   0.000     1.460522    1.460522
  _Istate_93 |   4.352636   1.18e-12        .   0.000     4.352636    4.352636
  _Istate_94 |  -1.430737   .0232339   -61.58   0.000    -1.477427   -1.384047
  _Istate_95 |   .2671242   .0406593     6.57   0.000     .1854164    .3488321
       _cons |   6.518677    .084747    76.92   0.000     6.348372    6.688983
------------------------------------------------------------------------------

. reg lnths mico _Iyear* _Istate* _IstaXt_* , cluster(state);

Linear regression                                      Number of obs =     850
                                                       F( 16,    49) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.9877
                                                       Root MSE      =   .2037

                                 (Std. Err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        mico |   .1357066   .0627639     2.16   0.036     .0095778    .2618354
   _Iyear_75 |  (dropped)
   _Iyear_76 |  (dropped)
   _Iyear_80 |   .0295437   .0317936     0.93   0.357    -.0343479    .0934354
   _Iyear_81 |   .0691931   .0534955     1.29   0.202    -.0383101    .1766964
   _Iyear_82 |    .087178   .0565906     1.54   0.130    -.0265451    .2009012
   _Iyear_83 |   .1503561   .0507346     2.96   0.005     .0484012     .252311
   _Iyear_84 |   .5739767   .0494743    11.60   0.000     .4745544     .673399
   _Iyear_85 |   .8329729   .0572153    14.56   0.000     .7179944    .9479513
   _Iyear_86 |   .9846945   .0557827    17.65   0.000     .8725949    1.096794
   _Iyear_87 |   1.152846   .0581083    19.84   0.000     1.036073    1.269619
   _Iyear_88 |   1.525727   .0446473    34.17   0.000     1.436005    1.615449
   _Iyear_89 |   1.675377   .0393337    42.59   0.000     1.596333    1.754421
   _Iyear_90 |   1.771332   .0479536    36.94   0.000     1.674966    1.867698
   _Iyear_91 |   1.854192   .0428947    43.23   0.000     1.767992    1.940392
   _Iyear_92 |   2.051127   .0364304    56.30   0.000     1.977917    2.124336
   _Iyear_93 |   2.377266   .0347934    68.33   0.000     2.307346    2.447186
   _Iyear_94 |   2.581375   .0346333    74.53   0.000     2.511777    2.650973
   _Iyear_95 |   2.739886   .0345025    79.41   0.000     2.670551    2.809222
   _Iyear_96 |  (dropped)
   _Iyear_97 |  (dropped)
  _Istate_12 |   .8465134   .0830699    10.19   0.000     .6795782    1.013449
  _Istate_13 |   -1.62883   .0678404   -24.01   0.000    -1.765161     -1.4925
  _Istate_14 |   3.925407   .0830699    47.25   0.000     3.758472    4.092342
  _Istate_15 |   1.461856   .0627639    23.29   0.000     1.335727    1.587985
  _Istate_16 |   3.314287   .0678404    48.85   0.000     3.177957    3.450618
  _Istate_21 |   4.986289   .0401504   124.19   0.000     4.905603    5.066974
  _Istate_22 |   3.893767   .0678404    57.40   0.000     3.757437    4.030098
  _Istate_23 |   3.920831   .0627639    62.47   0.000     3.794702     4.04696
  _Istate_31 |   3.591512   .0401504    89.45   0.000     3.510827    3.672197
  _Istate_32 |     2.5655   .0793779    32.32   0.000     2.405984    2.725016
  _Istate_33 |   3.763679          .        .       .            .           .
  _Istate_34 |   3.386864    .014768   229.34   0.000     3.357187    3.416542
  _Istate_35 |   3.047816   .0678404    44.93   0.000     2.911485    3.184146
  _Istate_41 |   3.293745   .0507649    64.88   0.000      3.19173    3.395761
  _Istate_42 |   1.680434   .0793779    21.17   0.000     1.520918     1.83995
  _Istate_43 |    2.88987   .0281515   102.65   0.000     2.833298    2.946443
  _Istate_44 |  -1.522461   .0599949   -25.38   0.000    -1.643025   -1.401896
  _Istate_45 |  -.8510374   .0507649   -16.76   0.000    -.9530533   -.7490214
  _Istate_46 |   1.269383   .0507649    25.01   0.000     1.167367    1.371399
  _Istate_47 |    1.03134   .0599949    17.19   0.000     .9107753    1.151904
  _Istate_51 |   1.549271   .0627639    24.68   0.000     1.423142    1.675399
  _Istate_52 |   2.999853   .0678404    44.22   0.000     2.863522    3.136183
  _Istate_54 |   2.909988   .0507649    57.32   0.000     2.807972    3.012004
  _Istate_55 |    .835338   .0743014    11.24   0.000     .6860238    .9846522
  _Istate_56 |   2.387778   .0627639    38.04   0.000     2.261649    2.513906
  _Istate_57 |   1.579017   .0793779    19.89   0.000     1.419501    1.738533
  _Istate_58 |   3.003741   .0627639    47.86   0.000     2.877612    3.129869
  _Istate_59 |   3.659945   .0627639    58.31   0.000     3.533816    3.786073
  _Istate_61 |   1.784358   .0507649    35.15   0.000     1.682342    1.886374
  _Istate_62 |   2.181652   .0281515    77.50   0.000      2.12508    2.238225
  _Istate_63 |   1.376163   .0793779    17.34   0.000     1.216647    1.535679
  _Istate_64 |  -.5789312   .0627639    -9.22   0.000      -.70506   -.4528024
  _Istate_71 |    .608088   .0599949    10.14   0.000     .4875237    .7286523
  _Istate_72 |   3.114582   .0627639    49.62   0.000     2.988453    3.240711
  _Istate_73 |   2.283755          .        .       .            .           .
  _Istate_74 |    4.12855   .0678404    60.86   0.000      3.99222     4.26488
  _Istate_81 |  -1.894074   .0793779   -23.86   0.000    -2.053589   -1.734558
  _Istate_82 |  -.5594027          .        .       .            .           .
  _Istate_83 |   -1.19045   .0678404   -17.55   0.000    -1.326781    -1.05412
  _Istate_84 |   2.845314   .0507649    56.05   0.000     2.743298     2.94733
  _Istate_85 |   .4646714    .014768    31.46   0.000     .4349941    .4943488
  _Istate_86 |   2.518126   .0507649    49.60   0.000      2.41611    2.620142
  _Istate_87 |   .6698005   .0743014     9.01   0.000     .5204863    .8191148
  _Istate_88 |   .5726448   .0507649    11.28   0.000     .4706288    .6746607
  _Istate_91 |   2.260736          .        .       .            .           .
  _Istate_92 |   1.709494          .        .       .            .           .
  _Istate_93 |   5.258882          .        .       .            .           .
  _Istate_94 |  -1.058158   .0507649   -20.84   0.000    -1.160174   -.9561419
  _Istate_95 |   1.137244   .0743014    15.31   0.000       .98793    1.286558
  _IstaXt_12 |  -.0365119    .005538    -6.59   0.000    -.0476409   -.0253828
  _IstaXt_13 |   .0352093   .0050765     6.94   0.000     .0250077    .0454109
  _IstaXt_14 |  -.1202203    .005538   -21.71   0.000    -.1313493   -.1090913
  _IstaXt_15 |  -.0631772          .        .       .            .           .
  _IstaXt_16 |   -.135453   .0050765   -26.68   0.000    -.1456546   -.1252514
  _IstaXt_21 |  -.1361159   .0032305   -42.13   0.000    -.1426078   -.1296239
  _IstaXt_22 |  -.1229811   .0050765   -24.23   0.000    -.1331826   -.1127795
  _IstaXt_23 |  -.0974829          .        .       .            .           .
  _IstaXt_31 |  -.0568524   .0032305   -17.60   0.000    -.0633443   -.0503605
  _IstaXt_32 |  -.0450944    .005538    -8.14   0.000    -.0562234   -.0339653
  _IstaXt_33 |   -.059877          .        .       .            .           .
  _IstaXt_34 |  -.0524478   .0012307   -42.62   0.000    -.0549209   -.0499747
  _IstaXt_35 |  -.0865661   .0050765   -17.05   0.000    -.0967677   -.0763645
  _IstaXt_41 |   -.099823   .0039997   -24.96   0.000    -.1078606   -.0917854
  _IstaXt_42 |  -.0754949    .005538   -13.63   0.000     -.086624   -.0643659
  _IstaXt_43 |  -.0771566   .0013845   -55.73   0.000    -.0799389   -.0743744
  _IstaXt_44 |  -.0426345    .004615    -9.24   0.000    -.0519086   -.0333603
  _IstaXt_45 |  -.0410159   .0039997   -10.25   0.000    -.0490535   -.0329783
  _IstaXt_46 |  -.0462989   .0039997   -11.58   0.000    -.0543365   -.0382613
  _IstaXt_47 |  -.0112804    .004615    -2.44   0.018    -.0205545   -.0020062
  _IstaXt_51 |  -.0916854          .        .       .            .           .
  _IstaXt_52 |  -.0939542   .0050765   -18.51   0.000    -.1041558   -.0837526
  _IstaXt_54 |   -.068984   .0039997   -17.25   0.000    -.0770216   -.0609464
  _IstaXt_55 |   -.088954   .0053842   -16.52   0.000    -.0997739   -.0781341
  _IstaXt_56 |   .0003588          .        .       .            .           .
  _IstaXt_57 |   .0066742    .005538     1.21   0.234    -.0044548    .0178032
  _IstaXt_58 |  -.0352676          .        .       .            .           .
  _IstaXt_59 |  -.0062965          .        .       .            .           .
  _IstaXt_61 |  -.0356645   .0039997    -8.92   0.000    -.0437021   -.0276269
  _IstaXt_62 |     -.0098   .0023075    -4.25   0.000    -.0144371    -.005163
  _IstaXt_63 |  -.0025948    .005538    -0.47   0.641    -.0137238    .0085342
  _IstaXt_64 |   .0853236          .        .       .            .           .
  _IstaXt_71 |   .0435467    .004615     9.44   0.000     .0342725    .0528209
  _IstaXt_72 |  -.1034155          .        .       .            .           .
  _IstaXt_73 |  -.0737117   6.12e-10        .   0.000    -.0737117   -.0737117
  _IstaXt_74 |  -.0545191   .0050765   -10.74   0.000    -.0647207   -.0443175
  _IstaXt_81 |   .0356902    .005538     6.44   0.000     .0245612    .0468192
  _IstaXt_82 |  -.0018299          .        .       .            .           .
  _IstaXt_83 |   -.052496   .0050765   -10.34   0.000    -.0626976   -.0422944
  _IstaXt_84 |  -.0901342   .0039997   -22.54   0.000    -.0981719   -.0820966
  _IstaXt_85 |   -.018649   .0012307   -15.15   0.000    -.0211221   -.0161759
  _IstaXt_86 |  -.0488482   .0039997   -12.21   0.000    -.0568858   -.0408106
  _IstaXt_87 |   .0271284   .0053842     5.04   0.000     .0163085    .0379482
  _IstaXt_88 |   -.023348   .0039997    -5.84   0.000    -.0313856   -.0153104
  _IstaXt_91 |  -.0553539          .        .       .            .           .
  _IstaXt_92 |  -.0276636          .        .       .            .           .
  _IstaXt_93 |   -.100694          .        .       .            .           .
  _IstaXt_94 |  -.0407799   .0039997   -10.20   0.000    -.0488175   -.0327423
  _IstaXt_95 |  -.0955989   .0053842   -17.76   0.000    -.1064187    -.084779
       _cons |   6.123375   .0650416    94.15   0.000     5.992669    6.254081
------------------------------------------------------------------------------

. reg lnths mppa _Iyear* _Istate* , cluster(state);

Linear regression                                      Number of obs =     850
                                                       F( 16,    49) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.9688
                                                       Root MSE      =   .3147

                                 (Std. Err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        mppa |    .134995    .092253     1.46   0.150    -.0503944    .3203844
   _Iyear_75 |  (dropped)
   _Iyear_76 |  (dropped)
   _Iyear_80 |  -.0290833   .0326574    -0.89   0.378    -.0947109    .0365442
   _Iyear_81 |  -.0399755   .0519105    -0.77   0.445    -.1442936    .0643426
   _Iyear_82 |  -.0671182   .0568624    -1.18   0.244    -.1813875    .0471512
   _Iyear_83 |  -.0300545   .0561147    -0.54   0.595    -.1428213    .0827123
   _Iyear_84 |    .343053   .0589578     5.82   0.000     .2245729    .4615332
   _Iyear_85 |    .551593   .0709846     7.77   0.000      .408944    .6942419
   _Iyear_86 |   .6555014   .0760338     8.62   0.000     .5027057    .8082971
   _Iyear_87 |   .7839677   .0866827     9.04   0.000     .6097723     .958163
   _Iyear_88 |   1.111721   .0869396    12.79   0.000     .9370094    1.286433
   _Iyear_89 |   1.202702   .0939929    12.80   0.000     1.013816    1.391588
   _Iyear_90 |   1.250801   .1026574    12.18   0.000     1.044503    1.457098
   _Iyear_91 |   1.285805   .1109461    11.59   0.000      1.06285    1.508759
   _Iyear_92 |   1.434883   .1175286    12.21   0.000     1.198701    1.671066
   _Iyear_93 |   1.713167   .1167727    14.67   0.000     1.478503    1.947831
   _Iyear_94 |    1.86942   .1235095    15.14   0.000     1.621218    2.117621
   _Iyear_95 |   1.980075   .1253881    15.79   0.000     1.728099    2.232052
   _Iyear_96 |  (dropped)
   _Iyear_97 |  (dropped)
  _Istate_12 |    .311067    .092253     3.37   0.001     .1256776    .4964563
  _Istate_13 |  -1.439252   .0542665   -26.52   0.000    -1.548304   -1.330199
  _Istate_14 |   2.644525   .0868264    30.46   0.000     2.470041    2.819009
  _Istate_15 |   .7575544   1.05e-12        .   0.000     .7575544    .7575544
  _Istate_16 |    1.92026   .0868264    22.12   0.000     1.745776    2.094744
  _Istate_21 |   3.737298   1.06e-12        .   0.000     3.737298    3.737298
  _Istate_22 |   2.611987   .0868264    30.08   0.000     2.437503    2.786471
  _Istate_23 |   2.772783    .092253    30.06   0.000     2.587394    2.958172
  _Istate_31 |    3.04001   .0108533   280.10   0.000       3.0182    3.061821
  _Istate_32 |   1.960794    .092253    21.25   0.000     1.775405    2.146184
  _Istate_33 |   3.089791    .092253    33.49   0.000     2.904402     3.27518
  _Istate_34 |   2.771856    .092253    30.05   0.000     2.586467    2.957246
  _Istate_35 |    2.09377   .0868264    24.11   0.000     1.919286    2.268254
  _Istate_41 |   2.283999   .0542665    42.09   0.000     2.174946    2.393051
  _Istate_42 |   .8497678   .0596931    14.24   0.000       .72981    .9697256
  _Istate_43 |   2.020301   .0596931    33.84   0.000     1.900343    2.140259
  _Istate_44 |  -2.017552   .0488398   -41.31   0.000      -2.1157   -1.919405
  _Istate_45 |  -1.315639   .0434132   -30.31   0.000    -1.402881   -1.228397
  _Istate_46 |   .7492943   .0488398    15.34   0.000      .651147    .8474416
  _Istate_47 |   .7707895   .0813997     9.47   0.000     .6072107    .9343684
  _Istate_51 |   .5883957   1.05e-12        .   0.000     .5883957    .5883957
  _Istate_52 |   1.987256   .0813997    24.41   0.000     1.823677    2.150835
  _Istate_54 |   2.169851   .0596931    36.35   0.000     2.049894    2.289809
  _Istate_55 |  -.1561221    .092253    -1.69   0.097    -.3415115    .0292672
  _Istate_56 |    2.16795   .0596931    36.32   0.000     2.047992    2.287908
  _Istate_57 |   1.487873   .0596931    24.93   0.000     1.367916    1.607831
  _Istate_58 |   2.550626   1.05e-12        .   0.000     2.550626    2.550626
  _Istate_59 |   3.467569   1.05e-12        .   0.000     3.467569    3.467569
  _Istate_61 |   1.328215   .0705464    18.83   0.000     1.186447    1.469984
  _Istate_62 |   1.982196   .0651198    30.44   0.000     1.851333    2.113059
  _Istate_63 |   1.288948   1.05e-12        .   0.000     1.288948    1.288948
  _Istate_64 |  -.0181929   .0488398    -0.37   0.711    -.1163402    .0799544
  _Istate_71 |   .8330404   .0868264     9.59   0.000     .6585563    1.007525
  _Istate_72 |   2.048136   1.05e-12        .   0.000     2.048136    2.048136
  _Istate_73 |   1.564764   .0379865    41.19   0.000     1.488427    1.641101
  _Istate_74 |   3.494691   .0651198    53.67   0.000     3.363828    3.625555
  _Istate_81 |  -1.763778   .0868264   -20.31   0.000    -1.938262   -1.589294
  _Istate_82 |  -.7108665    .092253    -7.71   0.000    -.8962559   -.5254771
  _Istate_83 |  -1.766397   .0379865   -46.50   0.000    -1.842734    -1.69006
  _Istate_84 |   1.914826   .0596931    32.08   0.000     1.794868    2.034783
  _Istate_85 |   .1856162   .0705464     2.63   0.011     .0438478    .3273845
  _Istate_86 |   1.959211   .0596931    32.82   0.000     1.839253    2.079169
  _Istate_87 |   .8024904   .0379865    21.13   0.000     .7261536    .8788272
  _Istate_88 |   .2352914   .0651198     3.61   0.001     .1044283    .3661545
  _Istate_91 |   1.667261   .0651198    25.60   0.000     1.536398    1.798124
  _Istate_92 |   1.325527    .092253    14.37   0.000     1.140137    1.510916
  _Istate_93 |   4.217641    .092253    45.72   0.000     4.032252     4.40303
  _Istate_94 |  -1.536517   .0542665   -28.31   0.000    -1.645569   -1.427464
  _Istate_95 |    .109803   .0759731     1.45   0.155    -.0428706    .2624766
       _cons |    6.63794   .0719173    92.30   0.000     6.493417    6.782463
------------------------------------------------------------------------------

. reg lnths mppa _Iyear* _Istate* _IstaXt_* , cluster(state);

Linear regression                                      Number of obs =     850
                                                       F( 16,    49) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.9875
                                                       Root MSE      =   .2057

                                 (Std. Err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        mppa |  -.0260444   .0596825    -0.44   0.664    -.1459809    .0938922
   _Iyear_75 |  (dropped)
   _Iyear_76 |  (dropped)
   _Iyear_80 |   .0305157   .0313167     0.97   0.335    -.0324176    .0934489
   _Iyear_81 |   .0663393   .0529878     1.25   0.217    -.0401436    .1728222
   _Iyear_82 |   .0826918   .0571214     1.45   0.154    -.0320979    .1974814
   _Iyear_83 |   .1664713    .051204     3.25   0.002     .0635729    .2693696
   _Iyear_84 |   .5927362   .0496054    11.95   0.000     .4930503    .6924221
   _Iyear_85 |   .8673167   .0588616    14.73   0.000     .7490299    .9856036
   _Iyear_86 |   1.021162   .0573043    17.82   0.000     .9060045    1.136319
   _Iyear_87 |   1.196344   .0606847    19.71   0.000     1.074393    1.318294
   _Iyear_88 |   1.567592   .0438508    35.75   0.000     1.479471    1.655714
   _Iyear_89 |    1.70851   .0406947    41.98   0.000     1.626731    1.790289
   _Iyear_90 |   1.796883   .0465523    38.60   0.000     1.703333    1.890433
   _Iyear_91 |   1.872161   .0425993    43.95   0.000     1.786555    1.957768
   _Iyear_92 |   2.061514   .0363725    56.68   0.000     1.988421    2.134607
   _Iyear_93 |   2.380072   .0339452    70.12   0.000     2.311857    2.448288
   _Iyear_94 |   2.576599   .0342766    75.17   0.000     2.507718     2.64548
   _Iyear_95 |   2.727529    .034662    78.69   0.000     2.657873    2.797185
   _Iyear_96 |  (dropped)
   _Iyear_97 |  (dropped)
  _Istate_12 |   .6929461   .0596825    11.61   0.000     .5730095    .8128827
  _Istate_13 |  -1.780301   .0109711  -162.27   0.000    -1.802348   -1.758254
  _Istate_14 |   3.765712   .0456396    82.51   0.000     3.673995    3.857428
  _Istate_15 |   1.326149   1.37e-08        .   0.000     1.326149    1.326149
  _Istate_16 |   3.187521   .0456396    69.84   0.000     3.095804    3.279237
  _Istate_21 |   4.899476   8.29e-09        .   0.000     4.899476    4.899476
  _Istate_22 |   3.767001   .0456396    82.54   0.000     3.675285    3.858717
  _Istate_23 |   3.811169   .0596825    63.86   0.000     3.691232    3.931105
  _Istate_31 |   3.509487   .0109711   319.89   0.000      3.48744    3.531534
  _Istate_32 |   2.419916   .0596825    40.55   0.000     2.299979    2.539852
  _Istate_33 |   3.789723   .0596825    63.50   0.000     3.669787     3.90966
  _Istate_34 |   3.380978   .0596825    56.65   0.000     3.261041    3.500914
  _Istate_35 |   2.921049   .0456396    64.00   0.000     2.829333    3.012765
  _Istate_41 |   3.179195   .0109711   289.78   0.000     3.157148    3.201242
  _Istate_42 |   1.506698   .0048273   312.12   0.000     1.496998    1.516399
  _Istate_43 |   2.826895   .0048273   585.61   0.000     2.817194    2.836596
  _Istate_44 |  -1.659074   .0157983  -105.02   0.000    -1.690822   -1.627326
  _Istate_45 |  -.9692262   .0193091   -50.20   0.000    -1.008029   -.9304232
  _Istate_46 |   1.152727   .0157983    72.97   0.000     1.120979    1.184475
  _Istate_47 |   .9159828   .0329132    27.83   0.000     .8498413    .9821243
  _Istate_51 |   1.413564   1.08e-08        .   0.000     1.413564    1.413564
  _Istate_52 |   2.867533   .0329132    87.12   0.000     2.801391    2.933674
  _Istate_54 |   2.798119   .0048273   579.65   0.000     2.788418    2.807819
  _Istate_55 |   .7007297   .0596825    11.74   0.000     .5807932    .8206663
  _Istate_56 |   2.249964   .0048273   466.10   0.000     2.240264    2.259665
  _Istate_57 |   1.405282   .0048273   291.11   0.000     1.395581    1.414982
  _Istate_58 |   2.868034   1.44e-08        .   0.000     2.868034    2.868034
  _Istate_59 |   3.524238   1.51e-08        .   0.000     3.524238    3.524238
  _Istate_61 |   1.679575   .0114099   147.20   0.000     1.656645    1.702504
  _Istate_62 |   2.121933   .0026331   805.88   0.000     2.116642    2.127224
  _Istate_63 |   1.204534   1.61e-08        .   0.000     1.204534    1.204534
  _Istate_64 |  -.7215318   .0157983   -45.67   0.000    -.7532798   -.6897839
  _Istate_71 |   .4982848   .0456396    10.92   0.000     .4065686     .590001
  _Istate_72 |   2.978876   1.27e-08        .   0.000     2.978875    2.978876
  _Istate_73 |   2.274372   .0215033   105.77   0.000     2.231159    2.317584
  _Istate_74 |   3.983016   .0026331  1512.70   0.000     3.977725    3.988308
  _Istate_81 |  -2.045786   .0456396   -44.82   0.000    -2.137502    -1.95407
  _Istate_82 |  -.5333583   .0596825    -8.94   0.000    -.6532949   -.4134218
  _Istate_83 |  -1.346517   .0215033   -62.62   0.000    -1.389729   -1.303304
  _Istate_84 |   2.733445   .0048273   566.25   0.000     2.723744    2.743146
  _Istate_85 |   .4377195   .0114099    38.36   0.000     .4147905    .4606486
  _Istate_86 |   2.406256   .0048273   498.47   0.000     2.396556    2.415957
  _Istate_87 |   .4997642   .0215033    23.24   0.000     .4565518    .5429767
  _Istate_88 |   .4640311   .0026331   176.23   0.000     .4587398    .4693224
  _Istate_91 |   2.261885   .0026331   859.04   0.000     2.256594    2.267177
  _Istate_92 |   1.735538   .0596825    29.08   0.000     1.615602    1.855475
  _Istate_93 |   5.284926   .0596825    88.55   0.000     5.164989    5.404863
  _Istate_94 |  -1.172708   .0109711  -106.89   0.000    -1.194755   -1.150661
  _Istate_95 |   .9859752   .0215033    45.85   0.000     .9427628    1.029188
  _IstaXt_12 |  -.0245377   8.57e-10        .   0.000    -.0245378   -.0245377
  _IstaXt_13 |   .0484198   .0051198     9.46   0.000     .0381311    .0587085
  _IstaXt_14 |  -.1077355   .0011702   -92.06   0.000    -.1100872   -.1053838
  _IstaXt_15 |  -.0631772   1.33e-09        .   0.000    -.0631772   -.0631772
  _IstaXt_16 |  -.1239661   .0011702  -105.93   0.000    -.1263178   -.1216144
  _IstaXt_21 |   -.129131   1.40e-09        .   0.000     -.129131    -.129131
  _IstaXt_22 |  -.1114941   .0011702   -95.27   0.000    -.1138458   -.1091424
  _IstaXt_23 |  -.0974829   1.37e-09        .   0.000     -.097483   -.0974829
  _IstaXt_31 |   -.050059   .0004388  -114.07   0.000    -.0509409   -.0491771
  _IstaXt_32 |  -.0331202   1.82e-09        .   0.000    -.0331202   -.0331202
  _IstaXt_33 |   -.059877   1.52e-09        .   0.000     -.059877    -.059877
  _IstaXt_34 |  -.0497869   5.48e-10        .   0.000    -.0497869   -.0497869
  _IstaXt_35 |  -.0750792   .0011702   -64.16   0.000    -.0774309   -.0727275
  _IstaXt_41 |  -.0889408   .0051198   -17.37   0.000    -.0992295   -.0786522
  _IstaXt_42 |  -.0614143   .0048273   -12.72   0.000    -.0711151   -.0517136
  _IstaXt_43 |  -.0780436   .0048273   -16.17   0.000    -.0877444   -.0683429
  _IstaXt_44 |   -.030358   .0052661    -5.76   0.000    -.0409406   -.0197754
  _IstaXt_45 |  -.0300699   .0052661    -5.71   0.000    -.0406526   -.0194873
  _IstaXt_46 |  -.0353529   .0052661    -6.71   0.000    -.0459355   -.0247703
  _IstaXt_47 |  -.0003444   .0021942    -0.16   0.876    -.0047538     .004065
  _IstaXt_51 |  -.0916854   1.15e-09        .   0.000    -.0916854   -.0916854
  _IstaXt_52 |  -.0820204   .0021942   -37.38   0.000    -.0864298   -.0776109
  _IstaXt_54 |  -.0582295   .0048273   -12.06   0.000    -.0679302   -.0485287
  _IstaXt_55 |  -.0773125   1.58e-09        .   0.000    -.0773125   -.0773125
  _IstaXt_56 |   .0024653   .0048273     0.51   0.612    -.0072355     .012166
  _IstaXt_57 |   .0207549   .0048273     4.30   0.000     .0110541    .0304556
  _IstaXt_58 |  -.0352676   1.36e-09        .   0.000    -.0352676   -.0352676
  _IstaXt_59 |  -.0062965   9.73e-10        .   0.000    -.0062965   -.0062965
  _IstaXt_61 |  -.0253568   .0038033    -6.67   0.000    -.0329998   -.0177138
  _IstaXt_62 |  -.0028958   .0043884    -0.66   0.512    -.0117147    .0059231
  _IstaXt_63 |   .0093793   1.65e-09        .   0.000     .0093793    .0093793
  _IstaXt_64 |   .0876217   .0052661    16.64   0.000      .077039    .0982043
  _IstaXt_71 |   .0540358   .0011702    46.17   0.000     .0516841    .0563875
  _IstaXt_72 |  -.1034155   1.63e-09        .   0.000    -.1034155   -.1034155
  _IstaXt_73 |  -.0714775   .0051198   -13.96   0.000    -.0817662   -.0611888
  _IstaXt_74 |  -.0416278   .0043884    -9.49   0.000    -.0504466   -.0328089
  _IstaXt_81 |    .048175   .0011702    41.17   0.000     .0458233    .0505266
  _IstaXt_82 |  -.0018299   1.23e-09        .   0.000    -.0018299   -.0018299
  _IstaXt_83 |  -.0392855   .0051198    -7.67   0.000    -.0495742   -.0289969
  _IstaXt_84 |  -.0793797   .0048273   -16.44   0.000    -.0890805    -.069679
  _IstaXt_85 |  -.0143284   .0038033    -3.77   0.000    -.0219714   -.0066854
  _IstaXt_86 |  -.0380937   .0048273    -7.89   0.000    -.0477945    -.028393
  _IstaXt_87 |   .0410041   .0051198     8.01   0.000     .0307154    .0512927
  _IstaXt_88 |   -.012785   .0043884    -2.91   0.005    -.0216038   -.0039661
  _IstaXt_91 |  -.0534389   .0043884   -12.18   0.000    -.0622577     -.04462
  _IstaXt_92 |  -.0276636   1.42e-09        .   0.000    -.0276636   -.0276636
  _IstaXt_93 |   -.100694   1.95e-09        .   0.000     -.100694    -.100694
  _IstaXt_94 |  -.0298977   .0051198    -5.84   0.000    -.0401864    -.019609
  _IstaXt_95 |  -.0826168   .0030719   -26.89   0.000      -.08879   -.0764436
       _cons |   6.243941   .0338529   184.44   0.000     6.175911    6.311971
------------------------------------------------------------------------------

. reg lnths mgfa _Iyear* _Istate* , cluster(state);

Linear regression                                      Number of obs =     850
                                                       F( 16,    49) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.9684
                                                       Root MSE      =  .31631

                                 (Std. Err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        mgfa |   .1063801   .1129896     0.94   0.351     -.120681    .3334412
   _Iyear_75 |  (dropped)
   _Iyear_76 |  (dropped)
   _Iyear_80 |  -.0171391   .0329903    -0.52   0.606    -.0834357    .0491574
   _Iyear_81 |  -.0226315   .0539446    -0.42   0.677    -.1310372    .0857742
   _Iyear_82 |  -.0492019   .0600272    -0.82   0.416     -.169831    .0714273
   _Iyear_83 |   -.008866   .0594275    -0.15   0.882    -.1282901    .1105581
   _Iyear_84 |   .3750411   .0593355     6.32   0.000     .2558019    .4942803
   _Iyear_85 |   .6009251   .0704234     8.53   0.000      .459404    .7424462
   _Iyear_86 |   .7129332   .0711238    10.02   0.000     .5700045    .8558618
   _Iyear_87 |   .8425441   .0832688    10.12   0.000     .6752091    1.009879
   _Iyear_88 |   1.175125   .0856451    13.72   0.000     1.003015    1.347235
   _Iyear_89 |   1.272078   .0894751    14.22   0.000     1.092271    1.451885
   _Iyear_90 |   1.320177   .1016094    12.99   0.000     1.115985    1.524368
   _Iyear_91 |   1.355181   .1081745    12.53   0.000     1.137796    1.572565
   _Iyear_92 |   1.502132   .1113434    13.49   0.000     1.278379    1.725885
   _Iyear_93 |   1.780415   .1088689    16.35   0.000     1.561635    1.999196
   _Iyear_94 |    1.93454    .114449    16.90   0.000     1.704547    2.164534
   _Iyear_95 |   2.045196   .1162321    17.60   0.000     1.811619    2.278773
   _Iyear_96 |  (dropped)
   _Iyear_97 |  (dropped)
  _Istate_12 |   .3396819   .1129896     3.01   0.004     .1126208     .566743
  _Istate_13 |  -1.359843   1.10e-12        .   0.000    -1.359843   -1.359843
  _Istate_14 |   2.665199   .1129896    23.59   0.000     2.438138     2.89226
  _Istate_15 |   .7575544   1.09e-12        .   0.000     .7575544    .7575544
  _Istate_16 |   1.947191   .1063431    18.31   0.000     1.733487    2.160896
  _Istate_21 |   3.737298   1.10e-12        .   0.000     3.737298    3.737298
  _Istate_22 |   2.739041   1.10e-12        .   0.000     2.739041    2.739041
  _Istate_23 |   2.907778   1.10e-12        .   0.000     2.907778    2.907778
  _Istate_31 |   3.055892   1.10e-12        .   0.000     3.055892    3.055892
  _Istate_32 |   2.095789   1.10e-12        .   0.000     2.095789    2.095789
  _Istate_33 |   3.224786   1.10e-12        .   0.000     3.224786    3.224786
  _Istate_34 |   2.906851   1.10e-12        .   0.000     2.906851    2.906851
  _Istate_35 |   2.220824   1.10e-12        .   0.000     2.220824    2.220824
  _Istate_41 |   2.363408   1.10e-12        .   0.000     2.363408    2.363408
  _Istate_42 |   .9371175   1.09e-12        .   0.000     .9371175    .9371175
  _Istate_43 |    2.10765   1.10e-12        .   0.000      2.10765     2.10765
  _Istate_44 |  -1.946084   1.10e-12        .   0.000    -1.946084   -1.946084
  _Istate_45 |  -1.252112   1.10e-12        .   0.000    -1.252112   -1.252112
  _Istate_46 |   .8207622   1.09e-12        .   0.000     .8207622    .8207622
  _Istate_47 |   .8899028   1.09e-12        .   0.000     .8899028    .8899028
  _Istate_51 |   .5633651   .0265858    21.19   0.000      .509939    .6167912
  _Istate_52 |   2.106369   1.10e-12        .   0.000     2.106369    2.106369
  _Istate_54 |   2.257201   1.10e-12        .   0.000     2.257201    2.257201
  _Istate_55 |  -.0211271   1.09e-12        .   0.000    -.0211271   -.0211271
  _Istate_56 |     2.2553   1.09e-12        .   0.000       2.2553      2.2553
  _Istate_57 |   1.575223   1.09e-12        .   0.000     1.575223    1.575223
  _Istate_58 |   2.550626   1.09e-12        .   0.000     2.550626    2.550626
  _Istate_59 |   3.467569   1.10e-12        .   0.000     3.467569    3.467569
  _Istate_61 |   1.431447   1.09e-12        .   0.000     1.431447    1.431447
  _Istate_62 |   2.077486   1.09e-12        .   0.000     2.077486    2.077486
  _Istate_63 |   1.232629    .059818    20.61   0.000      1.11242    1.352838
  _Istate_64 |    .053275   1.09e-12        .   0.000      .053275     .053275
  _Istate_71 |   .9600945   1.09e-12        .   0.000     .9600945    .9600945
  _Istate_72 |   2.048136   1.09e-12        .   0.000     2.048136    2.048136
  _Istate_73 |   1.601577   .0199393    80.32   0.000     1.561507    1.641647
  _Istate_74 |   3.589982   1.09e-12        .   0.000     3.589982    3.589982
  _Istate_81 |  -1.724331   .0930503   -18.53   0.000    -1.911323    -1.53734
  _Istate_82 |  -.6196751   .0465251   -13.32   0.000    -.7131708   -.5261793
  _Istate_83 |  -1.723326   .0132929  -129.64   0.000    -1.750039   -1.696613
  _Istate_84 |   2.002175   1.09e-12        .   0.000     2.002175    2.002175
  _Istate_85 |   .2888476   1.09e-12        .   0.000     .2888476    .2888476
  _Istate_86 |   1.977726   .0731109    27.05   0.000     1.830805    2.124648
  _Istate_87 |   .8580766   1.09e-12        .   0.000     .8580766    .8580766
  _Istate_88 |   .2742631    .059818     4.58   0.000     .1540543    .3944719
  _Istate_91 |   1.762551   1.09e-12        .   0.000     1.762551    1.762551
  _Istate_92 |   1.460522   1.09e-12        .   0.000     1.460522    1.460522
  _Istate_93 |   4.252513   .1063431    39.99   0.000     4.038809    4.466218
  _Istate_94 |  -1.538457   .0864038   -17.81   0.000    -1.712092   -1.364822
  _Istate_95 |   .2209753   1.09e-12        .   0.000     .2209753    .2209753
       _cons |   6.590764   .0698133    94.41   0.000     6.450469    6.731059
------------------------------------------------------------------------------

. reg lnths mgfa _Iyear* _Istate* _IstaXt_* , cluster(state);

Linear regression                                      Number of obs =     850
                                                       F( 15,    49) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.9875
                                                       Root MSE      =  .20554

                                 (Std. Err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        mgfa |  -.0709963   .0954669    -0.74   0.461    -.2628442    .1208515
   _Iyear_75 |  (dropped)
   _Iyear_76 |  (dropped)
   _Iyear_80 |   .0304805   .0326381     0.93   0.355    -.0351083    .0960693
   _Iyear_81 |   .0655127   .0527003     1.24   0.220    -.0403926    .1714179
   _Iyear_82 |   .0830144   .0569024     1.46   0.151    -.0313352     .197364
   _Iyear_83 |   .1674223   .0506044     3.31   0.002     .0657291    .2691156
   _Iyear_84 |    .591854   .0486526    12.16   0.000     .4940829    .6896251
   _Iyear_85 |   .8653576   .0557226    15.53   0.000     .7533788    .9773364
   _Iyear_86 |    1.01789   .0535844    19.00   0.000     .9102084    1.125572
   _Iyear_87 |   1.195121   .0583988    20.46   0.000     1.077764    1.312478
   _Iyear_88 |   1.564679   .0421724    37.10   0.000      1.47993    1.649427
   _Iyear_89 |   1.705704   .0377781    45.15   0.000     1.629786    1.781622
   _Iyear_90 |   1.794327    .044687    40.15   0.000     1.704525    1.884129
   _Iyear_91 |   1.869856   .0418706    44.66   0.000     1.785713    1.953998
   _Iyear_92 |   2.060879   .0363638    56.67   0.000     1.987803    2.133954
   _Iyear_93 |   2.379687   .0343563    69.26   0.000     2.310645    2.448728
   _Iyear_94 |   2.577884   .0337259    76.44   0.000     2.510109    2.645659
   _Iyear_95 |   2.729064   .0343114    79.54   0.000     2.660113    2.798016
   _Iyear_96 |  (dropped)
   _Iyear_97 |  (dropped)
  _Istate_12 |   .7378981   .0954669     7.73   0.000     .5460502    .9297459
  _Istate_13 |  -1.775513          .        .       .            .           .
  _Istate_14 |   3.816792   .0954669    39.98   0.000     3.624944    4.008639
  _Istate_15 |   1.326149          .        .       .            .           .
  _Istate_16 |   3.221896   .0730041    44.13   0.000     3.075188    3.368603
  _Istate_21 |   4.899476          .        .       .            .           .
  _Istate_22 |   3.747085          .        .       .            .           .
  _Istate_23 |   3.785124          .        .       .            .           .
  _Istate_31 |     3.5047          .        .       .            .           .
  _Istate_32 |   2.393871          .        .       .            .           .
  _Istate_33 |   3.763679          .        .       .            .           .
  _Istate_34 |   3.354933          .        .       .            .           .
  _Istate_35 |   2.901133          .        .       .            .           .
  _Istate_41 |   3.183983          .        .       .            .           .
  _Istate_42 |   1.508805          .        .       .            .           .
  _Istate_43 |   2.829002          .        .       .            .           .
  _Istate_44 |   -1.65218          .        .       .            .           .
  _Istate_45 |     -.9608          .        .       .            .           .
  _Istate_46 |   1.159621          .        .       .            .           .
  _Istate_47 |   .9016201          .        .       .            .           .
  _Istate_51 |    1.38955   .0322903    43.03   0.000     1.324661     1.45444
  _Istate_52 |    2.85317          .        .       .            .           .
  _Istate_54 |   2.800225          .        .       .            .           .
  _Istate_55 |   .6746854          .        .       .            .           .
  _Istate_56 |   2.252071          .        .       .            .           .
  _Istate_57 |   1.407388          .        .       .            .           .
  _Istate_58 |   2.868034          .        .       .            .           .
  _Istate_59 |   3.524238          .        .       .            .           .
  _Istate_61 |   1.674595          .        .       .            .           .
  _Istate_62 |   2.120784          .        .       .            .           .
  _Istate_63 |   1.185741   .0252706    46.92   0.000     1.134957    1.236524
  _Istate_64 |  -.7146377          .        .       .            .           .
  _Istate_71 |   .4783685          .        .       .            .           .
  _Istate_72 |   2.978876          .        .       .            .           .
  _Istate_73 |   2.300982   .0231648    99.33   0.000     2.254431    2.347534
  _Istate_74 |   3.981867          .        .       .            .           .
  _Istate_81 |  -2.040123   .0343962   -59.31   0.000    -2.109245   -1.971001
  _Istate_82 |  -.5849823   .0343962   -17.01   0.000    -.6541039   -.5158606
  _Istate_83 |  -1.352272   .0203569   -66.43   0.000    -1.393181   -1.311363
  _Istate_84 |   2.735552          .        .       .            .           .
  _Istate_85 |   .4327405          .        .       .            .           .
  _Istate_86 |   2.402621   .0077216   311.16   0.000     2.387103    2.418138
  _Istate_87 |   .5091479          .        .       .            .           .
  _Istate_88 |   .4440889   .0252706    17.57   0.000     .3933057    .4948722
  _Istate_91 |   2.260736          .        .       .            .           .
  _Istate_92 |   1.709494          .        .       .            .           .
  _Istate_93 |   5.313173   .0730041    72.78   0.000     5.166466     5.45988
  _Istate_94 |  -1.154348    .018251   -63.25   0.000    -1.191025   -1.117671
  _Istate_95 |   .9765916          .        .       .            .           .
  _IstaXt_12 |  -.0245377          .        .       .            .           .
  _IstaXt_13 |   .0461856          .        .       .            .           .
  _IstaXt_14 |  -.1082462          .        .       .            .           .
  _IstaXt_15 |  -.0631772          .        .       .            .           .
  _IstaXt_16 |  -.1230846   .0018719   -65.75   0.000    -.1268464   -.1193229
  _IstaXt_21 |   -.129131          .        .       .            .           .
  _IstaXt_22 |  -.1120048          .        .       .            .           .
  _IstaXt_23 |  -.0974829          .        .       .            .           .
  _IstaXt_31 |  -.0498675          .        .       .            .           .
  _IstaXt_32 |  -.0331202          .        .       .            .           .
  _IstaXt_33 |   -.059877          .        .       .            .           .
  _IstaXt_34 |  -.0497869          .        .       .            .           .
  _IstaXt_35 |  -.0755898          .        .       .            .           .
  _IstaXt_41 |   -.091175          .        .       .            .           .
  _IstaXt_42 |  -.0635208          .        .       .            .           .
  _IstaXt_43 |  -.0801501          .        .       .            .           .
  _IstaXt_44 |   -.032656          .        .       .            .           .
  _IstaXt_45 |   -.032368          .        .       .            .           .
  _IstaXt_46 |  -.0376509          .        .       .            .           .
  _IstaXt_47 |  -.0013019          .        .       .            .           .
  _IstaXt_51 |  -.0871611   .0060837   -14.33   0.000    -.0993867   -.0749355
  _IstaXt_52 |  -.0829779          .        .       .            .           .
  _IstaXt_54 |   -.060336          .        .       .            .           .
  _IstaXt_55 |  -.0773125          .        .       .            .           .
  _IstaXt_56 |   .0003588          .        .       .            .           .
  _IstaXt_57 |   .0186483          .        .       .            .           .
  _IstaXt_58 |  -.0352676          .        .       .            .           .
  _IstaXt_59 |  -.0062965          .        .       .            .           .
  _IstaXt_61 |  -.0270165          .        .       .            .           .
  _IstaXt_62 |  -.0048108          .        .       .            .           .
  _IstaXt_63 |   .0156437   .0084235     1.86   0.069    -.0012841    .0325714
  _IstaXt_64 |   .0853236          .        .       .            .           .
  _IstaXt_71 |   .0535251          .        .       .            .           .
  _IstaXt_72 |  -.1034155          .        .       .            .           .
  _IstaXt_73 |  -.0742337    .000702  -105.75   0.000    -.0756444   -.0728231
  _IstaXt_74 |  -.0435428          .        .       .            .           .
  _IstaXt_81 |   .0513185   .0049137    10.44   0.000      .041444     .061193
  _IstaXt_82 |   .0042605   .0081896     0.52   0.605     -.012197     .020718
  _IstaXt_83 |  -.0389096   .0035098   -11.09   0.000    -.0459628   -.0318563
  _IstaXt_84 |  -.0814863          .        .       .            .           .
  _IstaXt_85 |  -.0159881          .        .       .            .           .
  _IstaXt_86 |  -.0344579   .0077216    -4.46   0.000     -.049975   -.0189408
  _IstaXt_87 |   .0387699          .        .       .            .           .
  _IstaXt_88 |  -.0084356   .0084235    -1.00   0.322    -.0253634    .0084921
  _IstaXt_91 |  -.0553539          .        .       .            .           .
  _IstaXt_92 |  -.0276636          .        .       .            .           .
  _IstaXt_93 |  -.0993019   .0018719   -53.05   0.000    -.1030636   -.0955402
  _IstaXt_94 |  -.0276076   .0060837    -4.54   0.000    -.0398332    -.015382
  _IstaXt_95 |  -.0839574          .        .       .            .           .
       _cons |   6.244865   .0329395   189.59   0.000      6.17867    6.311059
------------------------------------------------------------------------------

. reg lnths mico mppa mgfa _Iyear* _Istate* , cluster(state);

Linear regression                                      Number of obs =     850
                                                       F( 18,    49) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.9691
                                                       Root MSE      =  .31329

                                 (Std. Err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        mico |   .0961488   .0994013     0.97   0.338    -.1036055    .2959031
        mppa |   .1260565   .0942726     1.34   0.187    -.0633915    .3155044
        mgfa |   .0999994   .1134145     0.88   0.382    -.1279156    .3279144
   _Iyear_75 |  (dropped)
   _Iyear_76 |  (dropped)
   _Iyear_80 |  -.0358566   .0328826    -1.09   0.281    -.1019367    .0302234
   _Iyear_81 |  -.0483142   .0525013    -0.92   0.362    -.1538195     .057191
   _Iyear_82 |  -.0811241   .0572279    -1.42   0.163    -.1961279    .0338798
   _Iyear_83 |  -.0649326   .0616708    -1.05   0.298    -.1888647    .0589995
   _Iyear_84 |   .3031211   .0655325     4.63   0.000     .1714287    .4348135
   _Iyear_85 |   .4956304   .0863091     5.74   0.000     .3221859    .6690749
   _Iyear_86 |   .5943062   .0930255     6.39   0.000     .4073644    .7812479
   _Iyear_87 |   .7095152   .0994195     7.14   0.000     .5097241    .9093062
   _Iyear_88 |   1.035601   .1007948    10.27   0.000     .8330466    1.238156
   _Iyear_89 |   1.127042   .1025904    10.99   0.000     .9208784    1.333205
   _Iyear_90 |    1.17514   .1150188    10.22   0.000     .9440012    1.406279
   _Iyear_91 |   1.210144   .1193542    10.14   0.000      .970293    1.449996
   _Iyear_92 |   1.357223   .1241902    10.93   0.000     1.107653    1.606793
   _Iyear_93 |   1.635507   .1225981    13.34   0.000     1.389137    1.881877
   _Iyear_94 |   1.789759   .1299051    13.78   0.000     1.528705    2.050813
   _Iyear_95 |   1.900415   .1328531    14.30   0.000     1.633437    2.167393
   _Iyear_96 |  (dropped)
   _Iyear_97 |  (dropped)
  _Istate_12 |   .2709084   .1582721     1.71   0.093    -.0471514    .5889681
  _Istate_13 |  -1.400059   .0744913   -18.79   0.000    -1.549755   -1.250363
  _Istate_14 |   2.603841   .1551536    16.78   0.000     2.292048    2.915634
  _Istate_15 |   .8537032   .0994013     8.59   0.000     .6539489    1.053458
  _Istate_16 |    1.86849   .1408801    13.26   0.000     1.585381    2.151599
  _Istate_21 |   3.754265   .0175414   214.02   0.000     3.719014    3.789516
  _Istate_22 |   2.654335   .1053187    25.20   0.000     2.442689    2.865981
  _Istate_23 |    2.87787   .1573366    18.29   0.000     2.561691     3.19405
  _Istate_31 |   3.058029   .0235585   129.81   0.000     3.010687    3.105372
  _Istate_32 |   2.014979   .1178676    17.10   0.000     1.778115    2.251843
  _Istate_33 |    3.09873   .0942726    32.87   0.000     2.909282    3.288178
  _Istate_34 |    2.78645      .0963    28.94   0.000     2.592928    2.979973
  _Istate_35 |   2.136118   .1053187    20.28   0.000     1.924472    2.347764
  _Istate_41 |    2.31188   .0667147    34.65   0.000     2.177812    2.445948
  _Istate_42 |    .900798   .0879322    10.24   0.000     .7240916    1.077504
  _Istate_43 |   2.088298    .101806    20.51   0.000     1.883712    2.292885
  _Istate_44 |  -1.984541   .0654052   -30.34   0.000    -2.115978   -1.853104
  _Istate_45 |  -1.288809   .0563742   -22.86   0.000    -1.402097   -1.175521
  _Istate_46 |   .7766497   .0615118    12.63   0.000     .6530371    .9002623
  _Istate_47 |   .8069555   .0965795     8.36   0.000     .6128717    1.001039
  _Istate_51 |   .6610152    .105409     6.27   0.000     .4491879    .8728425
  _Istate_52 |   2.029078   .1000721    20.28   0.000     1.827975     2.23018
  _Istate_54 |   2.198258   .0719688    30.54   0.000     2.053632    2.342885
  _Istate_55 |  -.1075929   .1141392    -0.94   0.350    -.3369643    .1217784
  _Istate_56 |   2.269883   .1321947    17.17   0.000     2.004227    2.535538
  _Istate_57 |   1.538904   .0879322    17.50   0.000     1.362197     1.71561
  _Istate_58 |   2.646775   .0994013    26.63   0.000      2.44702    2.846529
  _Istate_59 |   3.563718   .0994013    35.85   0.000     3.363964    3.763472
  _Istate_61 |   1.357674   .0825914    16.44   0.000       1.1917    1.523648
  _Istate_62 |   1.999817   .0711493    28.11   0.000     1.856837    2.142797
  _Istate_63 |   1.281253    .079637    16.09   0.000     1.121217     1.44129
  _Istate_64 |    .082688   .1246637     0.66   0.510     -.167833    .3332091
  _Istate_71 |   .8697322   .1019044     8.53   0.000     .6649477    1.074517
  _Istate_72 |   2.144285   .0994013    21.57   0.000     1.944531    2.344039
  _Istate_73 |   1.550797   .0403847    38.40   0.000     1.469641    1.631953
  _Istate_74 |   3.534936   .0845614    41.80   0.000     3.365003    3.704868
  _Istate_81 |  -1.792471    .139069   -12.89   0.000    -2.071941   -1.513002
  _Istate_82 |  -.7431042   .0974752    -7.62   0.000    -.9389879   -.5472205
  _Istate_83 |  -1.740546   .0607691   -28.64   0.000    -1.862666   -1.618426
  _Istate_84 |   1.943233   .0719688    27.00   0.000     1.798606    2.087859
  _Istate_85 |   .1981073   .0741659     2.67   0.010     .0490653    .3471493
  _Istate_86 |   1.922912   .0964739    19.93   0.000     1.729041    2.116784
  _Istate_87 |   .8457616   .0647856    13.05   0.000       .71557    .9759533
  _Istate_88 |   .2112833      .0918     2.30   0.026     .0268043    .3957623
  _Istate_91 |    1.67357   .0665454    25.15   0.000     1.539842    1.807298
  _Istate_92 |   1.334465   .0942726    14.16   0.000     1.145017    1.523913
  _Istate_93 |   4.132462   .1292289    31.98   0.000     3.872767    4.392158
  _Istate_94 |  -1.585106   .1032348   -15.35   0.000    -1.792564   -1.377647
  _Istate_95 |   .1567548   .0986549     1.59   0.119    -.0414997    .3550093
       _cons |   6.595513   .0994967    66.29   0.000     6.395567     6.79546
------------------------------------------------------------------------------

. reg lnths mico mppa mgfa _Iyear* _Istate* _IstaXt_* , cluster(state);

Linear regression                                      Number of obs =     850
                                                       F( 17,    49) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.9878
                                                       Root MSE      =  .20363

                                 (Std. Err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        mico |   .1374282   .0617569     2.23   0.031     .0133231    .2615333
        mppa |  -.0225254   .0582912    -0.39   0.701    -.1396659     .094615
        mgfa |  -.0787631   .0927979    -0.85   0.400    -.2652476    .1077213
   _Iyear_75 |  (dropped)
   _Iyear_76 |  (dropped)
   _Iyear_80 |   .0335385   .0312465     1.07   0.288    -.0292538    .0963307
   _Iyear_81 |   .0722644    .054269     1.33   0.189    -.0367932    .1813221
   _Iyear_82 |   .0904163    .057519     1.57   0.122    -.0251725     .206005
   _Iyear_83 |   .1539363    .050889     3.02   0.004     .0516711    .2562015
   _Iyear_84 |   .5774657   .0502711    11.49   0.000     .4764421    .6784892
   _Iyear_85 |   .8411854     .05796    14.51   0.000     .7247105    .9576603
   _Iyear_86 |   .9923652   .0581129    17.08   0.000      .875583    1.109148
   _Iyear_87 |   1.162606   .0612425    18.98   0.000     1.039535    1.285677
   _Iyear_88 |   1.532503   .0449303    34.11   0.000     1.442213    1.622794
   _Iyear_89 |   1.683325   .0409703    41.09   0.000     1.600992    1.765658
   _Iyear_90 |    1.77749   .0480664    36.98   0.000     1.680897    1.874083
   _Iyear_91 |    1.85856    .043357    42.87   0.000     1.771431    1.945689
   _Iyear_92 |    2.05528   .0373913    54.97   0.000     1.980139     2.13042
   _Iyear_93 |   2.379629   .0350995    67.80   0.000     2.309094    2.450164
   _Iyear_94 |   2.583523   .0345223    74.84   0.000     2.514148    2.652898
   _Iyear_95 |   2.740245    .034752    78.85   0.000     2.670408    2.810082
   _Iyear_96 |  (dropped)
   _Iyear_97 |  (dropped)
  _Istate_12 |   .9500805   .1510251     6.29   0.000     .6465842    1.253577
  _Istate_13 |   -1.63111   .0645135   -25.28   0.000    -1.760755   -1.501466
  _Istate_14 |   4.023674   .1440251    27.94   0.000     3.734245    4.313103
  _Istate_15 |   1.463578   .0617569    23.70   0.000     1.339473    1.587683
  _Istate_16 |   3.393604   .1185249    28.63   0.000     3.155419    3.631789
  _Istate_21 |    4.98739   .0395062   126.24   0.000     4.907999    5.066781
  _Istate_22 |   3.912854   .0902373    43.36   0.000     3.731515    4.094192
  _Istate_23 |   3.945078   .0962728    40.98   0.000     3.751611    4.138546
  _Istate_31 |   3.596754   .0437882    82.14   0.000     3.508758     3.68475
  _Istate_32 |   2.590203   .1099965    23.55   0.000     2.369157    2.811249
  _Istate_33 |   3.786204   .0582912    64.95   0.000     3.669064    3.903345
  _Istate_34 |   3.409795    .063976    53.30   0.000      3.28123     3.53836
  _Istate_35 |   3.066902   .0902373    33.99   0.000     2.885563     3.24824
  _Istate_41 |   3.290997   .0480008    68.56   0.000     3.194536    3.387458
  _Istate_42 |   1.680789   .0768903    21.86   0.000     1.526272    1.835306
  _Istate_43 |    2.88882   .0267375   108.04   0.000     2.835089    2.942551
  _Istate_44 |  -1.526778   .0565907   -26.98   0.000    -1.640501   -1.413054
  _Istate_45 |  -.8569325   .0480886   -17.82   0.000    -.9535702   -.7602948
  _Istate_46 |   1.264813   .0478831    26.41   0.000     1.168589    1.361038
  _Istate_47 |   1.045407   .0748487    13.97   0.000     .8949933    1.195821
  _Istate_51 |   1.524352   .0667642    22.83   0.000     1.390184    1.658519
  _Istate_52 |   3.014136   .0819458    36.78   0.000      2.84946    3.178812
  _Istate_54 |   2.909558   .0488132    59.61   0.000     2.811465    3.007652
  _Istate_55 |   .8599015    .105724     8.13   0.000     .6474412    1.072362
  _Istate_56 |   2.387677   .0605788    39.41   0.000      2.26594    2.509415
  _Istate_57 |   1.579372   .0768903    20.54   0.000     1.424856    1.733889
  _Istate_58 |   3.005462   .0617569    48.67   0.000     2.881357    3.129567
  _Istate_59 |   3.661666   .0617569    59.29   0.000     3.537561    3.785771
  _Istate_61 |   1.790057   .0541964    33.03   0.000     1.681145    1.898969
  _Istate_62 |   2.183418    .028541    76.50   0.000     2.126063    2.240773
  _Istate_63 |   1.357491   .0797844    17.01   0.000     1.197158    1.517824
  _Istate_64 |  -.5831722   .0592248    -9.85   0.000    -.7021889   -.4641554
  _Istate_71 |    .626959   .0835174     7.51   0.000     .4591244    .7947936
  _Istate_72 |   3.116304   .0617569    50.46   0.000     2.992199    3.240409
  _Istate_73 |   2.294751   .0307068    74.73   0.000     2.233043    2.356459
  _Istate_74 |   4.131405   .0675315    61.18   0.000     3.995695    4.267114
  _Istate_81 |  -1.846293   .1080316   -17.09   0.000    -2.063391   -1.629195
  _Istate_82 |  -.5652552   .0670396    -8.43   0.000    -.6999763    -.430534
  _Istate_83 |    -1.2135   .0652632   -18.59   0.000    -1.344652   -1.082349
  _Istate_84 |   2.844885   .0488132    58.28   0.000     2.746791    2.942979
  _Istate_85 |   .4693829   .0206846    22.69   0.000     .4278156    .5109501
  _Istate_86 |   2.511326   .0487173    51.55   0.000     2.413425    2.609227
  _Istate_87 |   .6637228    .070063     9.47   0.000      .522926    .8045196
  _Istate_88 |    .554182   .0544197    10.18   0.000     .4448215    .6635424
  _Istate_91 |    2.26173   .0025717   879.48   0.000     2.256562    2.266898
  _Istate_92 |   1.732019   .0582912    29.71   0.000     1.614879     1.84916
  _Istate_93 |   5.341638    .092082    58.01   0.000     5.156592    5.526683
  _Istate_94 |  -1.045848   .0526583   -19.86   0.000    -1.151669   -.9400276
  _Istate_95 |   1.147398   .0816288    14.06   0.000     .9833588    1.311437
  _IstaXt_12 |  -.0366638   .0054491    -6.73   0.000    -.0476142   -.0257133
  _IstaXt_13 |   .0370024   .0059737     6.19   0.000     .0249978     .049007
  _IstaXt_14 |  -.1199306   .0052384   -22.89   0.000    -.1304576   -.1094035
  _IstaXt_15 |  -.0631772          .        .       .            .           .
  _IstaXt_16 |  -.1336062   .0049726   -26.87   0.000     -.143599   -.1236134
  _IstaXt_21 |  -.1362045   .0031787   -42.85   0.000    -.1425922   -.1298167
  _IstaXt_22 |  -.1226786   .0047953   -25.58   0.000    -.1323152   -.1130421
  _IstaXt_23 |  -.0974829          .        .       .            .           .
  _IstaXt_31 |  -.0571067   .0033266   -17.17   0.000    -.0637916   -.0504217
  _IstaXt_32 |  -.0452463   .0054491    -8.30   0.000    -.0561967   -.0342958
  _IstaXt_33 |   -.059877          .        .       .            .           .
  _IstaXt_34 |  -.0524816   .0012109   -43.34   0.000     -.054915   -.0500482
  _IstaXt_35 |  -.0862637   .0047953   -17.99   0.000    -.0959002   -.0766271
  _IstaXt_41 |  -.0980004   .0054083   -18.12   0.000    -.1088687    -.087132
  _IstaXt_42 |  -.0738249   .0061028   -12.10   0.000    -.0860889    -.061561
  _IstaXt_43 |  -.0752967   .0052682   -14.29   0.000    -.0858836   -.0647099
  _IstaXt_44 |  -.0407735   .0058078    -7.02   0.000    -.0524447   -.0291023
  _IstaXt_45 |  -.0391381   .0055116    -7.10   0.000    -.0502141   -.0280621
  _IstaXt_46 |  -.0444211   .0055116    -8.06   0.000     -.055497   -.0333451
  _IstaXt_47 |  -.0105788   .0044332    -2.39   0.021    -.0194876     -.00167
  _IstaXt_51 |  -.0866661   .0059136   -14.66   0.000      -.09855   -.0747823
  _IstaXt_52 |  -.0932653   .0048402   -19.27   0.000     -.102992   -.0835386
  _IstaXt_54 |  -.0672718   .0052073   -12.92   0.000    -.0777362   -.0568073
  _IstaXt_55 |  -.0891017   .0052978   -16.82   0.000    -.0997479   -.0784554
  _IstaXt_56 |   .0021807   .0047147     0.46   0.646    -.0072939    .0116553
  _IstaXt_57 |   .0083442   .0061028     1.37   0.178    -.0039198    .0206082
  _IstaXt_58 |  -.0352676          .        .       .            .           .
  _IstaXt_59 |  -.0062965          .        .       .            .           .
  _IstaXt_61 |  -.0343387   .0045754    -7.51   0.000    -.0435334   -.0251441
  _IstaXt_62 |  -.0082071   .0042386    -1.94   0.059    -.0167249    .0003108
  _IstaXt_63 |    .004203   .0094273     0.45   0.658    -.0147419    .0231478
  _IstaXt_64 |   .0873112   .0051433    16.98   0.000     .0769753    .0976471
  _IstaXt_71 |   .0438618   .0043545    10.07   0.000     .0351112    .0526124
  _IstaXt_72 |  -.1034155          .        .       .            .           .
  _IstaXt_73 |  -.0723585   .0050431   -14.35   0.000     -.082493    -.062224
  _IstaXt_74 |   -.053002   .0055758    -9.51   0.000     -.064207    -.041797
  _IstaXt_81 |   .0400339   .0067622     5.92   0.000     .0264447    .0536231
  _IstaXt_82 |   .0049268   .0079606     0.62   0.539    -.0110707    .0209242
  _IstaXt_83 |  -.0478072   .0066715    -7.17   0.000    -.0612141   -.0344004
  _IstaXt_84 |   -.088422   .0052073   -16.98   0.000    -.0988865   -.0779576
  _IstaXt_85 |  -.0172473    .003563    -4.84   0.000    -.0244074   -.0100872
  _IstaXt_86 |  -.0407655   .0088676    -4.60   0.000    -.0585856   -.0229453
  _IstaXt_87 |    .028913   .0061592     4.69   0.000     .0165356    .0412904
  _IstaXt_88 |  -.0148517   .0092721    -1.60   0.116    -.0334848    .0037813
  _IstaXt_91 |  -.0536976   .0042861   -12.53   0.000    -.0623109   -.0450843
  _IstaXt_92 |  -.0276636          .        .       .            .           .
  _IstaXt_93 |  -.0991496   .0018196   -54.49   0.000    -.1028062    -.095493
  _IstaXt_94 |  -.0339381   .0077745    -4.37   0.000    -.0495616   -.0183145
  _IstaXt_95 |  -.0945871   .0052903   -17.88   0.000    -.1052184   -.0839559
       _cons |   6.117107   .0678351    90.18   0.000     5.980788    6.253427
------------------------------------------------------------------------------

. 
end of do-file


. exit, clear
