-------------------------------------------------------------------------------
       log:  C:\Documents and Settings\jwang\Desktop\table 2\TabOccTraining_tab
> le2.log
  log type:  text
 opened on:  30 May 2008, 13:16:27

. set mem 25m;

Current memory allocation

                    current                                 memory usage
    settable          value     description                 (1M = 1024k)
    --------------------------------------------------------------------
    set maxvar         5000     max. variables allowed           1.909M
    set memory           25M    max. data space                 25.000M
    set matsize         400     max. RHS vars in models          1.254M
                                                            -----------
                                                                28.163M

. use tempshare-occ8090;
(share in occ who are temps)

. use tempshare-occ8090;
(share in occ who are temps)

. merge occ8090 using trainfreq-occ8090;

. keep if _merge==3;
(7 observations deleted)

. replace tempshare=tempshare*100;
(226 real changes made)

. ***********************;
. * Table2: 3 digit occs
> ***********************;
. summ [aw=occwt];

    Variable |     Obs      Weight        Mean   Std. Dev.       Min        Max
-------------+-----------------------------------------------------------------
     occ8090 |     485  .999834709    354.6076   251.3545          3        889
   tempshare |     485  .999834709    .9272834   1.385123          0   14.39555
       occwt |     485  .999834709    .0130475   .0183738   .0000116   .0721119
       tenyr |     485  .999834709    7.141197   2.580496   .6666667       31.5
      tktrnd |     485  .999834709    .4223806    .209281          0          1
-------------+-----------------------------------------------------------------
   typtrnsch |     485  .999834709    .1373076   .1351307          0          1
   typtrnemp |     485  .999834709    .1646148   .1208143          0          1
   typtrnojt |     485  .999834709    .1552646   .0694479          0          1
   typtrnoth |     485  .999834709    .0783601   .0716928          0          1
   schoollen |     485  .999834709    2.352436   2.833061          0         39
-------------+-----------------------------------------------------------------
      emplen |     485  .999834709    1.404291   1.440535          0         39
      suppwt |     485  .999834709     1303806    1782275   784.2086    6965097
      _merge |     485  .999834709           3          0          3          3

. reg tempshare tktrnd [aw=occwt];
(sum of wgt is   9.9983e-01)

      Source |       SS       df       MS              Number of obs =     485
-------------+------------------------------           F(  1,   483) =   16.84
       Model |  31.2924162     1  31.2924162           Prob > F      =  0.0000
    Residual |  897.293686   483   1.8577509           R-squared     =  0.0337
-------------+------------------------------           Adj R-squared =  0.0317
       Total |  928.586102   484  1.91856633           Root MSE      =   1.363

------------------------------------------------------------------------------
   tempshare |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      tktrnd |  -1.214974   .2960337    -4.10   0.000    -1.796647   -.6333011
       _cons |   1.440465   .1395176    10.32   0.000     1.166329    1.714601
------------------------------------------------------------------------------

. reg tempshare tenyr [aw=occwt];
(sum of wgt is   9.9983e-01)

      Source |       SS       df       MS              Number of obs =     485
-------------+------------------------------           F(  1,   483) =   13.69
       Model |  25.5936724     1  25.5936724           Prob > F      =  0.0002
    Residual |   902.99243   483  1.86954954           R-squared     =  0.0276
-------------+------------------------------           Adj R-squared =  0.0255
       Total |  928.586102   484  1.91856633           Root MSE      =  1.3673

------------------------------------------------------------------------------
   tempshare |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       tenyr |  -.0891129   .0240848    -3.70   0.000    -.1364367    -.041789
       _cons |   1.563656   .1828571     8.55   0.000     1.204362     1.92295
------------------------------------------------------------------------------

. reg tempshare tktrnd tenyr [aw=occwt];
(sum of wgt is   9.9983e-01)

      Source |       SS       df       MS              Number of obs =     485
-------------+------------------------------           F(  2,   482) =   11.21
       Model |  41.2786162     2  20.6393081           Prob > F      =  0.0000
    Residual |  887.307486   482   1.8408869           R-squared     =  0.0445
-------------+------------------------------           Adj R-squared =  0.0405
       Total |  928.586102   484  1.91856633           Root MSE      =  1.3568

------------------------------------------------------------------------------
   tempshare |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      tktrnd |  -.9309301   .3189254    -2.92   0.004    -1.557586   -.3042742
       tenyr |  -.0602424   .0258652    -2.33   0.020    -.1110649   -.0094199
       _cons |   1.750693   .1924316     9.10   0.000     1.372585    2.128802
------------------------------------------------------------------------------

. reg tempshare typtrnsch tenyr [aw=occwt];
(sum of wgt is   9.9983e-01)

      Source |       SS       df       MS              Number of obs =     485
-------------+------------------------------           F(  2,   482) =   11.48
       Model |  42.2125877     2  21.1062938           Prob > F      =  0.0000
    Residual |  886.373515   482   1.8389492           R-squared     =  0.0455
-------------+------------------------------           Adj R-squared =  0.0415
       Total |  928.586102   484  1.91856633           Root MSE      =  1.3561

------------------------------------------------------------------------------
   tempshare |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   typtrnsch |  -1.462896   .4866279    -3.01   0.003     -2.41907   -.5067219
       tenyr |  -.0624282   .0254828    -2.45   0.015    -.1124994    -.012357
       _cons |   1.573962   .1813868     8.68   0.000     1.217555    1.930369
------------------------------------------------------------------------------

. reg tempshare typtrnemp tenyr [aw=occwt];
(sum of wgt is   9.9983e-01)

      Source |       SS       df       MS              Number of obs =     485
-------------+------------------------------           F(  2,   482) =    7.70
       Model |  28.7595988     2  14.3797994           Prob > F      =  0.0005
    Residual |  899.826504   482  1.86685997           R-squared     =  0.0310
-------------+------------------------------           Adj R-squared =  0.0270
       Total |  928.586102   484  1.91856633           Root MSE      =  1.3663

------------------------------------------------------------------------------
   tempshare |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   typtrnemp |  -.7025944   .5395232    -1.30   0.193    -1.762702    .3575136
       tenyr |  -.0791269   .0252595    -3.13   0.002    -.1287593   -.0294945
       _cons |   1.608001   .1858715     8.65   0.000     1.242783     1.97322
------------------------------------------------------------------------------

. reg tempshare typtrnojt tenyr [aw=occwt];
(sum of wgt is   9.9983e-01)

      Source |       SS       df       MS              Number of obs =     485
-------------+------------------------------           F(  2,   482) =    7.08
       Model |  26.4983302     2  13.2491651           Prob > F      =  0.0009
    Residual |  902.087772   482  1.87155139           R-squared     =  0.0285
-------------+------------------------------           Adj R-squared =  0.0245
       Total |  928.586102   484  1.91856633           Root MSE      =   1.368

------------------------------------------------------------------------------
   tempshare |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   typtrnojt |   .6344675    .912574     0.70   0.487    -1.158647    2.427582
       tenyr |  -.0924096   .0245598    -3.76   0.000     -.140667   -.0441522
       _cons |   1.488688   .2123664     7.01   0.000      1.07141    1.905966
------------------------------------------------------------------------------

. reg tempshare typtrnoth tenyr [aw=occwt];
(sum of wgt is   9.9983e-01)

      Source |       SS       df       MS              Number of obs =     485
-------------+------------------------------           F(  2,   482) =   22.62
       Model |  79.6622529     2  39.8311264           Prob > F      =  0.0000
    Residual |  848.923849   482   1.7612528           R-squared     =  0.0858
-------------+------------------------------           Adj R-squared =  0.0820
       Total |  928.586102   484  1.91856633           Root MSE      =  1.3271

------------------------------------------------------------------------------
   tempshare |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   typtrnoth |  -4.881127   .8809646    -5.54   0.000    -6.612132   -3.150121
       tenyr |   -.048939   .0244755    -2.00   0.046    -.0970308   -.0008472
       _cons |   1.659252   .1783186     9.30   0.000     1.308874     2.00963
------------------------------------------------------------------------------

. log close;
       log:  C:\Documents and Settings\jwang\Desktop\table 2\TabOccTraining_tab
> le2.log
  log type:  text
 closed on:  30 May 2008, 13:16:27
-------------------------------------------------------------------------------
