
. *-----------------------------------------------------------------------------*
. 
. *5
. set seed 42

. set obs 300
Number of observations (_N) was 0, now 300.

. gen i = _n

. gen g = cond(i <= 100, 2, cond(i <= 200, 3, 4)) 

. expand 4 
(900 observations created)

. bysort i: gen t = _n 

. bysort i: gen alpha = uniform()

. replace alpha = alpha[_n-1] if i == i[_n-1]
(900 real changes made)

. gen tau = 0

. gen D = 0

. foreach t of numlist 1/4 {
  2.     replace D = (t >= g) if t == `t'
  3.     replace tau = cond(t < g, 0, cond(t == g, ///
>     g/2 + rnormal(0, sqrt(0.1)), tau[_n-1] - (t-g)/5 + rnormal(0, 1))) if t == `t'
  4. }
(0 real changes made)
(0 real changes made)
(100 real changes made)
(100 real changes made)
(200 real changes made)
(200 real changes made)
(300 real changes made)
(300 real changes made)

. gen Y = alpha + D * tau + rnormal(0, 1) 

. replace Y = . if t < g - 1
(300 real changes made, 300 to missing)

. 
. *6
. preserve

. collapse Y, by(g t)

. panelview Y, i(g) t(t) type(missing)

   #  Variable        # Missing   % Missing
--------------------------------------------
   1  Y                     3        25.0

Missing for |
   how many |
 variables? |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          9       75.00       75.00
          1 |          3       25.00      100.00
------------+-----------------------------------
      Total |         12      100.00
Note: White cells represent missing values/observations in data.

. graph export "output/6.png", width(4000) replace
file output/6.png saved as PNG format

. restore

. 
. *7
. preserve

. collapse (mean) Y, by(g t)

. twoway (connected Y t if g==2) ///
>            (connected Y t if g==3) ///
>            (connected Y t if g==4), graphregion(color(white)) ///
>            legend(label(1 "G2") label(2 "G3") label(3 "G4"))

. graph export "output/7.png", width(4000) replace
file output/7.png saved as PNG format

. restore

. 
. *8
. est clear

. sum tau

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         tau |      1,200    .5830206     .925645  -3.531475    5.38778

. scalar att = r(mean)

. eststo: reghdfe Y D, absorb(i t) 
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =        900
Absorbing 2 HDFE groups                           F(   1,    596) =     117.81
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.5196
                                                  Adj R-squared   =     0.2753
                                                  Within R-sq.    =     0.1650
                                                  Root MSE        =     1.1985

------------------------------------------------------------------------------
           Y | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
           D |   1.593232   .1467891    10.85   0.000     1.304945    1.881519
       _cons |   .2282893   .1057002     2.16   0.031     .0206991    .4358795
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
           i |       300           0         300     |
           t |         4           1           3     |
-----------------------------------------------------+
(est1 stored)

. estadd scalar true_att = att

added scalar:
           e(true_att) =  .58302057

. 
. *9
. sum tau if g==t

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         tau |        300    1.469086    .4943434   .0374742   2.703476

. scalar attg= r(mean)

. gen D0 = cond(g == t, 1, 0) 

. gen D1= cond(g==t[_n-1], 1, 0) 

. replace D1 = 0 if g==4 & t==1
(100 real changes made)

. eststo: reghdfe Y D0 D1, absorb(i t)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =        900
Absorbing 2 HDFE groups                           F(   2,    595) =      58.88
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.5197
                                                  Adj R-squared   =     0.2743
                                                  Within R-sq.    =     0.1652
                                                  Root MSE        =     1.1994

------------------------------------------------------------------------------
           Y | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          D0 |   1.062155   .0979309    10.85   0.000     .8698222    1.254487
          D1 |    .487903   .1295504     3.77   0.000     .2334713    .7423347
       _cons |   .8279694   .0648323    12.77   0.000     .7006415    .9552974
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
           i |       300           0         300     |
           t |         4           1           3     |
-----------------------------------------------------+
(est2 stored)

. estadd scalar true_att = attg 

added scalar:
           e(true_att) =  1.4690858

. esttab using "output/89.tex", scalar("true_att True ATT") keep(D*) se nodepvar mtitles("TWFE" "DynamicDID") replace
(output written to output/89.tex)

. log close
      name:  <unnamed>
       log:  C:\Users\chadi\OneDrive - Handelsh√∂gskolan i Stockholm\SU\EC38003\assignments\PS5\log/ps5.log
  log type:  text
 closed on:  15 May 2024, 10:15:16
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
