---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\chadi\OneDrive - HandelshÃ¶gskolan i Stockholm\Resources\EconometricGame2024\log/game.log
  log type:  text
 opened on:  31 May 2024, 14:48:44

. set scheme lean2

. 
. /*
> *data
> import delimited using "Pisa201520182022_GameDataset.csv", clear
> keep if oecd=="Yes"
> gen math = (pv1math + pv2math + pv3math + pv4math + pv5math + pv6math + pv7math + pv8math + pv9math + pv10math)/10
> gen read = (pv1read + pv2read + pv3read + pv4read + pv5read + pv6read + pv7read + pv8read + pv9read + pv10read)/10
> save game.dta, replace
> */
. 
. * Part 1 ==========================================
. use game.dta, replace

. sum math read, d

                            math
-------------------------------------------------------------
      Percentiles      Smallest
 1%     289.8666       114.4724
 5%      337.381       128.0993
10%     366.4194       136.0116       Obs             838,304
25%      421.114       137.7517       Sum of wgt.     838,304

50%     486.3994                      Mean           484.9476
                        Largest       Std. dev.       89.0456
75%     549.0132       825.1857
90%     600.3548       834.4928       Variance        7929.12
95%     628.9671       836.9508       Skewness      -.0327891
99%     679.4565       840.6619       Kurtosis       2.594647

                            read
-------------------------------------------------------------
      Percentiles      Smallest
 1%     262.3959         37.962
 5%     321.1536        54.3059
10%     356.3882         59.522       Obs             838,304
25%     419.4376         70.284       Sum of wgt.     838,304

50%     490.5043                      Mean            486.077
                        Largest       Std. dev.      96.08906
75%     556.0759       816.4406
90%     608.2182       821.8992       Variance       9233.108
95%     636.4364        835.414       Skewness      -.1790057
99%     685.6253       890.1739       Kurtosis       2.645318

. 
. **distribution
. twoway (kdensity math if wave == 2015) ///
>         (kdensity math if wave == 2018) ///
>         (kdensity math if wave == 2022), ///
>   xtitle("Math scores") ///
>   ytitle("Density") ///
>   legend(order(1 "2015" 2 "2018" 3 "2022") rows(1) position(6)) 

.   graph export output/math_kdensity.png, replace
file output/math_kdensity.png saved as PNG format

.   
. twoway (kdensity read if wave == 2015) ///
>         (kdensity read if wave == 2018) ///
>         (kdensity read if wave == 2022), ///
>   xtitle("Reading scores") ///
>   ytitle("Density") ///
>   legend(order(1 "2015" 2 "2018" 3 "2022") rows(1) position(6)) 

.   graph export output/read_kdensity.png, replace
file output/read_kdensity.png saved as PNG format

. 
. **over time
. bys wave: egen wavemath = mean(math)

. bys wave: egen waveread = mean(read)

. twoway (line wavemath wave) (line waveread wave) , title("Mean scores by wave") ytitle("Mean score") xtitle("Wave") legend(label(1 "Math") label(2 "Reading"))xlabel(2015 2018 2022) 

. graph export output/scoresbywave.png, replace
file output/scoresbywave.png saved as PNG format

.   
. **by status
. bys cnt: egen escscnt = mean(escs)
(6,113 missing values generated)

. egen escsgrp = cut(escscnt), group(3)
(6,113 missing values generated)

. sum math read if escsgrp == 0

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        math |    276,847    470.7538    90.89257   128.0993   813.6871
        read |    276,847    473.0972    93.40414    87.2358   803.4537

. sum math read if escsgrp == 1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        math |    267,089    495.5091    86.97216   169.9839   840.6619
        read |    267,089    490.8329    94.21929     37.962   816.4406

. sum math read if escsgrp == 2

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        math |    288,255    490.9271    86.53051   114.4724   834.4928
        read |    288,255    495.6389    98.64595    54.3059   890.1739

. 
. **by parenteduc
. sum math read  if paredint < 15

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        math |    412,992    468.9262    84.23726   128.0993   798.9063
        read |    412,992    471.2504    90.86967     37.962   812.0263

. sum math read  if paredint >= 15

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        math |    425,312    500.5049    90.81259   114.4724   840.6619
        read |    425,312    500.4741    98.79239    54.3059   890.1739

. 
. **by gender
. sum math read  if st004d01t == "Male"

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        math |    421,907    489.1336    92.10871   114.4724   836.9508
        read |    421,907    473.2467     98.4072     37.962   816.4406

. sum math read  if st004d01t == "Female"

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        math |    416,317    480.7057    85.62189   137.7517   840.6619
        read |    416,317    499.0686    91.87019     70.284   890.1739

. 
. * Part 2 ==========================================
. tab st021q01ta

 ST021Q01TA |      Freq.     Percent        Cum.
------------+-----------------------------------
  age 0 - 1 |     13,737       19.69       19.69
      age 1 |      3,336        4.78       24.47
     age 10 |      3,430        4.92       29.39
     age 11 |      3,304        4.74       34.12
     age 12 |      3,705        5.31       39.43
     age 13 |      3,229        4.63       44.06
     age 14 |      3,010        4.31       48.37
     age 15 |      3,085        4.42       52.80
     age 16 |      1,310        1.88       54.67
      age 2 |      4,947        7.09       61.76
      age 3 |      4,795        6.87       68.64
      age 4 |      4,254        6.10       74.73
      age 5 |      4,205        6.03       80.76
      age 6 |      3,780        5.42       86.18
      age 7 |      3,399        4.87       91.05
      age 8 |      3,121        4.47       95.52
      age 9 |      3,124        4.48      100.00
------------+-----------------------------------
      Total |     69,771      100.00

. encode st021q01ta, generate(startage)

. bys wave cnt: egen startingage = mean(startage)
(6,072 missing values generated)

. 
. **score-starting age correlation 
. bys wave cnt: egen mathcnt = mean(math)

. corr mathcnt startage
(obs=69,771)

             |  mathcnt startage
-------------+------------------
     mathcnt |   1.0000
    startage |   0.0528   1.0000


. bys wave cnt: egen readcnt = mean(read)

. corr readcnt startage
(obs=69,771)

             |  readcnt startage
-------------+------------------
     readcnt |   1.0000
    startage |   0.0491   1.0000


. 
. **student characteristics controls
. encode immig, generate(immigs)

. encode st004d01t, gen(gender)

. reg mathcnt startingage age grade immigs escs hisei paredint gender

      Source |       SS           df       MS      Number of obs   =   481,510
-------------+----------------------------------   F(8, 481501)    =  24597.26
       Model |   105597484         8  13199685.5   Prob > F        =    0.0000
    Residual |   258389064   481,501  536.632456   R-squared       =    0.2901
-------------+----------------------------------   Adj R-squared   =    0.2901
       Total |   363986548   481,509  755.928857   Root MSE        =    23.165

------------------------------------------------------------------------------
     mathcnt | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
 startingage |    12.8203   .0385657   332.43   0.000     12.74471    12.89589
         age |  -2.179577   .1187597   -18.35   0.000    -2.412342   -1.946812
       grade |   .6748412    .067213    10.04   0.000     .5431059    .8065766
      immigs |      .6673    .093173     7.16   0.000     .4846838    .8499163
        escs |   16.49543   .0938428   175.78   0.000      16.3115    16.67936
       hisei |  -.3592326   .0028614  -125.55   0.000    -.3648408   -.3536245
    paredint |  -2.407722   .0239501  -100.53   0.000    -2.454664   -2.360781
      gender |     .46901   .0669233     7.01   0.000     .3378424    .6001776
       _cons |   467.3485   1.981082   235.91   0.000     463.4656    471.2314
------------------------------------------------------------------------------

. reg readcnt startingage age grade immigs escs hisei paredint gender

      Source |       SS           df       MS      Number of obs   =   481,510
-------------+----------------------------------   F(8, 481501)    =  24846.65
       Model |  70879713.8         8  8859964.23   Prob > F        =    0.0000
    Residual |   171696455   481,501  356.585875   R-squared       =    0.2922
-------------+----------------------------------   Adj R-squared   =    0.2922
       Total |   242576169   481,509   503.78325   Root MSE        =    18.883

------------------------------------------------------------------------------
     readcnt | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
 startingage |   10.78554   .0314373   343.08   0.000     10.72392    10.84715
         age |  -1.832805   .0968083   -18.93   0.000    -2.022546   -1.643063
       grade |   1.302618   .0547894    23.77   0.000     1.195232    1.410003
      immigs |   .0733647    .075951     0.97   0.334     -.075497    .2222264
        escs |   11.90907    .076497   155.68   0.000     11.75914    12.05901
       hisei |  -.2364674   .0023325  -101.38   0.000     -.241039   -.2318959
    paredint |  -1.699001   .0195232   -87.02   0.000    -1.737265   -1.660736
      gender |   .2304412   .0545533     4.22   0.000     .1235184     .337364
       _cons |    463.655   1.614901   287.11   0.000     460.4898    466.8202
------------------------------------------------------------------------------

. 
. *rule
. label define month 1 "January" 2 "February" 3 "March" 4 "April" 5 "May" 6 "June" 7 "July" 8 "August" 9 "September" 10 "October" 11 "November" 12 "December"

. encode st003d02t, generate(month) label(month) noextend

. bys month cnt: egen startingagemonth = mean(startage)

. label variable startingagemonth "Average Starting Age"

. twoway (scatter startingagemonth month if !missing(month) ), by(cnt) xlabel(1(1)12) xtitle("Birth-Month")

. graph export output/startingrule.png, replace
file output/startingrule.png saved as PNG format

. 
. *Oosterbeek et al. (2021)
. sum startage if cnt == "NLD" & month == 9

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    startage |         93     6.55914    5.713185          1         17

. sum startage if cnt == "NLD" & month == 10

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    startage |         77    7.584416    5.587464          1         17

. sum math read if cnt == "NLD" & month == 9

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        math |      1,215    512.0236     94.8988   233.2671   730.3725
        read |      1,215    493.6222    104.9374   187.0673   756.7308

. sum math read if cnt == "NLD" & month == 10

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        math |      1,283    504.4916    93.09695   257.3381   741.5617
        read |      1,283    481.8891    101.4971   168.9286   732.1696

. binscatter startage month if cnt == "NLD",xlabel(1(1)12)  line(lfit) rd(9) reportreg
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
RD: month<=9

      Source |       SS           df       MS      Number of obs   =       807
-------------+----------------------------------   F(1, 805)       =      1.90
       Model |  58.4322337         1  58.4322337   Prob > F        =    0.1689
    Residual |  24809.7561       805  30.8195728   R-squared       =    0.0023
-------------+----------------------------------   Adj R-squared   =    0.0011
       Total |  24868.1884       806  30.8538317   Root MSE        =    5.5515

------------------------------------------------------------------------------
    startage | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       month |   -.099917   .0725648    -1.38   0.169    -.2423556    .0425217
       _cons |   6.954728   .4115524    16.90   0.000     6.146886    7.762571
------------------------------------------------------------------------------
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
RD: month>9

      Source |       SS           df       MS      Number of obs   =       221
-------------+----------------------------------   F(1, 219)       =      7.72
       Model |  230.906412         1  230.906412   Prob > F        =    0.0059
    Residual |  6549.85377       219  29.9080081   R-squared       =    0.0341
-------------+----------------------------------   Adj R-squared   =    0.0296
       Total |  6780.76018       220  30.8216372   Root MSE        =    5.4688

------------------------------------------------------------------------------
    startage | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       month |  -1.220558   .4392727    -2.78   0.006    -2.086301   -.3548152
       _cons |   19.61266   4.847965     4.05   0.000     10.05802     29.1673
------------------------------------------------------------------------------

. graph export output/Oosterbeek.png, replace
file output/Oosterbeek.png saved as PNG format

. binscatter math read month if cnt == "NLD", xlabel(1(1)12)  line(lfit) rd(9) reportreg
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
RD: month<=9
y_var = math

      Source |       SS           df       MS      Number of obs   =    11,540
-------------+----------------------------------   F(1, 11538)     =      0.04
       Model |  383.704625         1  383.704625   Prob > F        =    0.8357
    Residual |   102910062    11,538  8919.22885   R-squared       =    0.0000
-------------+----------------------------------   Adj R-squared   =   -0.0001
       Total |   102910446    11,539  8918.48914   Root MSE        =    94.442

------------------------------------------------------------------------------
        math | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       month |   .0714361   .3444158     0.21   0.836    -.6036772    .7465495
       _cons |   507.5069   1.942897   261.21   0.000     503.6985    511.3153
------------------------------------------------------------------------------
y_var = read

      Source |       SS           df       MS      Number of obs   =    11,540
-------------+----------------------------------   F(1, 11538)     =      2.59
       Model |  28601.0886         1  28601.0886   Prob > F        =    0.1076
    Residual |   127407347    11,538  11042.4118   R-squared       =    0.0002
-------------+----------------------------------   Adj R-squared   =    0.0001
       Total |   127435949    11,539  11043.9335   Root MSE        =    105.08

------------------------------------------------------------------------------
        read | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       month |   .6167521   .3832228     1.61   0.108    -.1344296    1.367934
       _cons |   479.8147   2.161813   221.95   0.000     475.5772    484.0522
------------------------------------------------------------------------------
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
RD: month>9
y_var = math

      Source |       SS           df       MS      Number of obs   =     3,656
-------------+----------------------------------   F(1, 3654)      =      4.75
       Model |  40833.4415         1  40833.4415   Prob > F        =    0.0294
    Residual |    31410685     3,654  8596.24659   R-squared       =    0.0013
-------------+----------------------------------   Adj R-squared   =    0.0010
       Total |  31451518.5     3,655  8605.06661   Root MSE        =    92.716

------------------------------------------------------------------------------
        math | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       month |  -4.046623   1.856689    -2.18   0.029    -7.686873   -.4063735
       _cons |   546.1062   20.44511    26.71   0.000     506.0213    586.1912
------------------------------------------------------------------------------
y_var = read

      Source |       SS           df       MS      Number of obs   =     3,656
-------------+----------------------------------   F(1, 3654)      =     10.69
       Model |  110461.071         1  110461.071   Prob > F        =    0.0011
    Residual |    37753181     3,654  10332.0145   R-squared       =    0.0029
-------------+----------------------------------   Adj R-squared   =    0.0026
       Total |    37863642     3,655  10359.4096   Root MSE        =    101.65

------------------------------------------------------------------------------
        read | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       month |  -6.655633   2.035529    -3.27   0.001    -10.64652   -2.664748
       _cons |   548.3799   22.41442    24.47   0.000     504.4339     592.326
------------------------------------------------------------------------------

. 
. *empirics
. encode cnt, generate(country)

. mean startage, over(country month) 

Mean estimation                                     Number of obs = 66,381

--------------------------------------------------------------------------
                         |       Mean   Std. err.     [95% conf. interval]
-------------------------+------------------------------------------------
c.startage@country#month |
            AUS#January  |   8.251613   .2239779      7.812616     8.69061
           AUS#February  |    7.25945   .2291634       6.81029     7.70861
              AUS#March  |   7.728788    .222718      7.292261    8.165315
              AUS#April  |   7.674177   .2301002       7.22318    8.125173
                AUS#May  |   7.501672   .2207398      7.069022    7.934322
               AUS#June  |     7.5026   .2229103      7.065695    7.939504
               AUS#July  |   7.849088   .2279321      7.402341    8.295835
             AUS#August  |   8.053797   .2213558       7.61994    8.487655
          AUS#September  |   7.681402   .2188965      7.252365     8.11044
            AUS#October  |   7.592767   .2175252      7.166418    8.019117
           AUS#November  |   7.991896   .2220207      7.556736    8.427057
           AUS#December  |    8.07508   .2210256       7.64187     8.50829
            AUT#January  |   8.610092   .3507503      7.922621    9.297562
           AUT#February  |   8.057851    .459113       7.15799    8.957713
              AUT#March  |   8.651515   .4465387      7.776299    9.526731
              AUT#April  |   8.194118    .387976      7.433685    8.954551
                AUT#May  |   8.185897    .415359      7.371794    9.000001
               AUT#June  |   8.792593   .4867619      7.838539    9.746646
               AUT#July  |   8.044586   .4206945      7.220025    8.869147
             AUT#August  |   9.735294   .4396269      8.873625    10.59696
          AUT#September  |   8.042683   .4013808      7.255977    8.829389
            AUT#October  |        8.5   .4024636      7.711172    9.288828
           AUT#November  |   8.224359   .4312612      7.379087    9.069631
           AUT#December  |   8.487395   .4580175      7.589681    9.385109
            BEL#January  |   7.764706   .3450825      7.088344    8.441068
           BEL#February  |   7.827586   .4261574      6.992318    8.662855
              BEL#March  |   7.367876   .3812052      6.620714    8.115038
              BEL#April  |   7.478495   .3903967      6.713317    8.243672
                BEL#May  |   7.505208   .3881843      6.744367    8.266049
               BEL#June  |   7.683486   .3743442      6.949772    8.417201
               BEL#July  |   7.805825   .3726448      7.075442    8.536209
             BEL#August  |      7.745   .3687544      7.022242    8.467758
          BEL#September  |   7.865591   .3908887       7.09945    8.631733
            BEL#October  |   7.604167   .3773529      6.864555    8.343778
           BEL#November  |   8.518325   .3753087       7.78272    9.253929
           BEL#December  |   8.027933   .4170906      7.210435    8.845431
            CAN#January  |   8.764579   .1629821      8.445134    9.084024
           CAN#February  |   8.260813   .1827855      7.902553    8.619072
              CAN#March  |   8.462441   .1688595      8.131477    8.793406
              CAN#April  |        8.5   .1680522      8.170618    8.829382
                CAN#May  |   8.538186    .175178      8.194837    8.881535
               CAN#June  |   8.100503   .1766798       7.75421    8.446795
               CAN#July  |   8.599089    .172652      8.260691    8.937487
             CAN#August  |   8.437642   .1739384      8.096722    8.778561
          CAN#September  |   8.716507   .1803763       8.36297    9.070045
            CAN#October  |   8.674194   .1722777      8.336529    9.011858
           CAN#November  |   8.362768   .1782736      8.013352    8.712185
           CAN#December  |   8.153754   .1814611      7.798091    8.509418
            CHE#January  |        8.7   .3447251      8.024339    9.375661
           CHE#February  |   7.720379   .3507255      7.032957    8.407801
              CHE#March  |   8.192982   .3644786      7.478604     8.90736
              CHE#April  |   7.104545    .352439      6.413765    7.795326
                CHE#May  |   8.435185   .3547115      7.739951     9.13042
               CHE#June  |          8   .3677554      7.279199    8.720801
               CHE#July  |   8.619469   .3612301      7.911458     9.32748
             CHE#August  |   8.255061   .3364196      7.595678    8.914443
          CHE#September  |   7.606383   .3244048       6.97055    8.242216
            CHE#October  |   8.612782   .3372869        7.9517    9.273864
           CHE#November  |   8.866029   .3812357      8.118807    9.613251
           CHE#December  |    8.28821   .3484921      7.605165    8.971254
            CHL#January  |   7.290323    .649772       6.01677    8.563876
           CHL#February  |   6.564103   .5262316      5.532689    7.595516
              CHL#March  |     7.3875   .5776682       6.25527     8.51973
              CHL#April  |   6.542857   .5736396      5.418524    7.667191
                CHL#May  |   8.758621   .5899493       7.60232    9.914921
               CHL#June  |   6.730159   .6304309      5.494514    7.965803
               CHL#July  |   6.472222    .596997      5.302108    7.642336
             CHL#August  |   7.736842   .6041452      6.552718    8.920967
          CHL#September  |   7.626506    .567695      6.513824    8.739188
            CHL#October  |   7.056818   .5026986      6.071529    8.042107
           CHL#November  |   6.888889   .4691332      5.969388     7.80839
           CHL#December  |   7.101124   .5672463      5.989321    8.212926
            COL#January  |      6.225   .7548879       4.74542     7.70458
           COL#February  |     7.0625   .9179411      5.263336    8.861664
              COL#March  |   5.302326   .6483089       4.03164    6.573011
              COL#April  |       7.12   .7349247      5.679548    8.560452
                COL#May  |   6.255814   .6564216      4.969228      7.5424
               COL#June  |   6.934783   .6784482      5.605024    8.264541
               COL#July  |   6.820513    .780041      5.291633    8.349393
             COL#August  |    7.27907   .8234691       5.66507    8.893069
          COL#September  |    6.26087   .6925656      4.903441    7.618298
            COL#October  |   5.873016   .5484662      4.798022     6.94801
           COL#November  |   6.315789    .658546      5.025039     7.60654
           COL#December  |   7.642857   .6758489      6.318193    8.967521
            CRI#January  |   7.102564   .9270234      5.285599     8.91953
           CRI#February  |   7.571429   .9614646      5.686958    9.455899
              CRI#March  |   7.142857   1.242666      4.707233    9.578481
              CRI#April  |   7.105263   .9517443      5.239845    8.970682
                CRI#May  |   9.310345   1.038784      7.274328    11.34636
               CRI#June  |   6.772727   1.198722      4.423233    9.122222
               CRI#July  |   8.684211   1.142104      6.445687    10.92273
             CRI#August  |          8   1.201119      5.645806    10.35419
          CRI#September  |       6.84   .8498627      5.174269    8.505731
            CRI#October  |   6.641026   .9158134      4.846032     8.43602
           CRI#November  |     8.4375   .9091132      6.655638    10.21936
           CRI#December  |    8.34375   1.065032      6.256288    10.43121
            CZE#January  |   9.627907   .7832856      8.092667    11.16315
           CZE#February  |        8.3   .6553991      7.015418    9.584582
              CZE#March  |   8.241935    .647856      6.972138    9.511733
              CZE#April  |   6.886792   .6965915      5.521473    8.252112
                CZE#May  |    7.69697   .6175256       6.48662     8.90732
               CZE#June  |   8.862069   .6624709      7.563626    10.16051
               CZE#July  |          7   .5663939      5.889868    8.110132
             CZE#August  |   9.368421   .6568664      8.080963    10.65588
          CZE#September  |   7.431818   .7309221      5.999211    8.864425
            CZE#October  |   9.272727   .6892413      7.921815    10.62364
           CZE#November  |   6.738095   .7956469      5.178627    8.297563
           CZE#December  |   6.756098   .7969305      5.194114    8.318081
            DEU#January  |   8.910959   .4331473       8.06199    9.759927
           DEU#February  |   8.885057   .5813702      7.745572    10.02454
              DEU#March  |   7.683673   .4779147      6.746961    8.620386
              DEU#April  |   8.597938   .5090799      7.600142    9.595735
                DEU#May  |   8.282609   .5469645      7.210559    9.354659
               DEU#June  |   7.464646   .5431899      6.399994    8.529299
               DEU#July  |   8.473684   .5127183      7.468756    9.478612
             DEU#August  |   9.057692   .5059074      8.066114    10.04927
          DEU#September  |    9.52381   .5225843      8.499544    10.54807
            DEU#October  |   8.481818   .5115402        7.4792    9.484437
           DEU#November  |   8.841463   .5578461      7.748085    9.934842
           DEU#December  |   8.605263   .6269052      7.376529    9.833997
            DNK#January  |   8.696335   .4036342      7.905212    9.487458
           DNK#February  |   8.491935   .5026152       7.50681    9.477061
              DNK#March  |   7.828767    .460572      6.926046    8.731488
              DNK#April  |    7.89313   .4985301      6.916011    8.870249
                DNK#May  |   7.884354   .4354222      7.030926    8.737781
               DNK#June  |   7.574803   .4634524      6.666437     8.48317
               DNK#July  |   7.530303   .4849623      6.579777    8.480829
             DNK#August  |   7.041379   .4628824       6.13413    7.948629
          DNK#September  |   7.221429    .496138      6.248998    8.193859
            DNK#October  |   7.986014    .449672      7.104657    8.867371
           DNK#November  |   7.669173   .4728589       6.74237    8.595976
           DNK#December  |   7.587302   .4730542      6.660115    8.514488
            ESP#January  |   7.798548   .2137544       7.37959    8.217507
           ESP#February  |   7.712355   .2245054      7.272325    8.152386
              ESP#March  |   8.353755   .2302733      7.902419     8.80509
              ESP#April  |   8.332743   .2127063      7.915839    8.749648
                ESP#May  |   7.843333   .2119632      7.427885    8.258781
               ESP#June  |   8.347273   .2237191      7.908783    8.785762
               ESP#July  |   8.066667    .217674      7.640026    8.493308
             ESP#August  |   8.074144   .2254824      7.632199     8.51609
          ESP#September  |   8.017889   .2230881      7.580637    8.455142
            ESP#October  |    8.26691   .2211975      7.833363    8.700457
           ESP#November  |   7.434555   .2230672      6.997343    7.871767
           ESP#December  |   7.803883   .2313758      7.350387     8.25738
            EST#January  |   7.897436   .7730226      6.382312     9.41256
           EST#February  |   9.535714   .7892836      7.988719    11.08271
              EST#March  |    6.53125   .8671705      4.831596    8.230904
              EST#April  |   5.888889   .9265525      4.072846    7.704932
                EST#May  |   7.727273    .849769      6.061726     9.39282
               EST#June  |   7.428571   .8384517      5.785206    9.071936
               EST#July  |       6.36   .6569938      5.072292    7.647708
             EST#August  |   6.727273   .8109954      5.137722    8.316823
          EST#September  |   8.306122   .7078304      6.918775     9.69347
            EST#October  |          6   .8385856      4.356372    7.643628
           EST#November  |   8.404762   .6782326      7.075426    9.734098
           EST#December  |   7.861111   .8310949      6.232165    9.490057
            FIN#January  |    8.79661   .3975189      8.017473    9.575747
           FIN#February  |   9.037037   .4240435      8.205912    9.868162
              FIN#March  |   9.794118   .3945237      9.020851    10.56738
              FIN#April  |   8.942857   .4267244      8.106478    9.779237
                FIN#May  |    9.14557   .4214312      8.319565    9.971575
               FIN#June  |    9.37037    .401753      8.582935    10.15781
               FIN#July  |   8.753247   .3978031      7.973553    9.532941
             FIN#August  |   8.735632   .3881782      7.974803    9.496461
          FIN#September  |    9.22695   .4285137      8.387064    10.06684
            FIN#October  |   9.145455   .4141131      8.333793    9.957116
           FIN#November  |       9.24   .4233329      8.410268    10.06973
           FIN#December  |   8.171429   .4403753      7.308293    9.034564
            FRA#January  |    8.56044   .5451997      7.491848    9.629031
           FRA#February  |   8.201923   .5308588       7.16144    9.242406
              FRA#March  |       7.89   .5323656      6.846564    8.933436
              FRA#April  |   7.730769   .5258854      6.700034    8.761504
                FRA#May  |   7.546875   .4645212      6.636414    8.457336
               FRA#June  |   8.680672   .4492366      7.800169    9.561176
               FRA#July  |   7.353448   .4745793      6.423273    8.283624
             FRA#August  |   8.022059   .4494571      7.141123    8.902995
          FRA#September  |        8.8   .4622439      7.894002    9.705998
            FRA#October  |   8.720721   .4918952      7.756606    9.684835
           FRA#November  |   8.144231   .5285745      7.108225    9.180237
           FRA#December  |   8.430657   .4729474       7.50368    9.357634
            GBR#January  |   6.364103   .2733318      5.828372    6.899833
           GBR#February  |   6.058462   .2937444      5.482723      6.6342
              GBR#March  |   6.857143   .2878192      6.293017    7.421268
              GBR#April  |   6.889189   .2886111      6.323511    7.454867
                GBR#May  |   6.489796   .2836512       5.93384    7.045752
               GBR#June  |   6.814493   .2952855      6.235733    7.393252
               GBR#July  |   7.098093   .2927847      6.524235    7.671951
             GBR#August  |   6.617555   .3115664      6.006885    7.228225
          GBR#September  |    6.91791     .27849       6.37207    7.463751
            GBR#October  |   7.390374   .2817361      6.838172    7.942577
           GBR#November  |   7.253561   .2933316      6.678631    7.828491
           GBR#December  |    6.57971   .2973603      5.996884    7.162536
            GRC#January  |   8.046875   .6720134      6.729729    9.364021
           GRC#February  |    7.74026    .609338      6.545958    8.934562
              GRC#March  |   7.220339   .7435944      5.762894    8.677784
              GRC#April  |   6.602941   .6306969      5.366775    7.839107
                GRC#May  |   7.421875   .6896358      6.070189    8.773561
               GRC#June  |   7.886076    .588207       6.73319    9.038961
               GRC#July  |   7.716216   .6616709      6.419342    9.013091
             GRC#August  |   8.521127   .6390571      7.268575    9.773679
          GRC#September  |   7.754098   .7383543      6.306924    9.201273
            GRC#October  |   7.213333    .574313       6.08768    8.338987
           GRC#November  |   9.178571   .7189942      7.769343     10.5878
           GRC#December  |   7.618182    .767387      6.114104     9.12226
            HUN#January  |        6.9   1.118975      4.706809    9.093191
           HUN#February  |   7.043478   .9729103      5.136574    8.950382
              HUN#March  |   8.769231   1.129067      6.556259     10.9822
              HUN#April  |   6.148148   .8246621      4.531811    7.764486
                HUN#May  |   8.083333   .9815631       6.15947     10.0072
               HUN#June  |       8.36   .8638673       6.66682    10.05318
               HUN#July  |   7.612903   .7657696      6.111995    9.113811
             HUN#August  |     10.125   .9350511        8.2923     11.9577
          HUN#September  |   9.757576    .967297      7.861674    11.65348
            HUN#October  |   7.928571   .9285714      6.108572    9.748571
           HUN#November  |   6.478261   1.062977      4.394827    8.561695
           HUN#December  |   6.115385   .9303877      4.291825    7.938944
            IRL#January  |   8.341564   .3454745      7.664434    9.018694
           IRL#February  |   7.644809   .3785167      6.902916    8.386701
              IRL#March  |   7.455752     .33416      6.800799    8.110706
              IRL#April  |   8.064039   .3660389      7.346603    8.781476
                IRL#May  |        7.5    .370614      6.773597    8.226403
               IRL#June  |   7.699187   .3482574      7.016603    8.381771
               IRL#July  |   8.263158   .3743302      7.529471    8.996845
             IRL#August  |   7.424528   .3800733      6.679585    8.169472
          IRL#September  |       7.75   .3681985      7.028331    8.471669
            IRL#October  |   7.102222   .3620557      6.392593    7.811851
           IRL#November  |   7.261468    .364007      6.548014    7.974921
           IRL#December  |   7.494949   .3778698      6.754325    8.235574
            ISL#January  |   8.543478   .8007886      6.973933    10.11302
           ISL#February  |          9   .8220448      7.388793    10.61121
              ISL#March  |   8.735294   .8604074      7.048896    10.42169
              ISL#April  |       7.56   .7407442      6.108141    9.011859
                ISL#May  |     8.8125   .8004078      7.243701     10.3813
               ISL#June  |   9.096154   .7308436        7.6637    10.52861
               ISL#July  |   9.070175   .7620624      7.576533    10.56382
             ISL#August  |   7.661017   .7206604      6.248523    9.073511
          ISL#September  |   8.072727   .7538251       6.59523    9.550224
            ISL#October  |   7.733333   .7070535      6.347509    9.119158
           ISL#November  |   7.719298   .7301056      6.288292    9.150305
           ISL#December  |   7.914894   .8126143       6.32217    9.507618
            ISR#January  |   7.945455   .4725733      7.019211    8.871698
           ISR#February  |   7.527473   .5499119      6.449645      8.6053
              ISR#March  |   7.292929   .4955486      6.321654    8.264204
              ISR#April  |   8.867257   .4631668       7.95945    9.775063
                ISR#May  |   8.510417    .531465      7.468746    9.552088
               ISR#June  |   8.061856   .5143588      7.053713    9.069999
               ISR#July  |   8.204082   .5339237      7.157591    9.250572
             ISR#August  |   8.608696   .5453527      7.539804    9.677587
          ISR#September  |   7.909091   .5835691      6.765296    9.052886
            ISR#October  |   8.290323   .5515884      7.209209    9.371436
           ISR#November  |   9.337209   .6042735      8.152833    10.52159
           ISR#December  |   8.420455   .5551416      7.332377    9.508532
            ITA#January  |   9.074324   .4300801      8.231368    9.917281
           ITA#February  |   8.931034    .430256      8.087733    9.774336
              ITA#March  |   8.693878   .4206279      7.869447    9.518308
              ITA#April  |   8.821192   .4292903      7.979783    9.662601
                ITA#May  |   9.039773   .3918289      8.271788    9.807757
               ITA#June  |   8.874172   .4549754      7.982421    9.765924
               ITA#July  |   8.981707   .4276533      8.143507    9.819908
             ITA#August  |   8.541899   .3910538      7.775434    9.308365
          ITA#September  |   9.256684   .3548492       8.56118    9.952189
            ITA#October  |   8.074627    .382577      7.324776    8.824478
           ITA#November  |   9.690608   .3752091      8.955198    10.42602
           ITA#December  |   8.616883   .4505227      7.733859    9.499908
            JPN#January  |   6.157895   1.231324        3.7445    8.571289
           JPN#February  |   4.666667   1.840894      1.058516    8.274817
              JPN#March  |   5.555556   1.132474      3.335906    7.775205
              JPN#April  |   6.888889   1.513315      3.922791    9.854987
                JPN#May  |   4.533333   1.264409      2.055092    7.011575
               JPN#June  |   6.266667   1.607917       3.11515    9.418183
               JPN#July  |   7.409091   1.232073      4.994227    9.823954
             JPN#August  |     8.0625   1.656977      4.814825    11.31017
          JPN#September  |   6.590909   1.005739      4.619661    8.562158
            JPN#October  |   7.666667   1.335782      5.048534     10.2848
           JPN#November  |   7.454545   1.078574      5.340541     9.56855
           JPN#December  |   5.695652   1.127162      3.486416    7.904889
            KOR#January  |   7.076923   1.546135      4.046499    10.10735
           KOR#February  |   7.272727   1.673814      3.992053     10.5534
              KOR#March  |   8.947368    1.28526      6.428259    11.46648
              KOR#April  |   7.153846   1.501479      4.210949    10.09674
                KOR#May  |     7.4375   1.422933      4.648551    10.22645
               KOR#June  |   7.692308   1.554087      4.646297    10.73832
               KOR#July  |        5.5    1.44401      2.669741    8.330259
             KOR#August  |   9.222222   1.541486      6.200909    12.24353
          KOR#September  |   7.933333   1.336187      5.314406    10.55226
            KOR#October  |   8.083333   1.334043      5.468609    10.69806
           KOR#November  |   8.777778   1.269439      6.289679    11.26588
           KOR#December  |        8.3   1.216336      5.915981    10.68402
            LTU#January  |      8.625   .7229918      7.207936    10.04206
           LTU#February  |   5.914286   .9152044      4.120485    7.708086
              LTU#March  |   6.829787   .7301611      5.398672    8.260903
              LTU#April  |   6.176471   .7427254      4.720729    7.632212
                LTU#May  |       7.25   .9338222      5.419709    9.080291
               LTU#June  |   7.833333   .8634511      6.140969    9.525697
               LTU#July  |   7.489362   .7449319      6.029295    8.949428
             LTU#August  |   7.972973   .8634091      6.280691    9.665254
          LTU#September  |       6.35   .8484904      4.686959    8.013041
            LTU#October  |   8.209302   .7787019      6.683047    9.735558
           LTU#November  |   7.302326    .888299       5.56126    9.043391
           LTU#December  |   6.027027   .8160243       4.42762    7.626434
            LUX#January  |   8.259912   .3304981      7.612136    8.907688
           LUX#February  |   7.791667   .3899949      7.027277    8.556057
              LUX#March  |   8.471963   .3506743      7.784641    9.159284
              LUX#April  |   8.430493   .3406463      7.762827     9.09816
                LUX#May  |   8.079498   .3302407      7.432226     8.72677
               LUX#June  |   8.718254   .3263109      8.078685    9.357823
               LUX#July  |   8.156627   .3416715       7.48695    8.826303
             LUX#August  |   8.420814   .3525737       7.72977    9.111859
          LUX#September  |   8.549407   .3335364      7.895676    9.203138
            LUX#October  |   8.560847   .3803601      7.815341    9.306352
           LUX#November  |   8.711443   .3759983      7.974486    9.448399
           LUX#December  |   8.595238   .3641673       7.88147    9.309006
            LVA#January  |   7.210526   1.133176      4.989502    9.431551
           LVA#February  |   6.307692   .8498264      4.642033    7.973352
              LVA#March  |   7.333333   1.040253      5.294438    9.372228
              LVA#April  |      6.875   1.085665      4.747097    9.002903
                LVA#May  |          8   1.226078      5.596887    10.40311
               LVA#June  |    5.03125   .8382061      3.388366    6.674134
               LVA#July  |   6.774194   .9757376      4.861748    8.686639
             LVA#August  |   7.285714    .915388      5.491554    9.079874
          LVA#September  |   7.222222   .8518058      5.552683    8.891761
            LVA#October  |   7.485714   .9306828      5.661576    9.309852
           LVA#November  |   7.724138   1.104064      5.560173    9.888103
           LVA#December  |   6.068966   .9986827      4.111548    8.026383
            MEX#January  |   5.218182   .7370388      3.773586    6.662778
           MEX#February  |       5.74   .7590596      4.252243    7.227757
              MEX#March  |   6.018519   .7265989      4.594385    7.442652
              MEX#April  |   5.981818   .7647499      4.482909    7.480728
                MEX#May  |   4.717949   .5522628      3.635514    5.800384
               MEX#June  |   5.278689   .6791714      3.947513    6.609864
               MEX#July  |   5.180723    .560515      4.082114    6.279332
             MEX#August  |   4.222222   .6082066      3.030138    5.414307
          MEX#September  |   5.197674   .5800655      4.060746    6.334603
            MEX#October  |   4.391892   .5625672       3.28926    5.494523
           MEX#November  |   5.762712   .6966309      4.397316    7.128108
           MEX#December  |   5.693182   .5866322      4.543383    6.842981
            NLD#January  |   7.467742   .4915274      6.504348    8.431136
           NLD#February  |   7.257143   .7338843       5.81873    8.695556
              NLD#March  |          6    .583528      4.856285    7.143715
              NLD#April  |   5.246753   .6264166      4.018977     6.47453
                NLD#May  |   6.609756    .616875      5.400681    7.818831
               NLD#June  |   5.657143   .6473023       4.38843    6.925855
               NLD#July  |   6.605042   .5126541       5.60024    7.609844
             NLD#August  |   6.068182   .5482935      4.993527    7.142837
          NLD#September  |    6.55914   .5924297      5.397978    7.720302
            NLD#October  |   7.584416   .6367506      6.336385    8.832447
           NLD#November  |   5.772727   .6786094      4.442653    7.102801
           NLD#December  |   5.141026   .6032227      3.958709    6.323342
            NOR#January  |       8.26   .7525792      6.784945    9.735055
           NOR#February  |      8.625   .9625604      6.738382    10.51162
              NOR#March  |        8.1   .8892521      6.357066    9.842934
              NOR#April  |   9.054054    .843582      7.400634    10.70747
                NOR#May  |   9.322581   .9830686      7.395766    11.24939
               NOR#June  |   6.422222   .7173808      5.016156    7.828288
               NOR#July  |   8.486486   1.052397      6.423788    10.54918
             NOR#August  |   8.137931    .932083      6.311049    9.964813
          NOR#September  |          7   .7624929      5.505514    8.494486
            NOR#October  |   8.675676   .9404603      6.832374    10.51898
           NOR#November  |   6.965517   .9383493      5.126353    8.804682
           NOR#December  |   8.660377   .8090308      7.074677    10.24608
            NZL#January  |   8.443548   .3381226      7.780828    9.106269
           NZL#February  |   8.282927   .3672246      7.563167    9.002687
              NZL#March  |    8.34375   .3176717      7.721114    8.966386
              NZL#April  |   9.201493   .3258378      8.562851    9.840135
                NZL#May  |    8.21374    .317009      7.592403    8.835078
               NZL#June  |   8.313008   .3299873      7.666233    8.959783
               NZL#July  |   7.905263   .3077221      7.302128    8.508398
             NZL#August  |   8.264605   .2885135      7.699118    8.830091
          NZL#September  |   8.416084   .3031242      7.821961    9.010207
            NZL#October  |   9.003534   .2996334      8.416252    9.590815
           NZL#November  |   8.231317   .3106311       7.62248    8.840154
           NZL#December  |   8.244604   .3085533       7.63984    8.849369
            POL#January  |   7.769231   .9203807      5.965285    9.573177
           POL#February  |   8.333333    .936898      6.497014    10.16965
              POL#March  |       8.28   .9908246      6.337984    10.22202
              POL#April  |     8.5625   1.338434      5.939169    11.18583
                POL#May  |   7.566667   .8745223      5.852603     9.28073
               POL#June  |       8.88   .9938477      6.932059    10.82794
               POL#July  |   6.578947   1.119513      4.384703    8.773192
             POL#August  |   8.060606   .8527356      6.389245    9.731968
          POL#September  |    6.21875   .8190454      4.613421    7.824079
            POL#October  |   7.892857   1.091501      5.753516     10.0322
           POL#November  |   7.863636   1.327849      5.261052    10.46622
           POL#December  |   7.366667   .9618987      5.481346    9.251988
            PRT#January  |   8.112245   .5148505      7.103138    9.121352
           PRT#February  |    7.27619   .4762674      6.342707    8.209674
              PRT#March  |   7.669492   .4492263      6.789008    8.549975
              PRT#April  |   7.828125   .4572133      6.931987    8.724263
                PRT#May  |   8.196581   .4419165      7.330425    9.062737
               PRT#June  |   8.364583   .5170598      7.351146     9.37802
               PRT#July  |   8.019048   .4937301      7.051337    8.986758
             PRT#August  |   7.825688   .4692089      6.906039    8.745337
          PRT#September  |   8.054545   .4762651      7.121066    8.988025
            PRT#October  |   7.176471   .4764726      6.242584    8.110357
           PRT#November  |   8.009091   .4833328      7.061759    8.956423
           PRT#December  |   7.932203   .4549419      7.040517    8.823889
            SVK#January  |   5.085714   .8161927      3.485977    6.685452
           SVK#February  |   5.025641   .7212667      3.611959    6.439324
              SVK#March  |   7.408163   .8420892      5.757669    9.058658
              SVK#April  |   7.408163   .7948165      5.850323    8.966003
                SVK#May  |   7.270833   .7641917      5.773018    8.768649
               SVK#June  |   4.921569   .6572928      3.633275    6.209862
               SVK#July  |   6.785714   .6930613      5.427314    8.144114
             SVK#August  |   6.981132   .7961676      5.420644     8.54162
          SVK#September  |   5.422222   .7166765      4.017537    6.826908
            SVK#October  |   6.471698   .6855357      5.128048    7.815348
           SVK#November  |   6.236842   .8856644       4.50094    7.972744
           SVK#December  |   6.432432   .7936881      4.876804    7.988061
            SVN#January  |   7.245614   .4402793      6.382667    8.108561
           SVN#February  |   8.817204   .5309377      7.776567    9.857842
              SVN#March  |   8.489362   .5402459       7.43048    9.548244
              SVN#April  |   8.770115   .5153877      7.759955    9.780275
                SVN#May  |   9.018692   .4735987      8.090438    9.946945
               SVN#June  |   7.663265   .5076615      6.668249    8.658282
               SVN#July  |    8.54386   .4960863      7.571531    9.516189
             SVN#August  |   8.794393   .4586092      7.895519    9.693266
          SVN#September  |   8.876033    .461846      7.970815    9.781251
            SVN#October  |   7.861111   .5041294      6.873018    8.849205
           SVN#November  |   7.093023   .5605908      5.994265    8.191781
           SVN#December  |   7.666667   .5591045      6.570822    8.762511
            TUR#January  |   8.621212   .7144089      7.220971    10.02145
           TUR#February  |   4.961538   .7854068      3.422141    6.500936
              TUR#March  |       7.76   .9042124      5.987744    9.532256
              TUR#April  |      5.375   .9977293      3.419451    7.330549
                TUR#May  |      7.125   .8631988      5.433131    8.816869
               TUR#June  |   7.538462   1.192581      5.201004    9.875919
               TUR#July  |   7.529412   1.081554      5.409565    9.649258
             TUR#August  |   6.307692   1.078131      4.194555    8.420829
          TUR#September  |   5.575758   .9003685      3.811036     7.34048
            TUR#October  |   7.424242   .9283317      5.604712    9.243772
           TUR#November  |       7.45   1.429897      4.647402     10.2526
           TUR#December  |   8.684211   1.389292      5.961199    11.40722
            USA#January  |   8.456897   .5055008      7.466115    9.447678
           USA#February  |   6.282051   .5552694      5.193723    7.370379
              USA#March  |       7.57    .544069      6.503625    8.636375
              USA#April  |    7.33871   .5052682      6.348384    8.329035
                USA#May  |   7.271028   .5574981      6.178332    8.363724
               USA#June  |   7.456311   .5636317      6.351593    8.561029
               USA#July  |   7.168539   .6083426      5.976188    8.360891
             USA#August  |   6.622642   .4993172       5.64398    7.601303
          USA#September  |   7.593496   .4704853      6.671345    8.515647
            USA#October  |   7.311475   .5141385      6.303764    8.319187
           USA#November  |    7.33913   .5253145      6.309514    8.368747
           USA#December  |   7.368932   .5529269      6.285195    8.452669
--------------------------------------------------------------------------

. 
. *CZE#January
. sum startage if cnt == "CZE" & month == 12

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    startage |         41    6.756098    5.102845          1         17

. sum startage if cnt == "CZE" & month == 1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    startage |         43    9.627907    5.136347          1         17

. 
. sum math read if cnt == "CZE" & month == 12

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        math |      1,540    496.8253    85.99056   221.1355   762.3811
        read |      1,540    492.0706    92.79751   168.2821    739.197

. sum math read if cnt == "CZE" & month == 1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        math |      1,829    513.1607    90.91488   238.0298   749.1815
        read |      1,829    508.0662     97.3459   224.9539   725.0664

.         
. *LTU#January
. sum startage if cnt == "LTU" & month == 12

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    startage |         37    6.027027    4.963682          1         17

. sum startage if cnt == "LTU" & month == 1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    startage |         48       8.625    5.009034          1         17

. sum math read if cnt == "LTU" & month == 12

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        math |      1,095    468.1102    83.13844   230.1472   710.6485
        read |      1,095    460.7743    88.02839   197.4921   716.0563

. sum math read if cnt == "LTU" & month == 1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        math |      1,191    479.6499    85.53542    239.782   717.9001
        read |      1,191    472.9534    91.72216   220.9465   720.2185

. 
. sum startage  if (cnt == "CZE" | cnt == "LTU") & month == 12

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    startage |         78    6.410256    5.017983          1         17

. sum startage  if (cnt == "CZE" | cnt == "LTU") & month == 1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    startage |         91    9.098901    5.066349          1         17

. sum math read if (cnt == "CZE" | cnt == "LTU") & month == 12

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        math |      2,635    484.8925    85.97416   221.1355   762.3811
        read |      2,635    479.0651     92.1298   168.2821    739.197

. sum math read if (cnt == "CZE" | cnt == "LTU") & month == 1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        math |      3,020     499.945    90.31574   238.0298   749.1815
        read |      3,020    494.2187    96.68787   220.9465   725.0664

. 
. *USA#Ferbruary
. *SVN#February
. *SVK#March
. *TUR#March
. *CHL#May
. *CRI#May
. *POL#July
. *EST#September
. 
. *AUT#August
. sum startage if cnt == "AUT" & month == 7

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    startage |        157    8.044586    5.271286          1         17

. sum startage if cnt == "AUT" & month == 8

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    startage |        136    9.735294    5.126887          1         17

. sum math read if cnt == "AUT" & month == 7

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        math |      1,713    493.3394    87.20671     245.88   756.2472
        read |      1,713    480.2487    95.32652   204.1946   731.8493

. sum math read if cnt == "AUT" & month == 8

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        math |      1,694    495.5757    88.26225   217.3861   726.7701
        read |      1,694    484.7594    95.12616   206.0261   736.5652

. 
. *HUN#August
. sum startage if cnt == "HUN" & month == 7

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    startage |         31    7.612903    4.263625          1         17

. sum startage if cnt == "HUN" & month == 8

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    startage |         24      10.125    4.580796          1         17

. sum math read if cnt == "HUN" & month == 7

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        math |      1,556    478.8867    86.15996   224.7475   734.5571
        read |      1,556    478.4144    91.36617   194.9322   704.6795

. sum math read if cnt == "HUN" & month == 8

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        math |      1,438     480.224    85.97356   247.5696   719.7292
        read |      1,438     473.469    91.76375   197.5545   697.4552

. 
. *KOR#August
. sum startage if cnt == "KOR" & month == 7

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    startage |         14         5.5    5.402991          1         16

. sum startage if cnt == "KOR" & month == 8

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    startage |         18    9.222222    6.539973          1         17

. sum math read if cnt == "KOR" & month == 7

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        math |      1,499    534.1341    94.88151    239.608   825.1857
        read |      1,499    522.2087     91.7562   212.0263   753.1311

. sum math read if cnt == "KOR" & month == 8

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        math |      1,546    528.0936    97.79622   212.5786   840.6619
        read |      1,546    516.0054    95.33964   193.1195   754.4848

. 
. sum startage  if (cnt == "AUT" | cnt == "HUN" | cnt == "KOR" ) & month == 7

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    startage |        202     7.80198    5.156303          1         17

. sum startage  if (cnt == "AUT" | cnt == "HUN" | cnt == "KOR" ) & month == 8

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    startage |        178    9.735955    5.189401          1         17

. sum math read if (cnt == "AUT" | cnt == "HUN" | cnt == "KOR" ) & month == 7

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        math |      4,768    501.4482    92.23615   224.7475   825.1857
        read |      4,768    492.8418    95.01774   194.9322   753.1311

. sum math read if (cnt == "AUT" | cnt == "HUN" | cnt == "KOR" ) & month == 8

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        math |      4,678    501.6033    92.93012   212.5786   840.6619
        read |      4,678    491.6151    95.81431   193.1195   754.4848

. 
. gen old=0

. replace old=1 if month>=8
(372,833 real changes made)

. gen month_centered = month-8
(36,390 missing values generated)

. reg startage old##c.month_centered, vce(robust)

Linear regression                               Number of obs     =     66,381
                                                F(3, 66377)       =       1.32
                                                Prob > F          =     0.2655
                                                R-squared         =     0.0001
                                                Root MSE          =     5.3162

--------------------------------------------------------------------------------------
                     |               Robust
            startage | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
               1.old |    .157756   .0814454     1.94   0.053     -.001877     .317389
      month_centered |  -.0134697   .0134129    -1.00   0.315    -.0397589    .0128195
                     |
old#c.month_centered |
                  1  |  -.0191335    .026455    -0.72   0.470    -.0709853    .0327183
                     |
               _cons |   7.866665   .0601206   130.85   0.000     7.748828    7.984501
--------------------------------------------------------------------------------------

. reg math old##c.month_centered, vce(robust)

Linear regression                               Number of obs     =    801,914
                                                F(3, 801910)      =     366.87
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0014
                                                Root MSE          =     89.052

--------------------------------------------------------------------------------------
                     |               Robust
                math | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
               1.old |  -2.699546   .3895537    -6.93   0.000    -3.463058   -1.936034
      month_centered |  -.2992791   .0651271    -4.60   0.000     -.426926   -.1716322
                     |
old#c.month_centered |
                  1  |  -.8999529   .1267267    -7.10   0.000    -1.148333   -.6515727
                     |
               _cons |   486.3894   .2881174  1688.16   0.000     485.8247    486.9541
--------------------------------------------------------------------------------------

. 
. binscatter startage month if (cnt == "AUT" | cnt == "HUN" | cnt == "KOR" ) , line(lfit) rd(7) reportreg
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
RD: month<=7

      Source |       SS           df       MS      Number of obs   =     1,364
-------------+----------------------------------   F(1, 1362)      =      0.35
       Model |  9.27553931         1  9.27553931   Prob > F        =    0.5566
    Residual |  36542.8506     1,362  26.8302868   R-squared       =    0.0003
-------------+----------------------------------   Adj R-squared   =   -0.0005
       Total |  36552.1261     1,363  26.8174073   Root MSE        =    5.1798

------------------------------------------------------------------------------
    startage | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       month |  -.0401437   .0682747    -0.59   0.557    -.1740787    .0937914
       _cons |   8.352882   .3029179    27.57   0.000     7.758645    8.947118
------------------------------------------------------------------------------
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
RD: month>7

      Source |       SS           df       MS      Number of obs   =       946
-------------+----------------------------------   F(1, 944)       =      8.03
       Model |  214.160148         1  214.160148   Prob > F        =    0.0047
    Residual |  25188.3134       944  26.6825354   R-squared       =    0.0084
-------------+----------------------------------   Adj R-squared   =    0.0074
       Total |  25402.4736       945  26.8809244   Root MSE        =    5.1655

------------------------------------------------------------------------------
    startage | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       month |  -.3469398   .1224612    -2.83   0.005    -.5872674   -.1066122
       _cons |   11.95965   1.230816     9.72   0.000     9.544195     14.3751
------------------------------------------------------------------------------

. graph export output/August.png, replace
file output/August.png saved as PNG format

. binscatter math read month if (cnt == "AUT" | cnt == "HUN" | cnt == "KOR" ) , line(lfit) rd(7) reportreg
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
RD: month<=7
y_var = math

      Source |       SS           df       MS      Number of obs   =    32,277
-------------+----------------------------------   F(1, 32275)     =      0.76
       Model |  6452.99529         1  6452.99529   Prob > F        =    0.3841
    Residual |   274966698    32,275   8519.4949   R-squared       =    0.0000
-------------+----------------------------------   Adj R-squared   =   -0.0000
       Total |   274973151    32,276  8519.43088   Root MSE        =    92.301

------------------------------------------------------------------------------
        math | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       month |  -.2252558   .2588226    -0.87   0.384    -.7325577    .2820462
       _cons |   506.1101   1.166775   433.77   0.000     503.8232     508.397
------------------------------------------------------------------------------
y_var = read

      Source |       SS           df       MS      Number of obs   =    32,277
-------------+----------------------------------   F(1, 32275)     =      0.09
       Model |  834.160217         1  834.160217   Prob > F        =    0.7629
    Residual |   295889163    32,275    9167.751   R-squared       =    0.0000
-------------+----------------------------------   Adj R-squared   =   -0.0000
       Total |   295889998    32,276   9167.4928   Root MSE        =    95.748

------------------------------------------------------------------------------
        read | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       month |  -.0809879   .2684891    -0.30   0.763    -.6072365    .4452608
       _cons |   496.1925   1.210351   409.96   0.000     493.8202    498.5648
------------------------------------------------------------------------------
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
RD: month>7
y_var = math

      Source |       SS           df       MS      Number of obs   =    23,356
-------------+----------------------------------   F(1, 23354)     =      4.58
       Model |  38374.3724         1  38374.3724   Prob > F        =    0.0323
    Residual |   195630585    23,354  8376.74852   R-squared       =    0.0002
-------------+----------------------------------   Adj R-squared   =    0.0002
       Total |   195668959    23,355  8378.03294   Root MSE        =    91.525

------------------------------------------------------------------------------
        math | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       month |  -.9139073   .4269915    -2.14   0.032    -1.750839   -.0769759
       _cons |   510.0882   4.294401   118.78   0.000     501.6709    518.5055
------------------------------------------------------------------------------
y_var = read

      Source |       SS           df       MS      Number of obs   =    23,356
-------------+----------------------------------   F(1, 23354)     =      3.63
       Model |  32772.8039         1  32772.8039   Prob > F        =    0.0566
    Residual |   210589358    23,354  9017.27146   R-squared       =    0.0002
-------------+----------------------------------   Adj R-squared   =    0.0001
       Total |   210622130    23,355  9018.28861   Root MSE        =    94.959

------------------------------------------------------------------------------
        read | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       month |  -.8445751   .4430156    -1.91   0.057    -1.712915    .0237646
       _cons |   500.8459   4.455561   112.41   0.000     492.1127    509.5791
------------------------------------------------------------------------------

. graph export output/Augustscores.png, replace
file output/Augustscores.png saved as PNG format

. 
end of do-file

. exit, clear
