
. set obs 10000
Number of observations (_N) was 0, now 10,000.

. gen e = rnormal(0,1)

. gen t = rnormal(1,1)

. gen x  = (_n > 6000)

. gen d = 0

. replace d = 1 if x == 1 & runiform() < 0.8
(3,174 real changes made)

. replace d = 1 if x == 0 & runiform() < 0.5
(3,009 real changes made)

. gen y = t * d + 5 * x + e

. 
. *5bcd
. eststo: reg y d if x == 0

      Source |       SS           df       MS      Number of obs   =     6,000
-------------+----------------------------------   F(1, 5998)      =   1003.09
       Model |  1507.90396         1  1507.90396   Prob > F        =    0.0000
    Residual |  9016.55067     5,998  1.50325953   R-squared       =    0.1433
-------------+----------------------------------   Adj R-squared   =    0.1431
       Total |  10524.4546     5,999  1.75436816   Root MSE        =    1.2261

------------------------------------------------------------------------------
           y | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
           d |   1.002636   .0316573    31.67   0.000     .9405761    1.064695
       _cons |  -.0089769   .0224186    -0.40   0.689    -.0529254    .0349717
------------------------------------------------------------------------------
(est1 stored)

. eststo: reg y d if x == 1

      Source |       SS           df       MS      Number of obs   =     4,000
-------------+----------------------------------   F(1, 3998)      =    321.51
       Model |  584.666131         1  584.666131   Prob > F        =    0.0000
    Residual |  7270.33445     3,998  1.81849286   R-squared       =    0.0744
-------------+----------------------------------   Adj R-squared   =    0.0742
       Total |  7855.00058     3,999   1.9642412   Root MSE        =    1.3485

------------------------------------------------------------------------------
           y | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
           d |    .944475   .0526735    17.93   0.000     .8412056    1.047744
       _cons |   5.040849   .0469208   107.43   0.000     4.948858     5.13284
------------------------------------------------------------------------------
(est2 stored)

. eststo: reg y d x

      Source |       SS           df       MS      Number of obs   =    10,000
-------------+----------------------------------   F(2, 9997)      =  21302.18
       Model |   69416.629         2  34708.3145   Prob > F        =    0.0000
    Residual |   16288.428     9,997   1.6293316   R-squared       =    0.8099
-------------+----------------------------------   Adj R-squared   =    0.8099
       Total |   85705.057     9,999  8.57136284   Root MSE        =    1.2765

------------------------------------------------------------------------------
           y | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
           d |   .9849499   .0274941    35.82   0.000      .931056    1.038844
           x |    5.00884   .0272643   183.71   0.000     4.955397    5.062284
       _cons |  -.0001074   .0214865    -0.00   0.996    -.0422254    .0420105
------------------------------------------------------------------------------
(est3 stored)

. eststo: reg y d

      Source |       SS           df       MS      Number of obs   =    10,000
-------------+----------------------------------   F(1, 9998)      =   2023.32
       Model |  14425.1289         1  14425.1289   Prob > F        =    0.0000
    Residual |  71279.9282     9,998   7.1294187   R-squared       =    0.1683
-------------+----------------------------------   Adj R-squared   =    0.1682
       Total |   85705.057     9,999  8.57136284   Root MSE        =    2.6701

------------------------------------------------------------------------------
           y | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
           d |   2.472288   .0549625    44.98   0.000     2.364551    2.580026
       _cons |   1.083807   .0432181    25.08   0.000     .9990909    1.168523
------------------------------------------------------------------------------
(est4 stored)

. esttab, se

----------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)   
                        y               y               y               y   
----------------------------------------------------------------------------
d                   1.003***        0.944***        0.985***        2.472***
                 (0.0317)        (0.0527)        (0.0275)        (0.0550)   

x                                                   5.009***                
                                                 (0.0273)                   

_cons            -0.00898           5.041***    -0.000107           1.084***
                 (0.0224)        (0.0469)        (0.0215)        (0.0432)   
----------------------------------------------------------------------------
N                    6000            4000           10000           10000   
----------------------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. cap log close
